{
  "section_id": "line_1766085084910_3rdtrle5k",
  "decisions": [
    {
      "id": "a574914a-c9de-44cc-b740-8e31be36a915",
      "is_valid": true,
      "decision_content": {
        "type": "GUIDELINE",
        "id": "zebracorp-non-solicitation-principle-001",
        "verbatim_text": "We can agree as a general principle we will avoid enticing, or soliciting other party’s employees during the term of a contract.",
        "plain_text": "As a general principle, Zebracorp will avoid enticing or soliciting the other party’s employees during the term of a contract.",
        "expert_insight": "This statement establishes a foundational principle for Zebracorp's conduct regarding non-solicitation. While the document notes the difficulty in monitoring *binding* non-solicitation undertakings, this general principle serves as an ethical and commercial guideline to maintain good relations and avoid disputes, even if not always formally enforceable as a strict contractual clause.",
        "confidence": 1.0,
        "classification": "MEDIUM",
        "conditions": "During the term of a contract.",
        "justification": "States a general principle of conduct that Zebracorp commits to follow.",
        "implication_company": "Zebracorp is expected to adhere to this principle, instructing its personnel to avoid actively soliciting employees of contracting parties during the contract term.",
        "implication_supplier": "Suppliers can generally expect Zebracorp to respect their workforce and not actively solicit their employees while a contract is in force, based on this stated principle.",
        "source_insight": "The text distinguishes this 'general principle' from 'binding non-solicitation undertakings,' which are harder to monitor. This principle guides Zebracorp's conduct even when formal binding clauses are not in place or are difficult to enforce."
      },
      "rationale": "Consensus Check: Agents 1, 3, 4, 5 classified this as a GUIDELINE, while Agent 2 classified it as OTHER (TACTIC). The phrase 'we will avoid' indicates a commitment to a specific course of action or conduct, even if it's presented as a 'general principle' rather than a strictly binding contractual obligation. The preceding text discusses the difficulty of monitoring *binding* provisions, but this statement still sets an expectation for Zebracorp's behavior. Therefore, GUIDELINE is the most appropriate classification as it dictates a specific action to be avoided.\nValue Assessment: The plain_text is clear and self-sufficient, accurately reflecting the verbatim text. It provides a clear directive for Zebracorp's conduct.\nType-Specific Criteria: As a GUIDELINE, it is actionable ('avoid enticing or soliciting') and complete, specifying the condition ('during the term of a contract'). It is not generic advice but a specific behavioral expectation. The 'general principle' aspect suggests a MEDIUM classification, as it's a guiding rule rather than an absolute, always-enforceable contractual obligation.\nUtility Check: This finding is specific, helps define Zebracorp's default position on non-solicitation, and contributes to maintaining ethical business relations, thus passing the utility check.",
      "decision_confidence": 1.0,
      "source_cluster_id": "e7235581-4798-4252-8e4d-f671d7ae450c",
      "supporting_evidence": [
        "36a70a8f-51cb-464f-b7be-accbea0b301f",
        "fd0d753e-6921-4208-b03d-a3050ef84a12",
        "90ec5e1d-655c-4261-9835-78de37dcb92c",
        "0a734d2d-50df-4015-9175-c36f0f1abf70"
      ]
    },
    {
      "id": "e9d53009-2f64-475c-a953-9c7d91ad37f2",
      "is_valid": true,
      "decision_content": {
        "type": "GUIDELINE",
        "id": "b2c3d4e5-f6a7-8901-2345-67890abcdef0",
        "verbatim_text": "Any binding non-solicitation undertakings should be made only in respect of certain key employees and should be discussed with Legal & Compliance.",
        "plain_text": "When Zebracorp agrees to a binding non-solicitation undertaking, it must be limited exclusively to certain key employees and requires mandatory discussion with Legal & Compliance.",
        "expert_insight": "This guideline establishes critical internal controls for Zebracorp when considering binding non-solicitation clauses. It mandates limiting the scope to key employees and requires consultation with Legal & Compliance, reflecting Zebracorp's reserved position and mitigating risks associated with monitoring and enforceability.",
        "confidence": 1.0,
        "classification": "HIGH",
        "conditions": "When Zebracorp agrees to a binding non-solicitation undertaking.",
        "justification": "To manage the inherent difficulties in monitoring and implementing broad non-solicitation clauses, ensure enforceability, and align with Zebracorp's cautious approach to such provisions.",
        "implication_company": "Zebracorp has a strict obligation to narrow the scope of any binding non-solicitation clauses to key personnel only and to ensure these are vetted by Legal & Compliance, thereby managing legal and operational risks.",
        "implication_supplier": "Suppliers seeking binding non-solicitation clauses from Zebracorp should anticipate that such clauses will be strictly limited to key employees and will require Zebracorp's internal legal review.",
        "source_insight": "The use of 'should' in this context, combined with 'only' and the requirement for Legal & Compliance discussion, indicates a strong, almost mandatory internal policy or directive for managing high-risk undertakings."
      },
      "rationale": "Consensus Check: The verbatim text is identical across all candidates. Type classification was split, with three agents classifying it as 'GUIDELINE' and one as 'OTHER' (Instruction). As a tie-breaker, the text 'Any binding non-solicitation undertakings should be made only in respect of certain key employees and should be discussed with Legal & Compliance' clearly establishes a specific obligation and restriction for Zebracorp when entering into such agreements, making 'GUIDELINE' the most appropriate classification.\nValue Assessment: The finding is clear, self-sufficient, and provides actionable guidance. It does not refer to undefined external context.\nType-Specific Criteria (GUIDELINE): It creates specific obligations (limit to key employees, discuss with Legal & Compliance) and is not generic advice. The 'HIGH' classification is justified given Zebracorp's reserved position on non-solicitation clauses and the need for strict internal controls.\nUtility Check: This is a highly useful guideline for Zebracorp, providing clear boundaries and mandatory steps for managing a high-risk contractual element, aiding in negotiation and risk mitigation.",
      "decision_confidence": 1.0,
      "source_cluster_id": "27d96221-797a-4a27-9367-9a45fdc8045a",
      "supporting_evidence": [
        "408c8eb5-e599-410b-a35b-4c3b81d9a45e",
        "362e42d0-ff95-472e-8707-74b1011bdf76",
        "9fffc471-e3f6-4d05-82cc-6556ec6ceb7f",
        "27ac29c9-b480-49b1-a2ff-29210335ae62"
      ]
    },
    {
      "id": "772961ce-bbdd-4979-b56a-49d24928ad85",
      "is_valid": true,
      "decision_content": {
        "type": "GUIDELINE",
        "id": "cluster_non_solicitation_carve_out",
        "verbatim_text": "Whenever we agree to a binding non-solicitation undertaking, we should specify that the restriction to hire will not apply to any employees that contact us through their own initiative or as a result of a general advertisement which is not directed against the employees of the supplier. This can be accomplished by in e.g. the following insertion: “The Parties agree that they will not actively entice or solicit each other's employees engaged in the performance of this [Agreement].Despite the foregoing, it is expressly agreed and understood that both Parties shall be free to recruit persons following general advertisements by that Party which are not specifically directed at the employees concerned, and to recruit any employees making an approach to a Party either directly or through a recruitment agent where there has been no direct solicitation by that Party.”",
        "plain_text": "When agreeing to a binding non-solicitation undertaking, Zebracorp must ensure the agreement specifies that the restriction to hire does not apply to employees who contact Zebracorp on their own initiative or respond to general advertisements not specifically targeting the supplier's employees. The recommended contractual language for this exception is: 'The Parties agree that they will not actively entice or solicit each other's employees engaged in the performance of this [Agreement]. Despite the foregoing, it is expressly agreed and understood that both Parties shall be free to recruit persons following general advertisements by that Party which are not specifically directed at the employees concerned, and to recruit any employees making an approach to a Party either directly or through a recruitment agent where there has been no direct solicitation by that Party.'",
        "expert_insight": "This is a critical guideline for drafting non-solicitation clauses. It provides essential carve-outs for general advertisements and unsolicited approaches, protecting Zebracorp's ability to recruit talent through legitimate means without violating the non-solicitation undertaking. This balances the prohibition with necessary recruitment flexibility and prevents overly broad or anti-competitive interpretations.",
        "confidence": 1.0,
        "classification": "CRITICAL",
        "conditions": "Applies whenever Zebracorp agrees to a binding non-solicitation undertaking.",
        "justification": "To protect Zebracorp's legitimate recruitment efforts, avoid overly broad restrictions, and ensure legal defensibility of non-solicitation clauses by allowing for passive recruitment and unsolicited applications.",
        "implication_company": "Zebracorp must actively ensure these specific exceptions are included in any binding non-solicitation clauses to maintain its ability to hire talent through general advertisements or unsolicited approaches, thereby protecting its recruitment flexibility.",
        "implication_supplier": "Suppliers should expect Zebracorp to include these exceptions in non-solicitation agreements, meaning their employees are not restricted from being hired by Zebracorp if they initiate contact or respond to general, untargeted advertisements.",
        "source_insight": "This is presented as a best practice and recommended contractual language for implementing non-solicitation clauses, ensuring necessary protections for Zebracorp's recruitment activities."
      },
      "rationale": "Consensus: Mixed on Type (GUIDELINE vs OTHER) and scope. Agents 2, 3, 4, 5 split the instruction from the example clause, classifying them as 'OTHER' (TACTIC/EXAMPLE/INSTRUCTION) or 'GUIDELINE'. Agent 1 classified the example clause as 'GUIDELINE'. Agent 6 combined both parts into a single 'GUIDELINE'.\n\nEvaluation: The source text presents a clear directive ('we should specify that the restriction to hire will not apply...') followed immediately by the recommended contractual language to achieve this ('This can be accomplished by in e.g. the following insertion...'). This combined statement forms a single, actionable guideline for contract drafting. The content of the recommended clause defines specific rights and exceptions to the non-solicitation obligation, making it a definitive 'GUIDELINE'. The 'plain_text' has been made self-sufficient by explicitly stating what 'This' refers to. It passes the Clarity, Value, Necessity, and Utility checks as it provides critical, actionable advice and specific language to protect Zebracorp's recruitment flexibility. The classification as 'CRITICAL' is justified by the expert insights emphasizing its importance as a 'crucial carve-out' and 'defensive tactic'.",
      "decision_confidence": 1.0,
      "source_cluster_id": "97e0a4a7-bc0f-4fd3-b976-cd6d2f697f7c",
      "supporting_evidence": [
        "d82fd8b9-a603-499f-9964-9f6c82ebe942",
        "97810c75-0747-46fe-84ba-aa221c0a8143",
        "7841326d-648f-4c8f-8bc6-0211c02d57f8",
        "bd33c34d-acf2-4021-b518-33bb9683424a",
        "a03ecc2e-3598-4224-85ae-ff5920ce5280",
        "1456c63a-2720-4028-b71f-016e30450b2f"
      ]
    },
    {
      "id": "e72c9f3e-7179-4283-b366-038cb328954c",
      "is_valid": true,
      "decision_content": {
        "type": "GUIDELINE",
        "id": "d4e5f6a7-b8c9-0123-4567-890abcdef012",
        "verbatim_text": "Non-solicitation clause should only apply to present employees of a party and should exclude former employees i.e. employees that have been dismissed or released.",
        "plain_text": "Non-solicitation clauses should only cover current employees of a party and must explicitly exclude former employees, including those who have been dismissed or released.",
        "expert_insight": "This guideline is crucial for limiting the scope and duration of non-solicitation obligations. By excluding former employees, Zebracorp prevents being unduly restricted in hiring individuals who are no longer employed by the other party, which is a common and reasonable carve-out in commercial agreements. This ensures the clause is reasonable, enforceable, and does not unduly restrict talent acquisition.",
        "confidence": 1.0,
        "classification": "HIGH",
        "conditions": "When drafting or agreeing to a non-solicitation clause.",
        "justification": "To ensure the non-solicitation clause is reasonable, enforceable, and does not unduly restrict the hiring of individuals no longer associated with the other party, thereby protecting Zebracorp's talent acquisition options and preventing overly broad or anti-competitive restrictions.",
        "implication_company": "Zebracorp must ensure its non-solicitation clauses are precisely worded to cover only current employees and explicitly exclude former employees, enhancing its talent acquisition flexibility and reducing potential liability.",
        "implication_supplier": "The supplier's non-solicitation rights do not extend to their former employees, and they should expect Zebracorp to resist clauses that cover former employees.",
        "source_insight": "The use of 'should' indicates a strong recommendation for drafting, aiming to protect Zebracorp's interests by limiting the scope of non-solicitation obligations to active employees only. This reflects an internal company policy/guidance and best practice for contract drafting."
      },
      "rationale": "Consensus: Mixed (3 GUIDELINE, 1 OTHER). Evaluation: The verbatim text 'Non-solicitation clause should only apply to present employees of a party and should exclude former employees i.e. employees that have been dismissed or released' provides a clear, specific, and actionable instruction on how non-solicitation clauses must be drafted. The use of 'should only apply' and 'should exclude' indicates a mandatory drafting principle rather than a mere tactic or general advice. This directly impacts contractual obligations and Zebracorp's hiring flexibility, thus classifying it as a 'GUIDELINE' is appropriate. The finding is self-sufficient, passes the Value Assessment, and is highly useful for contract negotiation and drafting. It is classified as HIGH priority due to its importance in limiting scope and potential liability.",
      "decision_confidence": 1.0,
      "source_cluster_id": "6d3870d6-304c-4aea-bc5d-27295e5b600f",
      "supporting_evidence": [
        "646b610b-0da7-453d-bb90-5712d1d3a8ee",
        "0e600afe-3b6d-45e9-abec-06a08a4f4b15",
        "9edc2e1a-6ec4-4d93-b040-ba8cbc2f34d1",
        "2eb78ada-bdff-473e-b8ab-15ca3ec6f4e6"
      ]
    },
    {
      "id": "a0359b4f-54fb-4138-b8ff-3628c1cea8fd",
      "is_valid": true,
      "decision_content": {
        "type": "OTHER",
        "id": "golden-record-non-solicitation-rationale-1",
        "verbatim_text": "Zebracorp position towards binding non-solicitation provisions is reserved. This is because monitoring non-solicitation undertakings can be next to impossible in a multinational company such as Zebracorp. The sheer number of subcontracting agreements Zebracorp enters into with its supplier makes these type of covenants difficult to implement.",
        "plain_text": "Zebracorp maintains a reserved stance on binding non-solicitation provisions due to the significant challenges in monitoring and implementing them effectively across a multinational company with numerous subcontracting agreements.",
        "expert_insight": "This outlines Zebracorp's internal policy and the practical difficulties it faces in enforcing broad non-solicitation clauses, providing a strong rationale for their cautious approach in negotiations.",
        "confidence": 1.0,
        "subtype": "INFO",
        "justification": "Monitoring non-solicitation undertakings is next to impossible in a multinational company like Zebracorp due to the sheer number of subcontracting agreements, making these covenants difficult to implement.",
        "implication_company": "Zebracorp should aim to avoid or limit binding non-solicitation clauses due to practical enforcement difficulties and internal operational challenges.",
        "implication_supplier": "Suppliers should understand Zebracorp's reluctance and anticipate resistance to broad, all-encompassing non-solicitation provisions, potentially leading to negotiations for softer or more limited clauses.",
        "source_insight": "This text reveals Zebracorp's internal policy and operational challenges, explaining their 'reserved' position on binding non-solicitation provisions."
      },
      "rationale": "Consensus: All agents agreed on the 'OTHER' type with 'INFO' subtype and identical verbatim text. Value Assessment: The text clearly explains Zebracorp's internal policy and the practical reasons behind its reserved stance on non-solicitation provisions. It is self-sufficient and provides crucial context. Type-Specific Criteria: As 'OTHER' (INFO), it effectively contextualizes Zebracorp's position without being a rule or definition. Utility Check: This finding is highly valuable as it helps understand Zebracorp's negotiation strategy and underlying operational challenges, making it useful for contract negotiation.",
      "decision_confidence": 1.0,
      "source_cluster_id": "d612d4a1-0f19-45b2-ab72-cda8c3131e32",
      "supporting_evidence": [
        "c7f97b71-d357-4a10-8aa9-1147fb0ac4e1",
        "986e2a6d-0f3a-4972-a089-f6d46944975e",
        "8a0c34d2-5005-4661-88e6-2110feaddb84"
      ]
    },
    {
      "id": "6dc62ff2-65d8-4937-8e44-6c46beacc4b9",
      "is_valid": true,
      "decision_content": {
        "type": "OTHER",
        "id": "cluster_non_solicitation_template_reference",
        "verbatim_text": "Please see in e.g. Article 25 of the Zebracorp generic Subcontracting Agreement template.",
        "plain_text": "For a practical example of a non-solicitation clause, refer to Article 25 of Zebracorp's standard Subcontracting Agreement template.",
        "expert_insight": "This is an internal directive to consult existing company resources, providing a specific reference point for understanding how non-solicitation provisions are typically structured within Zebracorp's standard agreements, ensuring consistency and leveraging pre-approved language.",
        "confidence": 1.0,
        "subtype": "EXAMPLE",
        "justification": "Provides an internal process step or reference point for employees to find examples of non-solicitation clauses.",
        "implication_company": "Employees should consult the specified template to understand Zebracorp's standard approach to non-solicitation, providing a concrete internal resource for drafting or reviewing such clauses.",
        "implication_supplier": "Not directly applicable to the supplier, but indicates Zebracorp's reliance on standardized agreements and internal documentation.",
        "source_insight": "Implies that the template contains the preferred wording or approach for non-solicitation, serving as an internal documentation reference."
      },
      "rationale": "Consensus: All agents agreed on 'OTHER' type. Subtype split between 'INSTRUCTION' and 'EXAMPLE'. The phrase 'Please see in e.g.' functions as an instruction to view an example. Given its purpose in the document, 'EXAMPLE' is the most fitting subtype as it describes the nature of the reference. Value Assessment: The verbatim text is clear and self-sufficient. The plain_text has been enhanced to provide better context. Utility Check: This finding provides a valuable internal reference point, directing users to a specific template for consistency in drafting non-solicitation clauses. Therefore, it is a valid and useful finding.",
      "decision_confidence": 1.0,
      "source_cluster_id": "7806810c-641e-46eb-91c2-e3380fae40ea",
      "supporting_evidence": [
        "27f2b230-af44-4dee-934e-c01bcecb023d",
        "19ed5317-bfeb-41cf-9ea7-262fee93e3ca",
        "e8fda833-72a2-4e44-a4bd-9c21f8e84e3b"
      ]
    },
    {
      "id": "83d220d9-5511-4f60-8665-3ec5beb2ecb7",
      "is_valid": true,
      "decision_content": {
        "type": "DEFINITION",
        "id": "golden_14f2a5e8-5b4d-4e9c-8a1a-7b3c2d1e0f9a",
        "verbatim_text": "Non-solicitation provisions restrict a party from soliciting employees from another party during a certain period of time.",
        "plain_text": "Non-solicitation provisions are contractual clauses that restrict one party from soliciting or enticing employees from another party for a specified duration.",
        "expert_insight": "This defines the core concept and fundamental purpose of non-solicitation clauses, which is to protect a party's workforce stability by preventing competitors or partners from poaching their employees during a contract term.",
        "confidence": 1.0,
        "justification": "N/A",
        "implication_company": "N/A",
        "implication_supplier": "N/A",
        "source_insight": "N/A"
      },
      "rationale": "Consensus: Agents unanimously agreed on the 'DEFINITION' type. Value Assessment: The verbatim text clearly defines 'Non-solicitation provisions' and is self-sufficient. Type-Specific Criteria: This is an accurate and necessary definition of a specific contractual term, not a common English word. Utility Check: This definition is crucial for understanding the document's subject matter. The plain_text and expert_insight have been refined for optimal clarity and completeness.",
      "decision_confidence": 1.0,
      "source_cluster_id": "2381392b-a66c-4b1b-b55f-2cddf664a123",
      "supporting_evidence": [
        "8e412dcd-7a45-4f58-8ff6-a8781cb2250b",
        "38504da4-c46f-40f4-861e-522eb9d67fa4"
      ]
    }
  ],
  "clusters": [
    {
      "id": "e7235581-4798-4252-8e4d-f671d7ae450c",
      "recommendation_ids": [
        "36a70a8f-51cb-464f-b7be-accbea0b301f",
        "fd0d753e-6921-4208-b03d-a3050ef84a12",
        "90ec5e1d-655c-4261-9835-78de37dcb92c",
        "0a734d2d-50df-4015-9175-c36f0f1abf70"
      ]
    },
    {
      "id": "27d96221-797a-4a27-9367-9a45fdc8045a",
      "recommendation_ids": [
        "408c8eb5-e599-410b-a35b-4c3b81d9a45e",
        "362e42d0-ff95-472e-8707-74b1011bdf76",
        "9fffc471-e3f6-4d05-82cc-6556ec6ceb7f",
        "27ac29c9-b480-49b1-a2ff-29210335ae62"
      ]
    },
    {
      "id": "97e0a4a7-bc0f-4fd3-b976-cd6d2f697f7c",
      "recommendation_ids": [
        "d82fd8b9-a603-499f-9964-9f6c82ebe942",
        "97810c75-0747-46fe-84ba-aa221c0a8143",
        "7841326d-648f-4c8f-8bc6-0211c02d57f8",
        "bd33c34d-acf2-4021-b518-33bb9683424a",
        "a03ecc2e-3598-4224-85ae-ff5920ce5280",
        "1456c63a-2720-4028-b71f-016e30450b2f"
      ]
    },
    {
      "id": "6d3870d6-304c-4aea-bc5d-27295e5b600f",
      "recommendation_ids": [
        "646b610b-0da7-453d-bb90-5712d1d3a8ee",
        "0e600afe-3b6d-45e9-abec-06a08a4f4b15",
        "9edc2e1a-6ec4-4d93-b040-ba8cbc2f34d1",
        "2eb78ada-bdff-473e-b8ab-15ca3ec6f4e6"
      ]
    },
    {
      "id": "d612d4a1-0f19-45b2-ab72-cda8c3131e32",
      "recommendation_ids": [
        "c7f97b71-d357-4a10-8aa9-1147fb0ac4e1",
        "986e2a6d-0f3a-4972-a089-f6d46944975e",
        "8a0c34d2-5005-4661-88e6-2110feaddb84"
      ]
    },
    {
      "id": "7806810c-641e-46eb-91c2-e3380fae40ea",
      "recommendation_ids": [
        "27f2b230-af44-4dee-934e-c01bcecb023d",
        "19ed5317-bfeb-41cf-9ea7-262fee93e3ca",
        "e8fda833-72a2-4e44-a4bd-9c21f8e84e3b"
      ]
    },
    {
      "id": "2381392b-a66c-4b1b-b55f-2cddf664a123",
      "recommendation_ids": [
        "8e412dcd-7a45-4f58-8ff6-a8781cb2250b",
        "38504da4-c46f-40f4-861e-522eb9d67fa4"
      ]
    }
  ],
  "recommendations": [
    {
      "id": "36a70a8f-51cb-464f-b7be-accbea0b301f",
      "content": {
        "id": "a1b2c3d4-e5f6-7890-1234-567890abcdef",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "We can agree as a general principle we will avoid enticing, or soliciting other party’s employees during the term of a contract.",
        "plain_text": "Zebracorp should, as a general principle, avoid enticing or soliciting the other party’s employees during the term of a contract.",
        "expert_insight": "This establishes a baseline ethical and commercial principle for Zebracorp, even if formal binding clauses are difficult to monitor. Adhering to this principle helps maintain good commercial relations and avoids potential disputes, even without strict legal enforceability in all cases.",
        "confidence": 1.0,
        "conditions": "During the term of a contract.",
        "justification": "States a general principle Zebracorp *will* follow, indicating a strong preference for conduct.",
        "implication_company": "Zebracorp has a duty to generally refrain from soliciting the other party's employees.",
        "implication_supplier": "The supplier can expect Zebracorp to generally avoid soliciting their employees.",
        "source_insight": "The text notes the difficulty in monitoring such undertakings, suggesting this is a guiding principle rather than a strictly enforceable rule in all contexts, unless explicitly made binding.",
        "text": "We can agree as a general principle we will avoid enticing, or soliciting other party’s employees during the term of a contract."
      },
      "source_agent": "AGENT_1",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "Senior Legal Counsel (Guidelines)",
        "model": "gemini-2.5-flash",
        "temperature": 0.0,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_1_prompt.txt"
      }
    },
    {
      "id": "408c8eb5-e599-410b-a35b-4c3b81d9a45e",
      "content": {
        "id": "b2c3d4e5-f6a7-8901-2345-67890abcdef0",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "Any binding non-solicitation undertakings should be made only in respect of certain key employees and should be discussed with Legal & Compliance.",
        "plain_text": "If Zebracorp agrees to a binding non-solicitation undertaking, it must be limited to certain key employees and require prior discussion with Legal & Compliance.",
        "expert_insight": "This guideline is crucial for risk management. Limiting binding non-solicitation to key employees reduces the operational burden and potential liability for Zebracorp. Involving Legal & Compliance ensures that such clauses are properly vetted for enforceability and strategic alignment, given Zebracorp's general reservation about these provisions.",
        "confidence": 1.0,
        "conditions": "Any binding non-solicitation undertakings.",
        "justification": "Sets critical conditions and internal consultation requirements for entering into binding non-solicitation clauses, which are considered high-risk.",
        "implication_company": "Zebracorp has a duty to limit the scope of binding non-solicitation to key employees and to consult Legal & Compliance. This protects Zebracorp from overly broad restrictions.",
        "implication_supplier": "The supplier's ability to impose binding non-solicitation on Zebracorp is limited to key employees and requires specific negotiation.",
        "source_insight": "The use of 'should' indicates a strong recommendation, almost mandatory given the context of 'binding undertakings' and Zebracorp's reserved position.",
        "text": "Any binding non-solicitation undertakings should be made only in respect of certain key employees and should be discussed with Legal & Compliance."
      },
      "source_agent": "AGENT_1",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "Senior Legal Counsel (Guidelines)",
        "model": "gemini-2.5-flash",
        "temperature": 0.0,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_1_prompt.txt"
      }
    },
    {
      "id": "d82fd8b9-a603-499f-9964-9f6c82ebe942",
      "content": {
        "id": "c3d4e5f6-a7b8-9012-3456-7890abcdef01",
        "type": "GUIDELINE",
        "classification": "CRITICAL",
        "verbatim_text": "The Parties agree that they will not actively entice or solicit each other's employees engaged in the performance of this [Agreement].Despite the foregoing, it is expressly agreed and understood that both Parties shall be free to recruit persons following general advertisements by that Party which are not specifically directed at the employees concerned, and to recruit any employees making an approach to a Party either directly or through a recruitment agent where there has been no direct solicitation by that Party.",
        "plain_text": "When a binding non-solicitation clause is included, Zebracorp (and the other party) must not actively entice or solicit employees engaged in the agreement. However, Zebracorp retains the right to recruit through general advertisements not specifically targeting the other party's employees, or from individuals who approach Zebracorp unsolicited.",
        "expert_insight": "This is the core contractual language for a binding non-solicitation clause, balancing the prohibition with essential carve-outs. The exceptions for general advertisements and unsolicited approaches are CRITICAL for Zebracorp to maintain its ability to hire talent without undue restriction, especially given the difficulty in monitoring such clauses.",
        "confidence": 1.0,
        "conditions": "When a binding non-solicitation undertaking is agreed and inserted into the contract.",
        "justification": "This is the precise contractual language provided as an example insertion, containing both the core obligation and critical exceptions, making it a CRITICAL rule for implementation.",
        "implication_company": "Zebracorp has a duty not to actively solicit, but retains the right to hire through general advertisements or unsolicited approaches. This protects Zebracorp's recruitment flexibility.",
        "implication_supplier": "The supplier has a right not to have their employees actively solicited, but must accept that Zebracorp can hire their employees via general advertisements or unsolicited approaches.",
        "source_insight": "This is presented as an example insertion, indicating it's the preferred and recommended wording for such clauses, ensuring necessary protections for Zebracorp.",
        "text": "The Parties agree that they will not actively entice or solicit each other's employees engaged in the performance of this [Agreement].Despite the foregoing, it is expressly agreed and understood that both Parties shall be free to recruit persons following general advertisements by that Party which are not specifically directed at the employees concerned, and to recruit any employees making an approach to a Party either directly or through a recruitment agent where there has been no direct solicitation by that Party."
      },
      "source_agent": "AGENT_1",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "Senior Legal Counsel (Guidelines)",
        "model": "gemini-2.5-flash",
        "temperature": 0.0,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_1_prompt.txt"
      }
    },
    {
      "id": "646b610b-0da7-453d-bb90-5712d1d3a8ee",
      "content": {
        "id": "d4e5f6a7-b8c9-0123-4567-890abcdef012",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "Non-solicitation clause should only apply to present employees of a party and should exclude former employees i.e. employees that have been dismissed or released.",
        "plain_text": "Any non-solicitation clause should be drafted to apply only to current employees and explicitly exclude former employees (e.g., those dismissed or released).",
        "expert_insight": "This guideline is vital for limiting the scope and duration of non-solicitation obligations. Excluding former employees prevents Zebracorp from being unduly restricted in hiring individuals who are no longer employed by the other party, which is a common and reasonable carve-out in commercial agreements.",
        "confidence": 1.0,
        "conditions": "Any non-solicitation clause.",
        "justification": "Defines a crucial scope limitation for non-solicitation clauses, directly impacting Zebracorp's hiring flexibility.",
        "implication_company": "Zebracorp is not restricted from hiring former employees of the other party, enhancing its talent acquisition options.",
        "implication_supplier": "The supplier's non-solicitation rights do not extend to their former employees.",
        "source_insight": "The use of 'should' indicates a strong recommendation for drafting, aiming to protect Zebracorp's interests.",
        "text": "Non-solicitation clause should only apply to present employees of a party and should exclude former employees i.e. employees that have been dismissed or released."
      },
      "source_agent": "AGENT_1",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "Senior Legal Counsel (Guidelines)",
        "model": "gemini-2.5-flash",
        "temperature": 0.0,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_1_prompt.txt"
      }
    },
    {
      "id": "c7f97b71-d357-4a10-8aa9-1147fb0ac4e1",
      "content": {
        "id": "a1b2c3d4-e5f6-7890-1234-567890abcdef",
        "type": "OTHER",
        "verbatim_text": "Zebracorp position towards binding non-solicitation provisions is reserved. This is because monitoring non-solicitation undertakings can be next to impossible in a multinational company such as Zebracorp. The sheer number of subcontracting agreements Zebracorp enters into with its supplier makes these type of covenants difficult to implement.",
        "plain_text": "Zebracorp is hesitant about binding non-solicitation clauses due to the difficulty in monitoring them across a multinational company with numerous subcontracting agreements.",
        "expert_insight": "This highlights Zebracorp's internal operational challenges with enforcing such clauses, providing a strong rationale for their cautious approach in negotiations.",
        "confidence": 1.0,
        "subtype": "INFO",
        "justification": "Provides background information and the rationale behind Zebracorp's general stance on non-solicitation clauses.",
        "implication_company": "Zebracorp should aim to avoid or limit binding non-solicitation clauses due to practical enforcement difficulties.",
        "implication_supplier": "Suppliers should understand Zebracorp's reluctance and be prepared for negotiations that may seek to soften or limit these clauses.",
        "source_insight": "The 'reserved' position suggests flexibility, but the underlying reasons point to a strong preference against strict enforcement.",
        "text": "Zebracorp position towards binding non-solicitation provisions is reserved. This is because monitoring non-solicitation undertakings can be next to impossible in a multinational company such as Zebracorp. The sheer number of subcontracting agreements Zebracorp enters into with its supplier makes these type of covenants difficult to implement."
      },
      "source_agent": "AGENT_2",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "Strategic Advisor (Context)",
        "model": "gemini-2.5-flash",
        "temperature": 0.2,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_2_prompt.txt"
      }
    },
    {
      "id": "fd0d753e-6921-4208-b03d-a3050ef84a12",
      "content": {
        "id": "b2c3d4e5-f6a7-8901-2345-67890abcdef0",
        "type": "OTHER",
        "verbatim_text": "We can agree as a general principle we will avoid enticing, or soliciting other party’s employees during the term of a contract.",
        "plain_text": "As a general principle, Zebracorp can agree not to solicit or entice the other party's employees during the contract term.",
        "expert_insight": "This sets a baseline for negotiation, indicating a willingness to agree to a general principle, but implies that specific, binding undertakings will be scrutinized.",
        "confidence": 1.0,
        "subtype": "TACTIC",
        "justification": "Outlines a general negotiation position or approach Zebracorp can take.",
        "implication_company": "Zebracorp can offer a general commitment to non-solicitation without necessarily agreeing to highly restrictive or difficult-to-monitor binding clauses.",
        "implication_supplier": "Suppliers can expect a general agreement on non-solicitation, but Zebracorp may resist overly strict or broad provisions.",
        "source_insight": "The phrase 'general principle' suggests a non-binding or less formal commitment compared to a 'binding undertaking'.",
        "text": "We can agree as a general principle we will avoid enticing, or soliciting other party’s employees during the term of a contract."
      },
      "source_agent": "AGENT_2",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "Strategic Advisor (Context)",
        "model": "gemini-2.5-flash",
        "temperature": 0.2,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_2_prompt.txt"
      }
    },
    {
      "id": "27f2b230-af44-4dee-934e-c01bcecb023d",
      "content": {
        "id": "c3d4e5f6-a7b8-9012-3456-7890abcdef01",
        "type": "OTHER",
        "verbatim_text": "Please see in e.g. Article 25 of the Zebracorp generic Subcontracting Agreement template.",
        "plain_text": "Refer to Article 25 of the Zebracorp generic Subcontracting Agreement template for an example.",
        "expert_insight": "This is an internal directive to consult existing company resources, ensuring consistency and leveraging pre-approved language.",
        "confidence": 1.0,
        "subtype": "INSTRUCTION",
        "justification": "Provides an internal process step or reference point for employees.",
        "implication_company": "Employees should consult the specified template to understand Zebracorp's standard approach to non-solicitation.",
        "implication_supplier": "Not directly applicable to the supplier, but indicates Zebracorp's reliance on standardized agreements.",
        "source_insight": "Implies that the template contains the preferred wording or approach for non-solicitation.",
        "text": "Please see in e.g. Article 25 of the Zebracorp generic Subcontracting Agreement template."
      },
      "source_agent": "AGENT_2",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "Strategic Advisor (Context)",
        "model": "gemini-2.5-flash",
        "temperature": 0.2,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_2_prompt.txt"
      }
    },
    {
      "id": "362e42d0-ff95-472e-8707-74b1011bdf76",
      "content": {
        "id": "d4e5f6a7-b8c9-0123-4567-890abcdef012",
        "type": "OTHER",
        "verbatim_text": "Any binding non-solicitation undertakings should be made only in respect of certain key employees and should be discussed with Legal & Compliance.",
        "plain_text": "Binding non-solicitation clauses should be limited to key employees and require consultation with Legal & Compliance.",
        "expert_insight": "This is a critical internal control and risk mitigation instruction, ensuring that any exceptions to the general 'reserved' position are carefully managed and legally vetted.",
        "confidence": 1.0,
        "subtype": "INSTRUCTION",
        "justification": "Outlines a specific internal process and limitation for agreeing to binding non-solicitation clauses.",
        "implication_company": "Strict adherence to this instruction is necessary to manage legal and compliance risks associated with non-solicitation clauses.",
        "implication_supplier": "Suppliers seeking binding non-solicitation clauses should be prepared for Zebracorp to limit them to key personnel and to involve their legal team.",
        "source_insight": "The 'only' and 'should be discussed' indicate mandatory steps and restrictions.",
        "text": "Any binding non-solicitation undertakings should be made only in respect of certain key employees and should be discussed with Legal & Compliance."
      },
      "source_agent": "AGENT_2",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "Strategic Advisor (Context)",
        "model": "gemini-2.5-flash",
        "temperature": 0.2,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_2_prompt.txt"
      }
    },
    {
      "id": "97810c75-0747-46fe-84ba-aa221c0a8143",
      "content": {
        "id": "e5f6a7b8-c9d0-1234-5678-90abcdef0123",
        "type": "OTHER",
        "verbatim_text": "Whenever we agree to a binding non-solicitation undertaking, we should specify that the restriction to hire will not apply to any employees that contact us through their own initiative or as a result of a general advertisement which is not directed against the employees of the supplier.",
        "plain_text": "When agreeing to binding non-solicitation, ensure it excludes employees who initiate contact or respond to general advertisements not targeting the supplier's staff.",
        "expert_insight": "This is a crucial defensive tactic to protect Zebracorp's ability to recruit talent through legitimate means, preventing overly broad interpretations of non-solicitation.",
        "confidence": 1.0,
        "subtype": "TACTIC",
        "justification": "Provides specific strategic advice on how to structure non-solicitation clauses to protect Zebracorp's interests.",
        "implication_company": "Zebracorp must actively negotiate for these carve-outs to maintain recruitment flexibility and avoid unintended restrictions.",
        "implication_supplier": "Suppliers should expect Zebracorp to push for these exceptions, which are standard in many non-solicitation agreements.",
        "source_insight": "This is a common and reasonable carve-out to prevent non-solicitation clauses from becoming de facto non-compete clauses for employees.",
        "text": "Whenever we agree to a binding non-solicitation undertaking, we should specify that the restriction to hire will not apply to any employees that contact us through their own initiative or as a result of a general advertisement which is not directed against the employees of the supplier."
      },
      "source_agent": "AGENT_2",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "Strategic Advisor (Context)",
        "model": "gemini-2.5-flash",
        "temperature": 0.2,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_2_prompt.txt"
      }
    },
    {
      "id": "7841326d-648f-4c8f-8bc6-0211c02d57f8",
      "content": {
        "id": "f6a7b8c9-d0e1-2345-6789-0abcdef01234",
        "type": "OTHER",
        "verbatim_text": "This can be accomplished by in e.g. the following insertion: “The Parties agree that they will not actively entice or solicit each other's employees engaged in the performance of this [Agreement].Despite the foregoing, it is expressly agreed and understood that both Parties shall be free to recruit persons following general advertisements by that Party which are not specifically directed at the employees concerned, and to recruit any employees making an approach to a Party either directly or through a recruitment agent where there has been no direct solicitation by that Party.”",
        "plain_text": "An example clause to achieve the desired carve-out for unsolicited approaches and general advertisements.",
        "expert_insight": "This provides concrete language for negotiators, making it easy to implement the strategic tactic of protecting general recruitment activities.",
        "confidence": 1.0,
        "subtype": "EXAMPLE",
        "justification": "Provides a specific textual example of how to implement the preceding tactic.",
        "implication_company": "Zebracorp can use this exact language to protect its recruitment efforts when agreeing to non-solicitation.",
        "implication_supplier": "Suppliers will see this specific wording proposed by Zebracorp to define the scope of non-solicitation.",
        "source_insight": "The example clearly distinguishes between 'active solicitation' and passive recruitment or unsolicited approaches.",
        "text": "This can be accomplished by in e.g. the following insertion: “The Parties agree that they will not actively entice or solicit each other's employees engaged in the performance of this [Agreement].Despite the foregoing, it is expressly agreed and understood that both Parties shall be free to recruit persons following general advertisements by that Party which are not specifically directed at the employees concerned, and to recruit any employees making an approach to a Party either directly or through a recruitment agent where there has been no direct solicitation by that Party.”"
      },
      "source_agent": "AGENT_2",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "Strategic Advisor (Context)",
        "model": "gemini-2.5-flash",
        "temperature": 0.2,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_2_prompt.txt"
      }
    },
    {
      "id": "0e600afe-3b6d-45e9-abec-06a08a4f4b15",
      "content": {
        "id": "a7b8c9d0-e1f2-3456-7890-abcdef012345",
        "type": "OTHER",
        "verbatim_text": "Non-solicitation clause should only apply to present employees of a party and should exclude former employees i.e. employees that have been dismissed or released.",
        "plain_text": "Non-solicitation clauses should only cover current employees, explicitly excluding former employees (e.g., those dismissed or released).",
        "expert_insight": "This is another crucial limitation tactic, preventing the clause from extending indefinitely or covering individuals no longer associated with the supplier, which could create unnecessary burdens or legal ambiguities.",
        "confidence": 1.0,
        "subtype": "TACTIC",
        "justification": "Provides specific strategic advice on how to limit the scope of non-solicitation clauses.",
        "implication_company": "Zebracorp should ensure non-solicitation clauses are narrowly defined to apply only to current employees, reducing potential liability.",
        "implication_supplier": "Suppliers should expect Zebracorp to resist non-solicitation clauses that extend to former employees.",
        "source_insight": "This prevents a supplier from claiming non-solicitation for individuals they no longer employ, which is a reasonable limitation.",
        "text": "Non-solicitation clause should only apply to present employees of a party and should exclude former employees i.e. employees that have been dismissed or released."
      },
      "source_agent": "AGENT_2",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "Strategic Advisor (Context)",
        "model": "gemini-2.5-flash",
        "temperature": 0.2,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_2_prompt.txt"
      }
    },
    {
      "id": "8e412dcd-7a45-4f58-8ff6-a8781cb2250b",
      "content": {
        "id": "14f2a5e8-5b4d-4e9c-8a1a-7b3c2d1e0f9a",
        "type": "DEFINITION",
        "verbatim_text": "Non-solicitation provisions restrict a party from soliciting employees from another party during a certain period of time.",
        "plain_text": "Non-solicitation provisions limit a party from soliciting employees from another party for a specified duration.",
        "expert_insight": "This defines the core concept of a non-solicitation clause, which is to prevent one party from poaching employees from another party involved in a contract or agreement.",
        "confidence": 1.0,
        "justification": "N/A",
        "implication_company": "N/A",
        "implication_supplier": "N/A",
        "source_insight": "N/A",
        "text": "Non-solicitation provisions restrict a party from soliciting employees from another party during a certain period of time."
      },
      "source_agent": "AGENT_4",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout A",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_4_prompt.txt"
      }
    },
    {
      "id": "986e2a6d-0f3a-4972-a089-f6d46944975e",
      "content": {
        "id": "2e9c8a1a-7b3c-4d5e-8f0a-1b2c3d4e5f6g",
        "type": "OTHER",
        "subtype": "INFO",
        "verbatim_text": "Zebracorp position towards binding non-solicitation provisions is reserved. This is because monitoring non-solicitation undertakings can be next to impossible in a multinational company such as Zebracorp. The sheer number of subcontracting agreements Zebracorp enters into with its supplier makes these type of covenants difficult to implement.",
        "plain_text": "Zebracorp is hesitant about binding non-solicitation provisions due to the difficulty of monitoring such undertakings in a multinational company with numerous subcontracting agreements.",
        "expert_insight": "This provides context on Zebracorp's internal policy and the practical challenges of enforcing non-solicitation clauses, especially in a large, complex organization with many supplier relationships.",
        "confidence": 1.0,
        "justification": "The difficulty of monitoring and implementing non-solicitation undertakings in a multinational context with many subcontracting agreements.",
        "implication_company": "Zebracorp prefers to avoid binding non-solicitation provisions due to implementation and monitoring challenges.",
        "implication_supplier": "Suppliers may find Zebracorp less inclined to enforce strict non-solicitation clauses in their agreements.",
        "source_insight": "Internal policy and operational challenges of Zebracorp.",
        "text": "Zebracorp position towards binding non-solicitation provisions is reserved. This is because monitoring non-solicitation undertakings can be next to impossible in a multinational company such as Zebracorp. The sheer number of subcontracting agreements Zebracorp enters into with its supplier makes these type of covenants difficult to implement."
      },
      "source_agent": "AGENT_4",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout A",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_4_prompt.txt"
      }
    },
    {
      "id": "90ec5e1d-655c-4261-9835-78de37dcb92c",
      "content": {
        "id": "3a1a7b3c-4d5e-8f0a-1b2c-3d4e5f6g7h8i",
        "type": "GUIDELINE",
        "classification": "MEDIUM",
        "verbatim_text": "We can agree as a general principle we will avoid enticing, or soliciting other party’s employees during the term of a contract.",
        "plain_text": "As a general principle, Zebracorp will avoid enticing or soliciting employees of the other contracting party during the contract term.",
        "expert_insight": "This establishes a default, non-binding principle for Zebracorp regarding employee solicitation, indicating a preference for ethical conduct without necessarily entering into strict legal obligations unless specified.",
        "confidence": 1.0,
        "conditions": "During the term of a contract.",
        "justification": "This is a general principle for conduct, likely to maintain good business relations.",
        "implication_company": "Zebracorp should instruct its employees to refrain from actively soliciting employees of contracting parties.",
        "implication_supplier": "Suppliers can expect Zebracorp to generally avoid soliciting their employees during the contract term.",
        "source_insight": "General company principle.",
        "text": "We can agree as a general principle we will avoid enticing, or soliciting other party’s employees during the term of a contract."
      },
      "source_agent": "AGENT_4",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout A",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_4_prompt.txt"
      }
    },
    {
      "id": "19ed5317-bfeb-41cf-9ea7-262fee93e3ca",
      "content": {
        "id": "4d5e8f0a-1b2c-3d4e-5f6g-7h8i9j0k1l",
        "type": "OTHER",
        "subtype": "EXAMPLE",
        "verbatim_text": "Please see in e.g. Article 25 of the Zebracorp generic Subcontracting Agreement template.",
        "plain_text": "Refer to Article 25 of the Zebracorp generic Subcontracting Agreement template for an example.",
        "expert_insight": "This provides a specific reference point for where non-solicitation principles might be found within Zebracorp's standard documentation.",
        "confidence": 1.0,
        "justification": "N/A",
        "implication_company": "N/A",
        "implication_supplier": "N/A",
        "source_insight": "N/A",
        "text": "Please see in e.g. Article 25 of the Zebracorp generic Subcontracting Agreement template."
      },
      "source_agent": "AGENT_4",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout A",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_4_prompt.txt"
      }
    },
    {
      "id": "9fffc471-e3f6-4d05-82cc-6556ec6ceb7f",
      "content": {
        "id": "5b2c3d4e-5f6g-7h8i-9j0k-1l2m3n4o5p",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "Any binding non-solicitation undertakings should be made only in respect of certain key employees and should be discussed with Legal & Compliance.",
        "plain_text": "Binding non-solicitation undertakings must be limited to key employees and require consultation with Legal & Compliance.",
        "expert_insight": "This is a critical internal control. It limits the scope of binding non-solicitation to essential personnel and mandates legal review, reflecting Zebracorp's reserved position while allowing for necessary protections.",
        "confidence": 1.0,
        "conditions": "When considering binding non-solicitation undertakings.",
        "justification": "To manage the difficulty of monitoring and implementing such clauses, and to ensure legal compliance and strategic alignment.",
        "implication_company": "Zebracorp must ensure that any binding non-solicitation clauses are narrowly tailored to key employees and approved by Legal & Compliance.",
        "implication_supplier": "Suppliers should expect binding non-solicitation clauses from Zebracorp to be specific to key employees and subject to internal legal review.",
        "source_insight": "Internal policy for managing legal obligations.",
        "text": "Any binding non-solicitation undertakings should be made only in respect of certain key employees and should be discussed with Legal & Compliance."
      },
      "source_agent": "AGENT_4",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout A",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_4_prompt.txt"
      }
    },
    {
      "id": "bd33c34d-acf2-4021-b518-33bb9683424a",
      "content": {
        "id": "6c3d4e5f-6g7h-8i9j-0k1l-2m3n4o5p6q",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "Whenever we agree to a binding non-solicitation undertaking, we should specify that the restriction to hire will not apply to any employees that contact us through their own initiative or as a result of a general advertisement which is not directed against the employees of the supplier.",
        "plain_text": "When agreeing to a binding non-solicitation, include a clause stating the restriction does not apply to employees who initiate contact or respond to general advertisements not targeting the supplier's employees.",
        "expert_insight": "This is a crucial carve-out to protect the company from inadvertently breaching non-solicitation clauses due to passive recruitment or unsolicited applications, which are common in the labor market. It's often referred to as a 'general solicitation' or 'passive candidate' exception.",
        "confidence": 1.0,
        "conditions": "Whenever a binding non-solicitation undertaking is agreed upon.",
        "justification": "To avoid overly broad restrictions that could hinder legitimate recruitment efforts and to mitigate the risk of unintended breaches.",
        "implication_company": "Zebracorp must ensure this specific exception is included in relevant contracts to allow for normal hiring practices.",
        "implication_supplier": "Suppliers should be aware that Zebracorp's non-solicitation obligations will likely include these exceptions, allowing Zebracorp to hire employees who approach them independently or respond to general ads.",
        "source_insight": "Best practice for drafting non-solicitation clauses.",
        "text": "Whenever we agree to a binding non-solicitation undertaking, we should specify that the restriction to hire will not apply to any employees that contact us through their own initiative or as a result of a general advertisement which is not directed against the employees of the supplier."
      },
      "source_agent": "AGENT_4",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout A",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_4_prompt.txt"
      }
    },
    {
      "id": "a03ecc2e-3598-4224-85ae-ff5920ce5280",
      "content": {
        "id": "7d4e5f6g-7h8i-9j0k-1l2m-3n4o5p6q7r",
        "type": "OTHER",
        "subtype": "INSTRUCTION",
        "verbatim_text": "This can be accomplished by in e.g. the following insertion: “The Parties agree that they will not actively entice or solicit each other's employees engaged in the performance of this [Agreement].Despite the foregoing, it is expressly agreed and understood that both Parties shall be free to recruit persons following general advertisements by that Party which are not specifically directed at the employees concerned, and to recruit any employees making an approach to a Party either directly or through a recruitment agent where there has been no direct solicitation by that Party.”",
        "plain_text": "This provides example contract language to implement the exception for passive recruitment or unsolicited applications: 'The Parties agree that they will not actively entice or solicit each other's employees engaged in the performance of this [Agreement]. Despite the foregoing, it is expressly agreed and understood that both Parties shall be free to recruit persons following general advertisements by that Party which are not specifically directed at the employees concerned, and to recruit any employees making an approach to a Party either directly or through a recruitment agent where there has been no direct solicitation by that Party.'",
        "expert_insight": "This is a standard contractual clause designed to provide the necessary exceptions to a non-solicitation agreement, allowing for general recruitment activities and unsolicited approaches without violating the clause.",
        "confidence": 1.0,
        "justification": "N/A",
        "implication_company": "Zebracorp should use this or similar language when drafting non-solicitation clauses to ensure the necessary exceptions are included.",
        "implication_supplier": "Suppliers should expect this type of language in non-solicitation clauses from Zebracorp.",
        "source_insight": "Contractual drafting best practice.",
        "text": "This can be accomplished by in e.g. the following insertion: “The Parties agree that they will not actively entice or solicit each other's employees engaged in the performance of this [Agreement].Despite the foregoing, it is expressly agreed and understood that both Parties shall be free to recruit persons following general advertisements by that Party which are not specifically directed at the employees concerned, and to recruit any employees making an approach to a Party either directly or through a recruitment agent where there has been no direct solicitation by that Party.”"
      },
      "source_agent": "AGENT_4",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout A",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_4_prompt.txt"
      }
    },
    {
      "id": "9edc2e1a-6ec4-4d93-b040-ba8cbc2f34d1",
      "content": {
        "id": "8e5f6g7h-8i9j-0k1l-2m3n-4o5p6q7r8s",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "Non-solicitation clause should only apply to present employees of a party and should exclude former employees i.e. employees that have been dismissed or released.",
        "plain_text": "Non-solicitation clauses should only cover current employees and explicitly exclude former employees (e.g., those dismissed or released).",
        "expert_insight": "This guideline limits the scope of non-solicitation to active employees, preventing restrictions on hiring individuals who are no longer employed by the other party. This is a common and reasonable limitation to avoid overly broad and potentially unenforceable clauses.",
        "confidence": 1.0,
        "conditions": "When drafting or agreeing to a non-solicitation clause.",
        "justification": "To ensure the clause is reasonable, enforceable, and does not unduly restrict the hiring of individuals no longer associated with the other party.",
        "implication_company": "Zebracorp must ensure its non-solicitation clauses are drafted to apply only to current employees.",
        "implication_supplier": "Suppliers can expect non-solicitation clauses to not restrict them from hiring Zebracorp's former employees.",
        "source_insight": "Best practice for drafting non-solicitation clauses to ensure enforceability and fairness.",
        "text": "Non-solicitation clause should only apply to present employees of a party and should exclude former employees i.e. employees that have been dismissed or released."
      },
      "source_agent": "AGENT_4",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout A",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_4_prompt.txt"
      }
    },
    {
      "id": "38504da4-c46f-40f4-861e-522eb9d67fa4",
      "content": {
        "id": "2d8f9c1b-e6a7-4b0d-b1c3-8f5a2e7d6c90",
        "type": "DEFINITION",
        "verbatim_text": "Non-solicitation provisions restrict a party from soliciting employees from another party during a certain period of time.",
        "plain_text": "Non-solicitation provisions are clauses designed to prevent one party from enticing or hiring employees from another party for a specified duration.",
        "expert_insight": "This defines the fundamental purpose of non-solicitation clauses, which is to protect a party's workforce stability by preventing competitors or partners from poaching their employees.",
        "confidence": 1.0,
        "justification": "N/A",
        "implication_company": "N/A",
        "implication_supplier": "N/A",
        "source_insight": "N/A",
        "text": "Non-solicitation provisions restrict a party from soliciting employees from another party during a certain period of time."
      },
      "source_agent": "AGENT_5",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout B",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_5_prompt.txt"
      }
    },
    {
      "id": "8a0c34d2-5005-4661-88e6-2110feaddb84",
      "content": {
        "id": "7a3e8d2c-f1b9-4c0e-a2d4-9g6b3h7c8d11",
        "type": "OTHER",
        "subtype": "INFO",
        "verbatim_text": "Zebracorp position towards binding non-solicitation provisions is reserved. This is because monitoring non-solicitation undertakings can be next to impossible in a multinational company such as Zebracorp. The sheer number of subcontracting agreements Zebracorp enters into with its supplier makes these type of covenants difficult to implement.",
        "plain_text": "Zebracorp maintains a reserved stance on binding non-solicitation provisions due to the significant challenges in monitoring and implementing them effectively across a multinational company with numerous subcontracting agreements.",
        "expert_insight": "This outlines Zebracorp's internal policy and the practical difficulties it faces in enforcing broad non-solicitation clauses, suggesting a preference for more limited or carefully crafted provisions.",
        "confidence": 0.9,
        "justification": "Monitoring is difficult in a multinational company due to the large number of subcontracting agreements.",
        "implication_company": "Zebracorp will generally seek to avoid or limit the scope of binding non-solicitation clauses due to enforcement challenges.",
        "implication_supplier": "Suppliers dealing with Zebracorp should anticipate resistance to broad, all-encompassing non-solicitation provisions.",
        "source_insight": "Internal company policy and operational considerations.",
        "text": "Zebracorp position towards binding non-solicitation provisions is reserved. This is because monitoring non-solicitation undertakings can be next to impossible in a multinational company such as Zebracorp. The sheer number of subcontracting agreements Zebracorp enters into with its supplier makes these type of covenants difficult to implement."
      },
      "source_agent": "AGENT_5",
      "confidence": 0.9,
      "config_snapshot": {
        "name": "General Scout B",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_5_prompt.txt"
      }
    },
    {
      "id": "0a734d2d-50df-4015-9175-c36f0f1abf70",
      "content": {
        "id": "1b0c3d4e-a5f6-4g7h-8i9j-0k1l2m3n4o5p",
        "type": "GUIDELINE",
        "classification": "MEDIUM",
        "verbatim_text": "We can agree as a general principle we will avoid enticing, or soliciting other party’s employees during the term of a contract.",
        "plain_text": "As a general principle, Zebracorp commits to not enticing or soliciting employees of another contracting party during the active term of a contract.",
        "expert_insight": "This establishes a baseline ethical standard for Zebracorp's interactions with partners, indicating a commitment to fair play even if formal binding clauses are not always preferred.",
        "confidence": 1.0,
        "conditions": "During the term of a contract.",
        "justification": "General principle of fair conduct.",
        "implication_company": "Zebracorp personnel should be instructed to avoid actively recruiting from partner companies during contract periods.",
        "implication_supplier": "Suppliers can generally expect Zebracorp to respect their workforce and not actively solicit their employees while a contract is in force.",
        "source_insight": "Company policy/guidance.",
        "text": "We can agree as a general principle we will avoid enticing, or soliciting other party’s employees during the term of a contract."
      },
      "source_agent": "AGENT_5",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout B",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_5_prompt.txt"
      }
    },
    {
      "id": "e8fda833-72a2-4e44-a4bd-9c21f8e84e3b",
      "content": {
        "id": "8e9f0a1b-c2d3-4e5f-6g7h-8i9j0k1l2m3n",
        "type": "OTHER",
        "subtype": "EXAMPLE",
        "verbatim_text": "Please see in e.g. Article 25 of the Zebracorp generic Subcontracting Agreement template.",
        "plain_text": "For a practical example of a non-solicitation clause, refer to Article 25 of Zebracorp's standard Subcontracting Agreement template.",
        "expert_insight": "This provides a specific internal reference point for understanding how non-solicitation provisions are typically structured within Zebracorp's standard agreements.",
        "confidence": 1.0,
        "justification": "N/A",
        "implication_company": "Provides a concrete internal resource for drafting or reviewing non-solicitation clauses.",
        "implication_supplier": "N/A",
        "source_insight": "Internal documentation reference.",
        "text": "Please see in e.g. Article 25 of the Zebracorp generic Subcontracting Agreement template."
      },
      "source_agent": "AGENT_5",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout B",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_5_prompt.txt"
      }
    },
    {
      "id": "27ac29c9-b480-49b1-a2ff-29210335ae62",
      "content": {
        "id": "3c4d5e6f-a7b8-4c9d-e0f1-g2h3i4j5k6l7",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "Any binding non-solicitation undertakings should be made only in respect of certain key employees and should be discussed with Legal & Compliance.",
        "plain_text": "Binding non-solicitation agreements must be restricted to specific key employees and require mandatory consultation with the Legal & Compliance department.",
        "expert_insight": "This sets strict internal controls for the implementation of binding non-solicitation clauses, ensuring they are narrowly tailored and receive appropriate legal review, aligning with Zebracorp's cautious approach.",
        "confidence": 1.0,
        "conditions": "Applies only to certain key employees; requires discussion with Legal & Compliance.",
        "justification": "To manage risks and ensure enforceability, given the general difficulty in monitoring broad non-solicitation clauses.",
        "implication_company": "Business units must engage Legal & Compliance for any binding non-solicitation undertakings and ensure their scope is limited to key personnel.",
        "implication_supplier": "Suppliers seeking binding non-solicitation from Zebracorp should expect it to be limited to key individuals and subject to Zebracorp's legal review process.",
        "source_insight": "Internal company policy/guidance.",
        "text": "Any binding non-solicitation undertakings should be made only in respect of certain key employees and should be discussed with Legal & Compliance."
      },
      "source_agent": "AGENT_5",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout B",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_5_prompt.txt"
      }
    },
    {
      "id": "1456c63a-2720-4028-b71f-016e30450b2f",
      "content": {
        "id": "4e5f6g7h-b8c9-4d0e-f1g2-h3i4j5k6l7m8",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "Whenever we agree to a binding non-solicitation undertaking, we should specify that the restriction to hire will not apply to any employees that contact us through their own initiative or as a result of a general advertisement which is not directed against the employees of the supplier. This can be accomplished by in e.g. the following insertion: “The Parties agree that they will not actively entice or solicit each other's employees engaged in the performance of this [Agreement].Despite the foregoing, it is expressly agreed and understood that both Parties shall be free to recruit persons following general advertisements by that Party which are not specifically directed at the employees concerned, and to recruit any employees making an approach to a Party either directly or through a recruitment agent where there has been no direct solicitation by that Party.”",
        "plain_text": "When entering into a binding non-solicitation agreement, Zebracorp must explicitly include exceptions for employees who initiate contact independently or respond to general advertisements not specifically targeting the supplier's staff. The provided clause serves as a model for this inclusion.",
        "expert_insight": "This guideline is crucial for balancing the protection of a partner's workforce with the need to avoid overly restrictive or anti-competitive clauses. It ensures that legitimate, passive recruitment efforts are not deemed a breach.",
        "confidence": 1.0,
        "conditions": "Applies when agreeing to a binding non-solicitation undertaking. The restriction to hire will not apply if employees contact Zebracorp on their own initiative or respond to general advertisements not specifically directed at the supplier's employees.",
        "justification": "To avoid overly broad restrictions that could hinder legitimate recruitment and to ensure legal defensibility of the clause.",
        "implication_company": "Zebracorp must ensure these specific carve-outs are consistently incorporated into any binding non-solicitation clauses to protect its ability to hire talent legitimately.",
        "implication_supplier": "Suppliers should be aware that Zebracorp will likely include these exceptions, meaning their employees are not entirely immune from recruitment if they initiate contact or respond to general advertisements.",
        "source_insight": "Internal company policy/guidance and best practice for contract drafting.",
        "text": "Whenever we agree to a binding non-solicitation undertaking, we should specify that the restriction to hire will not apply to any employees that contact us through their own initiative or as a result of a general advertisement which is not directed against the employees of the supplier. This can be accomplished by in e.g. the following insertion: “The Parties agree that they will not actively entice or solicit each other's employees engaged in the performance of this [Agreement].Despite the foregoing, it is expressly agreed and understood that both Parties shall be free to recruit persons following general advertisements by that Party which are not specifically directed at the employees concerned, and to recruit any employees making an approach to a Party either directly or through a recruitment agent where there has been no direct solicitation by that Party.”"
      },
      "source_agent": "AGENT_5",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout B",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_5_prompt.txt"
      }
    },
    {
      "id": "2eb78ada-bdff-473e-b8ab-15ca3ec6f4e6",
      "content": {
        "id": "5f6g7h8i-c9d0-4e1f-g2h3-i4j5k6l7m8n9",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "Non-solicitation clause should only apply to present employees of a party and should exclude former employees i.e. employees that have been dismissed or released.",
        "plain_text": "Non-solicitation clauses must be limited to current employees of a party and explicitly exclude former employees, including those who have been dismissed or released.",
        "expert_insight": "This guideline prevents non-solicitation clauses from becoming unduly burdensome or anti-competitive by extending beyond the active workforce. It ensures the protection focuses on current employees, not individuals no longer associated with the other party.",
        "confidence": 1.0,
        "conditions": "Applies only to present employees of a party; explicitly excludes former employees (i.e., dismissed or released).",
        "justification": "To prevent overly broad or unenforceable restrictions on individuals no longer employed by the other party.",
        "implication_company": "Zebracorp must ensure its non-solicitation clauses are precisely worded to cover only current employees and explicitly exclude former employees.",
        "implication_supplier": "Suppliers should not expect non-solicitation clauses with Zebracorp to cover their former employees, as this is against Zebracorp's policy.",
        "source_insight": "Internal company policy/guidance and best practice for contract drafting.",
        "text": "Non-solicitation clause should only apply to present employees of a party and should exclude former employees i.e. employees that have been dismissed or released."
      },
      "source_agent": "AGENT_5",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout B",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_5_prompt.txt"
      }
    }
  ]
}