{
  "section_id": "line_1766085084910_0c3pdppj2",
  "decisions": [
    {
      "id": "b0a8cfe9-2295-4186-ac39-08563e2a2e12",
      "is_valid": true,
      "decision_content": {
        "type": "GUIDELINE",
        "id": "a1b2c3d4-e5f6-7890-1234-567890abcdef",
        "verbatim_text": "For these reasons, the main rule is that Zebracorp does not give guarantees to our suppliers to guarantee Zebracorp´s payments.",
        "plain_text": "Due to the need to record guarantees in financial accounts and the resulting increase in financial liabilities, Zebracorp's main policy is not to provide guarantees to its suppliers for Zebracorp's payments.",
        "expert_insight": "This is a fundamental risk management principle for Zebracorp, aiming to limit its financial liabilities and maintain a strong balance sheet. It establishes a clear default position, shifting the credit risk assessment entirely to the supplier.",
        "confidence": 1.0,
        "classification": "CRITICAL",
        "conditions": "None, this is the main rule.",
        "justification": "Guarantees would need to be recorded in financial accounts and would increase Zebracorp's financial liabilities.",
        "implication_company": "Zebracorp avoids increasing its financial liabilities and administrative burden, maintaining a conservative financial posture.",
        "implication_supplier": "Suppliers cannot expect payment guarantees from Zebracorp and must conduct their own credit risk assessments on Zebracorp.",
        "source_insight": "The text explicitly states 'the main rule' and provides the financial rationale for this policy."
      },
      "rationale": "Consensus: Mixed (3 GUIDELINE, 1 OTHER). The finding is a clear directive stating Zebracorp's primary policy regarding guarantees, making it an actionable GUIDELINE. Value Assessment: The original verbatim text includes 'For these reasons', which refers to the preceding sentence in the source text. The 'plain_text' has been rewritten to incorporate this context for self-sufficiency and clarity. Type-Specific Criteria: It establishes a critical, actionable rule for Zebracorp's financial management. Utility Check: This is a highly specific and critical rule that helps in negotiation and protects the company's financial position. Therefore, it is accepted as a Critical Guideline.",
      "decision_confidence": 1.0,
      "source_cluster_id": "698b2819-deb3-4747-bea6-00fb5c94b21e",
      "supporting_evidence": [
        "493193b6-30c5-4f14-8801-29e6f9f9af3c",
        "09483bc0-c098-490f-bbf0-7e7fe20480c5",
        "79740dd8-3580-401c-a272-be6ee08587e4",
        "5995f287-8fb7-4000-8b72-7565331ff3d6"
      ]
    },
    {
      "id": "b3f587a3-aa26-424a-9450-df53fe49ae00",
      "is_valid": true,
      "decision_content": {
        "type": "GUIDELINE",
        "id": "b2c3d4e5-f6a7-8901-2345-67890abcdef0",
        "verbatim_text": "This applies to bank guarantees, Letters of Credit and other such external guarantees as well as parent company guarantees.",
        "plain_text": "The main rule that Zebracorp does not give guarantees to its suppliers applies to all types, including bank guarantees, Letters of Credit, and parent company guarantees.",
        "expert_insight": "This clarifies the comprehensive scope of Zebracorp's no-guarantee policy, ensuring no loopholes for different guarantee types and confirming that all forms of guarantees are included.",
        "confidence": 1.0,
        "classification": "CRITICAL",
        "conditions": "Applies to the main rule of Zebracorp not giving guarantees to its suppliers.",
        "justification": "Directly extends and clarifies the scope of Zebracorp's critical main rule regarding not providing guarantees.",
        "implication_company": "Ensures consistent application of the no-guarantee policy across all financial instruments and guarantee types, protecting Zebracorp from unexpected liabilities.",
        "implication_supplier": "Confirms that suppliers cannot expect any form of guarantee from Zebracorp for its payments, regardless of the guarantee type.",
        "source_insight": "Explicitly lists the types of guarantees covered by Zebracorp's main rule of not providing guarantees."
      },
      "rationale": "CONSENSUS CHECK: Agents were split on type, with one classifying it as 'GUIDELINE' and two as 'OTHER' (INFO). \nVALUE ASSESSMENT: The verbatim text 'This applies to...' refers to the preceding critical rule: 'Zebracorp does not give guarantees to our suppliers to guarantee Zebracorp´s payments.' The plain_text has been rewritten to explicitly include this context, making the finding self-sufficient and clear. \nTYPE-SPECIFIC CRITERIA: While not introducing a new obligation, this statement is crucial for defining the comprehensive scope of Zebracorp's core policy (a critical guideline) regarding not providing guarantees. It specifies *what* the main rule applies to, making it an integral part of the guideline's enforceability and completeness. Therefore, classifying it as a 'GUIDELINE' is appropriate, and 'CRITICAL' reflects the importance of the underlying policy. \nUTILITY CHECK: This finding is specific, helps clarify the breadth of a key policy, and protects the company by explicitly stating that the no-guarantee policy covers all listed types of financial instruments. It is highly useful for negotiation and compliance.",
      "decision_confidence": 1.0,
      "source_cluster_id": "6ce2254d-7655-4706-bac5-3bf25166f99b",
      "supporting_evidence": [
        "54b643d6-4c4b-439e-bab5-86b5f6e96bf6",
        "1f552692-bd84-46dd-83d4-7d76138f082b",
        "ec497144-5451-4c7b-a0d4-12310a8b8d6d"
      ]
    },
    {
      "id": "fcf593b8-3759-4655-9f9d-ff3634cf9988",
      "is_valid": true,
      "decision_content": {
        "type": "GUIDELINE",
        "id": "c3d4e5f6-a7b8-9012-3456-7890abcdef01",
        "verbatim_text": "Any exceptions to this will need to be handled as per Zebracorp Group Guarantee SOP and must be agreed with Zebracorp Global Guarantee Center.",
        "plain_text": "Any exceptions to Zebracorp's no-guarantee policy must follow the Zebracorp Group Guarantee SOP and require agreement from the Zebracorp Global Guarantee Center.",
        "expert_insight": "This establishes a stringent, centralized control mechanism for any deviation from Zebracorp's core no-guarantee policy, highlighting the high financial risk associated with issuing guarantees. It signals that obtaining a guarantee from Zebracorp is a complex, high-level internal approval process.",
        "confidence": 1.0,
        "classification": "CRITICAL",
        "conditions": "If an exception to Zebracorp's no-guarantee policy is considered.",
        "justification": "The phrases 'will need to be handled' and 'must be agreed' indicate mandatory compliance and high-level approval, ensuring strict governance and risk management for deviations from the standard policy.",
        "implication_company": "Zebracorp maintains strict governance, centralized oversight, and adherence to internal SOPs for any guarantee issuance, effectively mitigating financial risk and controlling liabilities.",
        "implication_supplier": "Suppliers seeking a guarantee from Zebracorp must be aware that exceptions are extremely difficult to obtain and require a rigorous, high-level internal Zebracorp approval process following specific SOPs.",
        "source_insight": "Emphasizes the formal process and specific approval authority required for exceptions, reinforcing the main 'no guarantee' rule by making deviations difficult and highly regulated."
      },
      "rationale": "Consensus: Mixed, with a strong majority (4 out of 5 agents) classifying it as 'GUIDELINE'. Agent 2 classified it as 'OTHER' (Instruction). I concur with 'GUIDELINE' because the text establishes a specific, mandatory obligation for Zebracorp's internal process when considering exceptions to its no-guarantee policy, rather than generic advice. Value Assessment: The 'plain_text' correctly contextualizes 'this' to refer to 'Zebracorp's no-guarantee policy', making the statement self-sufficient and clear. Type-Specific Criteria: As a GUIDELINE, it is highly actionable, creating a specific requirement for Zebracorp. It is complete as per the source text and represents a critical rule for managing financial risk, hence classified as 'CRITICAL'. Utility Check: The finding is specific, helps a human negotiate by clarifying the strict internal process for Zebracorp guarantees, and protects the company by ensuring rigorous control over financial liabilities. Therefore, it is a valid and critical GUIDELINE.",
      "decision_confidence": 1.0,
      "source_cluster_id": "98deaf73-53f0-4c37-be3f-5c9866e7bb28",
      "supporting_evidence": [
        "00f3aacf-a2c4-4e7a-98c9-3812b05d1def",
        "16a9550f-ef17-473e-b310-375d38ccb01c",
        "f05ea914-74eb-488e-90d7-1fc6dc7fab98",
        "ff2f1287-0770-4024-8f3b-ab29e2329ccb"
      ]
    },
    {
      "id": "a5b7a9e0-2118-4ab7-b82c-23850c12404c",
      "is_valid": true,
      "decision_content": {
        "type": "GUIDELINE",
        "id": "d4e5f6a7-b8c9-0123-4567-890abcdef012",
        "verbatim_text": "In the event Zebracorp makes any advance payment or other prepayments to the supplier, Zebracorp may require a so called advance payment guarantee as a security from the supplier.",
        "plain_text": "Zebracorp reserves the right to require an advance payment guarantee from a supplier when making advance payments or prepayments, as a security measure.",
        "expert_insight": "This establishes Zebracorp's crucial right to secure its prepayments, mitigating the risk of supplier non-performance or insolvency after receiving funds. Suppliers should anticipate this requirement when negotiating advance payment terms.",
        "confidence": 1.0,
        "classification": "HIGH",
        "conditions": "If Zebracorp makes advance payments or other prepayments to a supplier.",
        "justification": "The use of 'may require' indicates a discretionary right that is strategically important for financial security, serving to secure Zebracorp's prepayments and mitigate financial risk.",
        "implication_company": "Zebracorp has a mechanism to secure its prepayments, reducing financial exposure and mitigating the risk of supplier default.",
        "implication_supplier": "Suppliers receiving advance payments from Zebracorp may be obligated to provide an advance payment guarantee as a condition for receiving funds.",
        "source_insight": "The text explicitly frames this as a security measure for Zebracorp's financial interests."
      },
      "rationale": "Consensus: All agents correctly identified this as a GUIDELINE. Evaluation: The verbatim text clearly establishes a specific, actionable right for Zebracorp to require an advance payment guarantee under the condition of making advance payments or prepayments. This is a critical risk mitigation measure. It is self-sufficient, complete, and provides clear implications for both parties. Passed all clarity, value, and utility checks. Classified as HIGH due to its financial significance.",
      "decision_confidence": 1.0,
      "source_cluster_id": "e7ed695e-95d0-4b05-9db8-0582e6d4685a",
      "supporting_evidence": [
        "bed5cf93-2fda-4b40-b10e-28026563b989",
        "41089495-9692-4406-9e8f-7933ef80700c",
        "44a52dad-69cc-47f2-be12-f3e73c322ba9"
      ]
    },
    {
      "id": "627a5cf6-f9c9-42ea-9671-20eca4181fbc",
      "is_valid": true,
      "decision_content": {
        "type": "OTHER",
        "id": "e5f6a7b8-c9d0-1234-5678-90abcdef0123",
        "verbatim_text": "The need for such advance payment guarantee depends on the value of the prepayment as well as other factors, and is ultimately decided by Procurement with F&C consultation.",
        "plain_text": "Zebracorp's Procurement department, in consultation with Finance & Control (F&C), ultimately decides the need for an advance payment guarantee from a supplier, based on the value of the prepayment and other relevant factors.",
        "expert_insight": "This outlines Zebracorp's internal decision-making process for requiring advance payment guarantees, emphasizing a structured, risk-based approach involving specific departments (Procurement and F&C) rather than an automatic requirement.",
        "confidence": 1.0,
        "subtype": "INSTRUCTION",
        "justification": "Describes a mandatory internal process for Zebracorp's departments when considering advance payment guarantees.",
        "implication_company": "Ensures a structured and informed decision-making process for requesting advance payment guarantees, involving relevant departments for risk assessment.",
        "implication_supplier": "Suppliers should understand that the requirement for an advance payment guarantee is not automatic and is subject to Zebracorp's internal assessment based on specific criteria.",
        "source_insight": "Highlights the inter-departmental collaboration (Procurement and F&C) in assessing the need for advance payment guarantees."
      },
      "rationale": "Consensus: Split between GUIDELINE (1 agent) and OTHER (3 agents). Evaluation: The text describes an internal decision-making process for Zebracorp's departments (Procurement and F&C) regarding advance payment guarantees. It outlines who makes the decision and what factors are considered, making it an internal instruction rather than a direct contractual obligation or a general guideline for external parties. The plain_text is self-sufficient and clear. Passed Value and Utility tests. Classified as OTHER (Instruction).",
      "decision_confidence": 0.95,
      "source_cluster_id": "2438b06f-ff77-46e0-9f63-c27ac8d2915c",
      "supporting_evidence": [
        "bdfdc974-9e5d-4b5d-a153-28cd9f36012f",
        "86098dad-4c66-4e09-bd7b-101ebf3d6b58",
        "d4ebd81f-0c8c-4dc9-b855-1aae27079554",
        "c21c128a-09d1-46a1-8f39-4ae160b08272"
      ]
    },
    {
      "id": "c00b0c24-1404-431a-a0b6-cb3e617da7ad",
      "is_valid": true,
      "decision_content": {
        "type": "GUIDELINE",
        "id": "f6a7b8c9-d0e1-2345-6789-0abcdef01234",
        "verbatim_text": "Zebracorp may also from time to time require performance bonds or guarantees from certain of its subcontractors in particular for key customer projects where the customer of Zebracorp is requesting such guarantees, or where such guarantee is otherwise found to be necessary in order to secure the performance of subcontractor’s obligations.",
        "plain_text": "Zebracorp may require performance bonds or guarantees from certain subcontractors, particularly for key customer projects where the customer requests them, or when otherwise necessary to secure subcontractor performance.",
        "expert_insight": "This outlines Zebracorp's discretionary right to secure subcontractor performance, particularly in high-stakes projects or when its own customer contracts demand such security. Subcontractors on key projects should be prepared for this requirement, as it protects Zebracorp's commitments and ensures project delivery.",
        "confidence": 1.0,
        "classification": "HIGH",
        "conditions": "For certain subcontractors, specifically for key customer projects where Zebracorp's customer requests such guarantees, or when otherwise found necessary to secure the subcontractor's obligations.",
        "justification": "The text uses 'may require', indicating a discretionary right for Zebracorp to mitigate performance risk, especially on critical projects or when customer demands dictate.",
        "implication_company": "Zebracorp can mitigate performance risks from subcontractors, especially in critical projects, and meet its own customer's security requirements.",
        "implication_supplier": "Subcontractors, particularly those on key customer projects or whose performance needs securing, should anticipate being asked to provide performance bonds or guarantees.",
        "source_insight": "Provides specific scenarios (key customer projects, securing obligations) where this right would be exercised."
      },
      "rationale": "Consensus: All agents correctly identified the finding as a GUIDELINE. Value Assessment: The verbatim text is clear, self-sufficient, and establishes a specific right for Zebracorp. Type-Specific Criteria (GUIDELINE): It creates an actionable right for Zebracorp to require performance bonds/guarantees under specified conditions. It is a specific rule, not generic advice. The classification is elevated to HIGH due to its importance in mitigating risk for key customer projects and securing subcontractor obligations. Utility Check: This is a specific and actionable rule that helps Zebracorp manage risk and informs subcontractors of potential requirements.",
      "decision_confidence": 1.0,
      "source_cluster_id": "79c410a9-4529-4ba6-b4b7-808275c3d0a4",
      "supporting_evidence": [
        "0313343b-bc05-4dc7-ba77-ad1f18e38ec8",
        "42062ce0-d8d9-43d8-b678-132d724aa666",
        "7c83849d-de09-4146-8c4e-0e592dc38ceb"
      ]
    },
    {
      "id": "aaa9f19b-12ae-4857-b9f9-a364f98e3c19",
      "is_valid": true,
      "decision_content": {
        "type": "GUIDELINE",
        "id": "f6a7b8c9-d0e1-2345-6789-0abcdef01234",
        "verbatim_text": "Any guarantee to be issued in favor of Zebracorp must be from an international bank acceptable to Zebracorp. Bank rating should be investment grade (BBB-) at minimum.",
        "plain_text": "Guarantees issued to Zebracorp must be from an international bank acceptable to Zebracorp, with a minimum investment grade (BBB-) credit rating.",
        "expert_insight": "This sets clear quality and reliability standards for banks providing guarantees to Zebracorp, ensuring the enforceability and value of the security received.",
        "confidence": 1.0,
        "classification": "CRITICAL",
        "conditions": "When any guarantee is to be issued in favor of Zebracorp.",
        "justification": "Ensures the reliability, enforceability, and quality of guarantees received by Zebracorp.",
        "implication_company": "Zebracorp ensures the quality, reliability, and enforceability of received bank guarantees by setting clear standards for the issuing institution.",
        "implication_supplier": "Suppliers must ensure their chosen international bank meets Zebracorp's acceptability criteria and has a minimum investment grade (BBB-) credit rating when issuing guarantees.",
        "source_insight": "Highlights mandatory requirements for the counterparty providing the guarantee, including international presence, Zebracorp's acceptance, and a minimum credit rating."
      },
      "rationale": "Consensus: Mixed (3 GUIDELINE, 1 OTHER). The rule specifies a mandatory requirement for the source and quality of guarantees issued to Zebracorp, making it a clear obligation/restriction. Therefore, 'GUIDELINE' is the correct classification. Value Assessment: Candidate 2 provided the most complete 'verbatim_text' by including the bank rating requirement, which is directly linked in the source text. The 'plain_text' is clear and self-sufficient. Type-Specific Criteria: The rule is actionable, complete, and creates a specific obligation for suppliers, thus correctly classified as a 'GUIDELINE'. The 'CRITICAL' classification is appropriate given its impact on Zebracorp's financial security. Utility Check: The finding is specific, helps in negotiation, and protects the company by ensuring the quality of financial instruments.",
      "decision_confidence": 1.0,
      "source_cluster_id": "f3bcf46f-29ad-4177-93f0-6af5f088927e",
      "supporting_evidence": [
        "b55ba9a7-0026-4d83-9bdb-fcb5f99fac49",
        "95954190-9b18-4d6c-9e41-4ce9d0641019",
        "d1d41fb6-76c1-4548-97fb-40d402b01fb2",
        "f0acdcb6-7ce2-4ff0-93ff-4a19a0e1991e"
      ]
    },
    {
      "id": "7d5c16bc-6f0f-4729-bb93-5b741ea4089f",
      "is_valid": true,
      "decision_content": {
        "type": "GUIDELINE",
        "id": "b8c9d0e1-f2a3-4567-8901-abcdef012346",
        "verbatim_text": "Bank rating should be investment grade (BBB-) at minimum.",
        "plain_text": "Banks issuing guarantees in favor of Zebracorp must have a minimum investment grade rating of BBB-.",
        "expert_insight": "This sets a clear financial threshold for guarantor banks, protecting Zebracorp from counterparty risk by ensuring the guarantor's financial stability and the enforceability of the guarantee.",
        "confidence": 1.0,
        "classification": "CRITICAL",
        "conditions": "For banks issuing guarantees in favor of Zebracorp.",
        "justification": "The phrase 'should be... at minimum' in a financial context implies a mandatory floor for acceptable creditworthiness.",
        "implication_company": "Zebracorp minimizes the risk of a guarantee becoming worthless due to the issuing bank's financial instability, thereby protecting its financial interests.",
        "implication_supplier": "Suppliers must ensure their chosen bank for guarantees meets Zebracorp's minimum BBB- investment grade rating requirement, which may limit their choice of financial institutions.",
        "source_insight": "The source text explicitly states the minimum rating (BBB-) and the type (investment grade)."
      },
      "rationale": "Consensus: All agents correctly identified this as a GUIDELINE. Evaluation: The verbatim text establishes a clear, specific, and mandatory financial requirement for banks issuing guarantees to Zebracorp. It is self-sufficient and directly actionable, mitigating counterparty risk. Passed Value and Utility tests. Classification: Elevated to CRITICAL due to the direct impact on the financial security of guarantees.",
      "decision_confidence": 1.0,
      "source_cluster_id": "37441185-8722-4480-8cef-c4801979688f",
      "supporting_evidence": [
        "895ee014-8e0f-491b-aa42-cc7801d40d51",
        "8123e3fd-c619-4c6d-b6c1-02714d3951fa",
        "0e1eea53-91fb-4c42-a218-16c32411e9c1"
      ]
    },
    {
      "id": "d3feb9f0-cf43-40cd-b09e-6e27b097cffd",
      "is_valid": true,
      "decision_content": {
        "type": "OTHER",
        "id": "a7b8c9d0-e1f2-3456-7890-abcdef012345",
        "verbatim_text": "A parent company guarantee may be preferred over a bank issued guarantee or bond due to the fact that guarantees/bonds issued by financial institutions carry a charge. This charge is often directly or indirectly passed on the prices paid by Zebracorp. For this reason, the benefits of requesting supplier guarantees must be carefully assessed.",
        "plain_text": "Zebracorp may prefer parent company guarantees over bank guarantees because bank guarantees incur charges that are often passed on to Zebracorp. Consequently, Zebracorp must carefully assess the benefits of requesting any supplier guarantee.",
        "expert_insight": "This record outlines Zebracorp's strategic approach to supplier guarantees. It highlights a preference for parent company guarantees due to cost implications of bank-issued guarantees, which are often passed back to Zebracorp. This preference necessitates a disciplined internal cost-benefit analysis for all guarantee requests, serving as both a negotiation tactic and an internal financial control.",
        "confidence": 1.0,
        "subtype": "TACTIC",
        "conditions": "When considering requesting supplier guarantees, particularly from financial institutions.",
        "justification": "Guarantees/bonds issued by financial institutions carry a charge that is often directly or indirectly passed on the prices paid by Zebracorp, making parent company guarantees a potentially more cost-effective option.",
        "implication_company": "Zebracorp aims to reduce costs by favoring parent company guarantees and ensures financial prudence through a mandatory cost-benefit assessment for all guarantee requests.",
        "implication_supplier": "Suppliers should be aware that Zebracorp may prefer parent company guarantees to avoid bank charges and that any guarantee request will be subject to Zebracorp's internal cost-benefit analysis.",
        "source_insight": "This segment combines Zebracorp's preference, its financial rationale, and a resulting internal instruction for assessment, forming a cohesive strategic statement."
      },
      "rationale": "Consensus was split between GUIDELINE and OTHER. The chosen `verbatim_text` encompasses Zebracorp's strategic preference for parent company guarantees, the financial justification for this preference (bank charges passed on), and the resulting internal obligation to carefully assess the benefits of requesting any supplier guarantee. Classifying this as `OTHER` with `subtype: TACTIC` best captures this comprehensive strategic approach rather than isolating just the assessment as a `GUIDELINE`. The `plain_text` is self-sufficient and accurately reflects the full context, fulfilling the 'Clarity & Context' requirement.",
      "decision_confidence": 0.98,
      "source_cluster_id": "13bf5a10-3f54-40c4-b377-24824c1e6340",
      "supporting_evidence": [
        "61c5c3ea-6b7a-4e11-a467-fbac66956e17",
        "32d04638-72f7-416b-b539-599e479c49b3",
        "afddceff-42e0-4932-9565-e4d6aa1ee154",
        "b281aa28-bf19-4a8d-86bd-952e753e7a07"
      ]
    },
    {
      "id": "8afe1f20-0cef-4aee-b8b1-c09044637cb8",
      "is_valid": true,
      "decision_content": {
        "type": "GUIDELINE",
        "id": "consolidated-corporate-guarantee-requirements-001",
        "verbatim_text": "When using a corporate/parent company guarantees, it should however be noted that these are acceptable only if the credit rating of the issuing parent entity is BBB- at minimum. Also, for corporate/parent company guarantees Zebracorp´s model guarantee wordings should be used.",
        "plain_text": "Corporate/parent company guarantees are acceptable only if the issuing parent entity has a minimum credit rating of BBB- and Zebracorp's model guarantee wordings are used.",
        "expert_insight": "This sets critical standards for accepting corporate/parent company guarantees, requiring the issuing entity to have a minimum BBB- credit rating and mandating the use of Zebracorp's model guarantee wordings to ensure both financial stability and legal consistency.",
        "confidence": 1.0,
        "classification": "CRITICAL",
        "conditions": "When considering corporate/parent company guarantees.",
        "justification": "Establishes mandatory requirements for accepting corporate/parent company guarantees, ensuring financial stability and legal consistency.",
        "implication_company": "Zebracorp ensures the financial stability of corporate/parent company guarantors and legal consistency through standardized wording.",
        "implication_supplier": "Parent companies providing guarantees must meet a minimum BBB- credit rating and use Zebracorp's specific legal wording for such guarantees.",
        "source_insight": "These are critical conditions for the validity and enforceability of parent company guarantees, paralleling bank rating requirements and emphasizing legal standardization."
      },
      "rationale": "Consensus: Mixed (GUIDELINE vs. OTHER). Decided on GUIDELINE as the text establishes mandatory conditions for accepting corporate/parent company guarantees. Evaluation: The verbatim text from Candidate 2 is the most complete, capturing two distinct but related conditions for accepting corporate/parent company guarantees (credit rating and model wording). This is a critical, actionable rule that protects Zebracorp by ensuring financial stability of the guarantor and legal consistency. Passed all value and utility checks. Classified as CRITICAL.",
      "decision_confidence": 1.0,
      "source_cluster_id": "36811cb2-406a-4000-8422-589a83488c6c",
      "supporting_evidence": [
        "2d0241e0-5c08-4ae2-a32a-f749105322cf",
        "5ba742c4-2a7f-4b25-bb2f-8f7df632a2ab",
        "e410cf15-7535-418f-858c-724b82492dac",
        "d970e349-8f45-4c73-9ed2-5f00f090af9f"
      ]
    },
    {
      "id": "e0524c72-9765-4dd1-b5cc-bcb892a678cc",
      "is_valid": true,
      "decision_content": {
        "type": "GUIDELINE",
        "id": "e1f2a3b4-c5d6-7890-1234-abcdef012349",
        "verbatim_text": "Also, for corporate/parent company guarantees Zebracorp´s model guarantee wordings should be used.",
        "plain_text": "Zebracorp's model guarantee wordings must be used for all corporate and parent company guarantees.",
        "expert_insight": "Standardizing guarantee wordings is critical for legal consistency, enforceability, and efficient processing, significantly reducing legal and financial risk for Zebracorp. This ensures that all such guarantees align with Zebracorp's legal standards and requirements.",
        "confidence": 1.0,
        "classification": "HIGH",
        "conditions": "When corporate/parent company guarantees are used.",
        "justification": "Ensures legal consistency, enforceability, and alignment with Zebracorp's legal standards, minimizing potential risks associated with non-standard guarantee language.",
        "implication_company": "Zebracorp benefits from standardized legal terms in corporate/parent company guarantees, reducing legal review time and ensuring robust protection.",
        "implication_supplier": "Suppliers are obligated to use Zebracorp's specific model wordings or templates for any corporate or parent company guarantees they provide.",
        "source_insight": "This guideline implies the existence of pre-approved legal templates for corporate/parent company guarantees, which are essential for maintaining legal control and consistency."
      },
      "rationale": "Consensus: All agents correctly identified this as a GUIDELINE. Evaluation: The verbatim text clearly states a specific obligation regarding the use of Zebracorp's model guarantee wordings for corporate/parent company guarantees. The phrase 'should be used' in this legal context implies a mandatory requirement for standardization and risk mitigation, making it actionable and specific. It passes the Clarity, Value, and Utility checks. The classification as HIGH priority is appropriate due to the legal implications of guarantee wordings.",
      "decision_confidence": 1.0,
      "source_cluster_id": "bf38abad-f066-42ba-b113-ba3b543dbc77",
      "supporting_evidence": [
        "5b673ca1-1264-49c8-98ee-ea8984160187",
        "2b88a140-45ce-4000-9d13-ddc23eef4370",
        "7efab50a-cac4-462c-a358-4693570e91fb"
      ]
    },
    {
      "id": "73a86fb4-2b82-4e12-9e92-0183b8ebd30d",
      "is_valid": true,
      "decision_content": {
        "type": "GUIDELINE",
        "id": "golden-record-guarantees-governing-law-001",
        "verbatim_text": "The corporate/parent company guarantee should be under same applicable law as the supply agreement which is generally New York law. Other governing law provisions should be cleared with Legal and Compliance or Finance.",
        "plain_text": "Corporate/parent company guarantees should generally be governed by New York law, matching the supply agreement. Any deviations require approval from Legal and Compliance or Finance.",
        "expert_insight": "This ensures legal coherence and simplifies dispute resolution by aligning the governing law of the guarantee with the main supply agreement, typically New York law. The requirement for internal approval for deviations underscores Zebracorp's strong preference for standard terms and legal consistency.",
        "confidence": 1.0,
        "classification": "HIGH",
        "conditions": "When a corporate/parent company guarantee is used. Deviations from New York law as the governing law require clearance.",
        "justification": "The text uses 'should be under' to establish a strong preference for legal consistency, which simplifies enforcement and interpretation. The explicit requirement for internal approval for deviations reinforces this preference and ensures legal review for non-standard clauses.",
        "implication_company": "Zebracorp ensures legal consistency across related agreements, typically under New York law, streamlining legal enforcement and reducing jurisdictional complexities. It also maintains control over non-standard governing law provisions through internal approval processes.",
        "implication_supplier": "Suppliers must ensure the governing law of their parent company guarantee aligns with the supply agreement, generally New York law. Any proposed deviations will require significant internal Zebracorp approval from Legal and Compliance or Finance.",
        "source_insight": "This is a standard legal practice to avoid conflicts of law and simplify dispute resolution, with a clear internal process for managing exceptions."
      },
      "rationale": "Consensus Check: Three agents classified this as a GUIDELINE, while one classified it as OTHER (INSTRUCTION). The verbatim text contains both a clear directive ('should be under same applicable law') and a procedural instruction for deviations ('should be cleared with Legal and Compliance or Finance'). The primary nature is a specific rule regarding governing law, making GUIDELINE the most appropriate classification. The instruction for deviations is a critical part of implementing this guideline.\nValue Assessment: Candidate 2 provided the most complete verbatim_text, capturing both sentences, which is essential for clarity and self-sufficiency. The combined text clearly states the rule and the process for exceptions, making it highly actionable and valuable.\nType-Specific Criteria (GUIDELINE): The finding creates a specific obligation regarding the governing law for corporate/parent company guarantees and outlines a mandatory process for any deviations. This is highly actionable and complete. The classification is HIGH due to the legal implications of governing law.\nUtility Check: This item is specific, helps in contract negotiation by setting clear expectations for governing law, and protects Zebracorp by ensuring legal consistency and control over exceptions. Therefore, it passes the utility check.",
      "decision_confidence": 1.0,
      "source_cluster_id": "61073746-c7fd-419e-8cfa-7e3edc94fd4d",
      "supporting_evidence": [
        "c28431a6-304e-46d5-90f7-16bae1defb77",
        "8b4070e5-b428-47e4-9c36-e1643ad43d82",
        "72467852-ba4e-469d-9f5f-a2f2cadad41d",
        "1d53ba40-ead9-4ada-806b-e3c33ea61229"
      ]
    },
    {
      "id": "3aae65bd-a422-496e-a1dc-4df661c00478",
      "is_valid": true,
      "decision_content": {
        "type": "GUIDELINE",
        "id": "cluster_guarantee_governing_law_clearance",
        "verbatim_text": "Other governing law provisions should be cleared with Legal and Compliance or Finance.",
        "plain_text": "Any governing law provisions for corporate/parent company guarantees that deviate from the standard applicable law (generally New York law) must be approved by Zebracorp's Legal and Compliance or Finance departments.",
        "expert_insight": "This establishes a mandatory internal review and approval process for any non-standard governing law provisions related to corporate/parent company guarantees, ensuring legal consistency and mitigating potential legal and financial risks for Zebracorp.",
        "confidence": 1.0,
        "classification": "HIGH",
        "conditions": "If governing law provisions for corporate/parent company guarantees differ from the standard applicable law (generally New York law).",
        "justification": "The phrase 'should be cleared' indicates a mandatory internal approval process for deviations from the standard governing law, ensuring proper legal and financial oversight.",
        "implication_company": "Zebracorp maintains strict control over legal terms, requiring internal approval from Legal and Compliance or Finance for any non-standard governing law provisions for corporate/parent company guarantees, thereby mitigating legal and financial exposure.",
        "implication_supplier": "Suppliers proposing a different governing law for corporate/parent company guarantees must understand that such deviations require specific internal approval from Zebracorp's Legal and Compliance or Finance departments, which may impact negotiation timelines.",
        "source_insight": "This rule specifies the exact departments (Legal and Compliance or Finance) responsible for clearing deviations, highlighting the importance of legal and financial review for such provisions."
      },
      "rationale": "CONSENSUS: All agents agreed on the 'GUIDELINE' type and 'HIGH' classification. EVALUATION: The verbatim text 'Other governing law provisions should be cleared with Legal and Compliance or Finance.' refers to deviations from the standard governing law for corporate/parent company guarantees (generally New York law), as established in the preceding sentence of the source text. The 'plain_text' has been carefully crafted to incorporate this crucial context, making the finding self-sufficient and clear. The phrase 'should be cleared' indicates a mandatory internal process, confirming its classification as a 'GUIDELINE'. It passes the Value, Actionability, and Utility checks by establishing a critical risk mitigation step for Zebracorp. Therefore, it is accepted as a valid and important finding.",
      "decision_confidence": 1.0,
      "source_cluster_id": "8f2c9aa1-f67a-4dd3-b38b-21e657d944f2",
      "supporting_evidence": [
        "220cfb37-2758-4af0-a7ad-7d2f49846184",
        "ea2d5acd-f119-4880-a06d-0d35ccd24d3a",
        "e965cb59-4acd-4b00-90c5-9545b0036d4c"
      ]
    },
    {
      "id": "f86e1f0d-7c8b-4cf5-9529-6fcd9daf1ea3",
      "is_valid": true,
      "decision_content": {
        "type": "GUIDELINE",
        "id": "b4c5d6e7-f8a9-0123-4567-abcdef012352",
        "verbatim_text": "As for bank guarantees/performance bonds, Zebracorp should only accept so called on-demand guarantees or stand-by Letters of Credit.",
        "plain_text": "For bank guarantees and performance bonds, Zebracorp will only accept on-demand guarantees or stand-by Letters of Credit.",
        "expert_insight": "This is a critical requirement specifying the acceptable types of bank-issued security. On-demand guarantees and stand-by Letters of Credit provide Zebracorp with direct and swift access to funds without needing to prove default, offering maximum enforceability and security.",
        "confidence": 1.0,
        "classification": "CRITICAL",
        "conditions": "For bank guarantees and performance bonds.",
        "justification": "The text uses 'should only accept', which in this context implies a strict, mandatory requirement for the type of guarantee due to enforceability. These specific types of guarantees offer greater security and ease of enforcement, ensuring immediate access to funds upon demand.",
        "implication_company": "Zebracorp ensures maximum enforceability and ease of calling upon guarantees, securing its position by ensuring quick and unconditional access to funds in case of default, thereby reducing risk.",
        "implication_supplier": "Suppliers must provide specific types of guarantees (on-demand or stand-by L/C) for bank guarantees and performance bonds, which are generally more robust and potentially more costly or harder to obtain than conditional guarantees.",
        "source_insight": "Explicitly names the preferred types of guarantees for their enforceability and utility, highlighting a critical legal requirement for the quality of the guarantee instrument."
      },
      "rationale": "Consensus: Mixed on type (3 GUIDELINE, 1 OTHER). I classify it as a GUIDELINE because the phrase 'should only accept' in this context establishes a mandatory requirement and restriction for Zebracorp regarding the types of guarantees it will deem acceptable, making it an actionable rule. Value Assessment: The verbatim text is clear and self-sufficient, requiring no additional context. The plain text accurately rephrases the rule. Type-Specific Criteria: As a GUIDELINE, it is highly actionable, specifying a critical requirement for financial instruments. It is complete and not generic advice. The classification as 'CRITICAL' is appropriate given its direct impact on the enforceability and security of guarantees for Zebracorp. Utility Check: This finding is specific, helps in negotiation, and directly protects the company by ensuring robust security instruments. Therefore, it is a valid and important finding.",
      "decision_confidence": 1.0,
      "source_cluster_id": "a9d7b324-35c8-46eb-bea7-58689c78c42a",
      "supporting_evidence": [
        "975df24c-0f19-4f62-9f9f-e54c9874761c",
        "b28de089-23ee-44d8-96d4-bb39e7820e7e",
        "8fcbc2c9-ce04-437b-8e54-ee4cb0f41b84",
        "35850ddb-396d-481a-9a84-3184ae3f5c2e"
      ]
    },
    {
      "id": "f035a2ff-1fbd-4dfc-a2a8-f6f7ec2a18cf",
      "is_valid": true,
      "decision_content": {
        "type": "GUIDELINE",
        "id": "c5d6e7f8-a9b0-1234-5678-abcdef012353",
        "verbatim_text": "Any deviations to these templates would need to be approved by Zebracorp Global Guarantee Center and/or Zebracorp Finance Legal.",
        "plain_text": "Any deviations from Zebracorp's guarantee templates must be approved by the Zebracorp Global Guarantee Center and/or Zebracorp Finance Legal.",
        "expert_insight": "This is a critical control measure ensuring strict oversight over the legal wording of guarantees. It prevents the introduction of unfavorable terms or ambiguities and signals to suppliers that any proposed changes to Zebracorp's standard templates will undergo rigorous internal review and approval, making deviations difficult and time-consuming.",
        "confidence": 1.0,
        "classification": "CRITICAL",
        "conditions": "If there are deviations from Zebracorp's standard guarantee templates.",
        "justification": "The phrase 'would need to be approved' indicates a mandatory, high-level approval process for any changes to standard legal documents, ensuring legal and financial integrity and mitigating risk.",
        "implication_company": "Zebracorp maintains strict control over the legal and financial implications of guarantee wording, ensuring consistency and mitigating legal and financial risks associated with non-standard terms.",
        "implication_supplier": "Suppliers proposing changes to Zebracorp's guarantee templates must obtain specific internal approvals from the Zebracorp Global Guarantee Center and/or Zebracorp Finance Legal, which can be a lengthy and challenging process.",
        "source_insight": "Highlights the specific departments responsible for approving template deviations, reinforcing Zebracorp's preference for standardized legal language to minimize risk."
      },
      "rationale": "Consensus: Mixed, with a majority classifying it as a GUIDELINE (3 agents) and one as OTHER (INSTRUCTION). Evaluation: The phrase 'would need to be approved' clearly establishes a mandatory process and a specific obligation/restriction regarding deviations from templates. This is a highly actionable rule, not merely an instruction or generic advice. The `plain_text` effectively contextualizes 'these templates' to 'Zebracorp's guarantee templates', making the finding self-sufficient. Passed Value and Utility tests. Classified as a Critical Guideline due to its importance in controlling legal documentation.",
      "decision_confidence": 1.0,
      "source_cluster_id": "6fcb4af1-9963-4ed4-8c49-15eea9547203",
      "supporting_evidence": [
        "3e81c197-e3a5-4643-922c-79c3bbbf7885",
        "74369bd2-cada-4afa-9876-419656342545",
        "d0604908-026e-44c3-85c0-653daddbd736",
        "720efcfe-25bc-43cd-87c2-9e8d287ca255"
      ]
    },
    {
      "id": "0847149d-5f28-4a40-8c69-ea2668cb08ac",
      "is_valid": true,
      "decision_content": {
        "type": "GUIDELINE",
        "id": "d6e7f8a9-b0c1-2345-6789-abcdef012354",
        "verbatim_text": "Final guarantee documentation should be delivered to Zebracorp Global Guarantee Center which will keep track on existing guarantees and which will store the guarantees.",
        "plain_text": "Final guarantee documentation must be delivered to the Zebracorp Global Guarantee Center for tracking and storage.",
        "expert_insight": "This establishes a centralized repository and management process for all guarantees, which is essential for effective risk management, compliance, auditability, and timely action (e.g., calling on a guarantee or managing expiry dates).",
        "confidence": 1.0,
        "classification": "HIGH",
        "conditions": "Upon finalization of guarantee documentation.",
        "justification": "The text mandates a specific internal process for handling critical financial documents, ensuring centralized tracking, storage, and management of all guarantees for risk management and audit purposes.",
        "implication_company": "Ensures centralized management, tracking, and secure storage of all guarantees, improving risk oversight and compliance.",
        "implication_supplier": "Suppliers need to ensure final documentation is correctly submitted to Zebracorp's Global Guarantee Center.",
        "source_insight": "The text explicitly states the purpose of delivery: 'which will keep track on existing guarantees and which will store the guarantees'."
      },
      "rationale": "Consensus: Mixed (3 GUIDELINE, 1 OTHER). Evaluation: The phrase 'should be delivered' in the context of managing critical financial documents like guarantees, coupled with the stated purpose ('keep track on existing guarantees and which will store the guarantees'), indicates a mandatory internal operational process. This is a specific, actionable rule for document management with significant implications for risk and compliance. Therefore, it is classified as a GUIDELINE. Passed Value and Utility tests. Classified as High priority due to its importance for financial oversight.",
      "decision_confidence": 0.95,
      "source_cluster_id": "5c8a1cd8-8d09-4556-bda3-309661ced1ec",
      "supporting_evidence": [
        "d0703a35-d529-4c8e-abea-3587bd4a870a",
        "92ceade9-9f75-4412-8fee-258ef9011b57",
        "f07dd916-0748-4835-9c04-3e828f2013b6",
        "b3a31c12-d16e-48a9-ad5c-73cee9cbe38c"
      ]
    },
    {
      "id": "d1f07038-563a-484c-95a9-e5908cac674c",
      "is_valid": true,
      "decision_content": {
        "type": "OTHER",
        "id": "a1b2c3d4-e5f6-7890-1234-567890abcdef",
        "verbatim_text": "Zebracorp is generally relying on its suppliers having conducted necessary credit risk assessments on Zebracorp contracting entity and having satisfied itself as to the creditworthiness of Zebracorp.",
        "plain_text": "Zebracorp expects its suppliers to conduct their own credit risk assessments on Zebracorp's contracting entity and satisfy themselves as to Zebracorp's creditworthiness.",
        "expert_insight": "This statement establishes Zebracorp's default position, shifting the burden of due diligence regarding Zebracorp's creditworthiness onto the supplier. It clarifies Zebracorp's expectation that suppliers perform their own credit risk assessments before entering into agreements, implicitly reducing Zebracorp's perceived need to provide guarantees.",
        "confidence": 1.0,
        "subtype": "INFO",
        "justification": "Provides background information on Zebracorp's expectation from suppliers regarding credit checks and sets the context for Zebracorp's policy on not providing guarantees.",
        "implication_company": "Reduces the internal pressure and financial burden on Zebracorp to provide guarantees by setting an expectation for supplier due diligence.",
        "implication_supplier": "Suppliers must perform their own credit risk assessments on Zebracorp and cannot rely on Zebracorp providing guarantees, as Zebracorp expects them to satisfy themselves as to its creditworthiness.",
        "source_insight": "Highlights Zebracorp's proactive stance in managing its own financial obligations and risk exposure by placing the initial assessment burden on the supplier."
      },
      "rationale": "Consensus: All agents agree on the `type: OTHER` and `subtype: INFO`, and the `verbatim_text` is identical across all candidates. Evaluation: The finding clearly states Zebracorp's expectation that suppliers conduct their own credit risk assessments. This provides essential context for Zebracorp's policy on not issuing guarantees. The text is self-sufficient, clear, and highly relevant for understanding Zebracorp's stance. It passes the Value and Utility checks, offering critical background information for negotiation. Classified as `OTHER` (INFO) as it explains a foundational premise rather than a direct obligation or definition.",
      "decision_confidence": 1.0,
      "source_cluster_id": "57c0320e-70d4-4f87-a669-80422ed3cf0b",
      "supporting_evidence": [
        "a167b8bf-172a-44a4-b55c-051a1ef82ab4",
        "bc78bc88-97df-48f4-aca1-62d24b77276e",
        "3acbbec4-871b-480f-8cbb-e1bfcbf207c9"
      ]
    },
    {
      "id": "ec6cf08a-0885-4076-95f0-ca4466c5edb0",
      "is_valid": true,
      "decision_content": {
        "type": "OTHER",
        "id": "b2c3d4e5-f6a7-8901-2345-67890abcdef0",
        "verbatim_text": "Any guarantee issued by Zebracorp would need to recorded in our financial accounts and would increase our financial liabilities.",
        "plain_text": "Any guarantee issued by Zebracorp must be recorded in its financial accounts and will increase its financial liabilities.",
        "expert_insight": "This statement explains the internal financial and accounting implications for Zebracorp when issuing guarantees, providing the core rationale for its general policy of not providing them to suppliers.",
        "confidence": 1.0,
        "subtype": "INFO",
        "justification": "Explains the financial impact and accounting requirements for Zebracorp when issuing guarantees, which underpins its policy of not providing them.",
        "implication_company": "Issuing guarantees has direct financial accounting and liability implications for Zebracorp, reinforcing its reluctance to provide them.",
        "implication_supplier": "Helps suppliers understand Zebracorp's internal financial constraints and the reasons behind its policy of not issuing guarantees.",
        "source_insight": "This is a factual statement about accounting and financial reporting, underpinning the strategic policy mentioned immediately after in the source text."
      },
      "rationale": "Consensus Check: All agents agree on the type 'OTHER' and subtype 'INFO', and the verbatim text is identical across all candidates. Value Assessment: The text is self-sufficient and clearly explains the financial implications for Zebracorp when issuing guarantees. It serves as a crucial justification for Zebracorp's general policy of not providing guarantees to suppliers, as explicitly stated in the source text ('For these reasons, the main rule is that Zebracorp does not give guarantees...'). Type-Specific Criteria: As an 'OTHER' (INFO) type, it provides essential contextual information and justification for a policy. It is not a rule or a definition itself, but explains the 'why' behind a rule. Utility Check: This finding is highly useful as it clarifies the financial rationale behind Zebracorp's stance on guarantees, which is valuable for understanding the company's position and for negotiation purposes. It is specific and not filler.",
      "decision_confidence": 1.0,
      "source_cluster_id": "b3a6cc5c-3a91-4d85-8d15-3be8907d47e0",
      "supporting_evidence": [
        "66bfb1d1-46ae-48d8-82c6-6730ec7ee300",
        "6057d7e5-336c-412f-9a3b-a3dca91004a4",
        "cbd11c24-3816-4c8f-995a-e3190077b0c8"
      ]
    },
    {
      "id": "83afb807-09b4-459a-9c2e-7d8216c3986b",
      "is_valid": true,
      "decision_content": {
        "type": "OTHER",
        "id": "b4c5d6e7-f8a9-4b0c-1d2e-3f4a5b6c7d8e",
        "verbatim_text": "A parent company guarantee may be preferred over a bank issued guarantee or bond due to the fact that guarantees/bonds issued by financial institutions carry a charge.",
        "plain_text": "Parent company guarantees might be preferred over bank-issued guarantees or bonds because financial institutions charge fees for their guarantees.",
        "expert_insight": "This indicates Zebracorp's preference for cost-effective guarantee solutions, acknowledging the hidden costs associated with bank-issued instruments. Suppliers should be aware of this preference, but also note the subsequent conditions for parent company guarantees.",
        "confidence": 1.0,
        "subtype": "INFO",
        "justification": "Guarantees/bonds issued by financial institutions carry a charge.",
        "implication_company": "Zebracorp considers the cost implications when deciding on the type of guarantee to request, seeking potential cost savings by avoiding charges associated with bank-issued guarantees.",
        "implication_supplier": "Suppliers might find it more cost-effective to offer a parent company guarantee if acceptable to Zebracorp, potentially avoiding bank charges.",
        "source_insight": null
      },
      "rationale": "Consensus: Agents agreed on the type (OTHER) and subtype (INFO), as well as the verbatim text. Evaluation: The finding clearly explains Zebracorp's preference for parent company guarantees due to the charges associated with bank-issued guarantees. This provides valuable context and justification, making it self-sufficient and useful for negotiation. It passes the Value and Utility checks. Classified as OTHER (INFO) as it provides an explanation/justification rather than a direct rule or definition.",
      "decision_confidence": 1.0,
      "source_cluster_id": "e259cd84-21e4-4ba9-84d3-6f1ed774ce01",
      "supporting_evidence": [
        "5f41e1ae-3744-4e93-ae6f-ec005485c294",
        "cbfa3e87-b45c-440c-8792-d135f6fa39bf"
      ]
    },
    {
      "id": "e38aca56-15d8-4a62-9f59-a7a3ea888d98",
      "is_valid": true,
      "decision_content": {
        "type": "OTHER",
        "id": "consolidated-guarantee-charge-impact",
        "verbatim_text": "This charge is often directly or indirectly passed on the prices paid by Zebracorp.",
        "plain_text": "Charges associated with guarantees or bonds issued by financial institutions are often directly or indirectly passed on to Zebracorp through the prices paid.",
        "expert_insight": "This insight explains Zebracorp's preference for parent company guarantees by highlighting that the costs of financial institution guarantees are frequently passed on to Zebracorp, impacting its expenses and influencing its negotiation strategy.",
        "confidence": 1.0,
        "subtype": "INFO",
        "justification": "This information justifies Zebracorp's preference for parent company guarantees over bank-issued guarantees.",
        "implication_company": "Zebracorp often indirectly bears the cost of financial institution guarantees through increased prices, influencing its preference for parent company guarantees and its negotiation strategy.",
        "implication_supplier": "Suppliers should be aware that Zebracorp may scrutinize pricing that includes guarantee costs or negotiate for parent company guarantees to avoid these indirect charges.",
        "source_insight": "N/A"
      },
      "rationale": "Consensus: Both agents correctly identified the finding as 'OTHER' with 'INFO' subtype and provided identical verbatim text. Evaluation: The verbatim text 'This charge is often directly or indirectly passed on the prices paid by Zebracorp.' refers to charges on guarantees/bonds issued by financial institutions mentioned in the preceding sentence of the source text. The 'plain_text' has been rewritten to include this context, making it self-sufficient and clear. The finding provides crucial contextual information explaining Zebracorp's preference for parent company guarantees, thus passing the Value and Utility checks. It is specific and helps understand the financial implications for Zebracorp.",
      "decision_confidence": 1.0,
      "source_cluster_id": "964a4a66-7e29-4f36-90fc-077f0e695103",
      "supporting_evidence": [
        "ca28389c-2062-40d0-ac3e-5187a0f0efe1",
        "b2161d50-06d7-4f91-888d-6f93f4c5126d"
      ]
    },
    {
      "id": "0f7ae314-b5a0-49e5-ab8e-a04c2d3033fe",
      "is_valid": true,
      "decision_content": {
        "type": "OTHER",
        "id": "d2e3f4a5-b6c7-4d8e-9f0a-1b2c3d4e5f6a",
        "verbatim_text": "A template for an Advance Payment Guarantee can be found below.",
        "plain_text": "A template for an Advance Payment Guarantee is provided within this document.",
        "expert_insight": "This statement informs the reader that a standardized template for an Advance Payment Guarantee is included within this document, facilitating compliance and simplifying the process for both Zebracorp and its suppliers.",
        "confidence": 1.0,
        "subtype": "INFO",
        "justification": "Informs the reader about the availability of a specific template within the document.",
        "implication_company": "Zebracorp provides a standardized resource to ensure consistency in guarantee documentation.",
        "implication_supplier": "Suppliers have direct access to a pre-approved template for advance payment guarantees, simplifying compliance.",
        "source_insight": null
      },
      "rationale": "Consensus: Agents fully agreed on the type (OTHER) and subtype (INFO), as well as the verbatim text. Evaluation: The statement is a clear, self-sufficient piece of information indicating the availability of a specific template within the document. It passes the Clarity, Value, and Utility checks as it provides practical guidance for users of the document. Classified as OTHER (INFO).",
      "decision_confidence": 1.0,
      "source_cluster_id": "d374bfb0-b494-46e6-93e7-5b9707dab8b9",
      "supporting_evidence": [
        "29cf0c8c-0ccf-49a9-94c0-2e8291131859",
        "384767c5-dfe4-4a5e-86c6-7be18e5a0b84"
      ]
    },
    {
      "id": "b9ad7ac2-0f09-48e0-a645-f1997750f106",
      "is_valid": true,
      "decision_content": {
        "type": "OTHER",
        "id": "b0c1d2e3-f4a5-6789-0123-abcdef012358",
        "verbatim_text": "Other guarantee templates are available from Legal & Compliance.",
        "plain_text": "Additional guarantee templates can be obtained from Zebracorp's Legal & Compliance department.",
        "expert_insight": "This points to Legal & Compliance as the central repository for standardized guarantee documentation, ensuring legal review and consistency across all guarantee types and centralizing access to standardized legal documents.",
        "confidence": 1.0,
        "subtype": "INFO",
        "justification": "Provides information on where to find additional guarantee templates.",
        "implication_company": "Legal & & Compliance serves as a central resource for guarantee templates, ensuring consistency and proper legal review.",
        "implication_supplier": "Suppliers needing other guarantee templates should contact Zebracorp's Legal & Compliance department.",
        "source_insight": "N/A"
      },
      "rationale": "Consensus: Agents fully agreed on the type (OTHER) and subtype (INFO), as well as the verbatim and plain text. Value Assessment: The statement is clear, self-sufficient, and provides specific, actionable information about where to obtain additional guarantee templates. Type-Specific Criteria: It functions as an informational point, directing users to a specific department for resources, which aligns with the 'OTHER' type and 'INFO' subtype. Utility Check: This information is highly useful for internal Zebracorp personnel and potentially for suppliers, ensuring the correct legal templates are used and streamlining the documentation process. Therefore, it is a valid and valuable finding.",
      "decision_confidence": 1.0,
      "source_cluster_id": "3840ae6e-7681-4eb7-a9ae-69fc5fe0660d",
      "supporting_evidence": [
        "0776310d-76b9-4b33-bfa0-33a78edb818c",
        "8d93256e-de58-478b-9d97-d37dd5d9b26d"
      ]
    }
  ],
  "clusters": [
    {
      "id": "698b2819-deb3-4747-bea6-00fb5c94b21e",
      "recommendation_ids": [
        "493193b6-30c5-4f14-8801-29e6f9f9af3c",
        "09483bc0-c098-490f-bbf0-7e7fe20480c5",
        "79740dd8-3580-401c-a272-be6ee08587e4",
        "5995f287-8fb7-4000-8b72-7565331ff3d6"
      ]
    },
    {
      "id": "6ce2254d-7655-4706-bac5-3bf25166f99b",
      "recommendation_ids": [
        "54b643d6-4c4b-439e-bab5-86b5f6e96bf6",
        "1f552692-bd84-46dd-83d4-7d76138f082b",
        "ec497144-5451-4c7b-a0d4-12310a8b8d6d"
      ]
    },
    {
      "id": "98deaf73-53f0-4c37-be3f-5c9866e7bb28",
      "recommendation_ids": [
        "00f3aacf-a2c4-4e7a-98c9-3812b05d1def",
        "16a9550f-ef17-473e-b310-375d38ccb01c",
        "f05ea914-74eb-488e-90d7-1fc6dc7fab98",
        "ff2f1287-0770-4024-8f3b-ab29e2329ccb"
      ]
    },
    {
      "id": "e7ed695e-95d0-4b05-9db8-0582e6d4685a",
      "recommendation_ids": [
        "bed5cf93-2fda-4b40-b10e-28026563b989",
        "41089495-9692-4406-9e8f-7933ef80700c",
        "44a52dad-69cc-47f2-be12-f3e73c322ba9"
      ]
    },
    {
      "id": "2438b06f-ff77-46e0-9f63-c27ac8d2915c",
      "recommendation_ids": [
        "bdfdc974-9e5d-4b5d-a153-28cd9f36012f",
        "86098dad-4c66-4e09-bd7b-101ebf3d6b58",
        "d4ebd81f-0c8c-4dc9-b855-1aae27079554",
        "c21c128a-09d1-46a1-8f39-4ae160b08272"
      ]
    },
    {
      "id": "79c410a9-4529-4ba6-b4b7-808275c3d0a4",
      "recommendation_ids": [
        "0313343b-bc05-4dc7-ba77-ad1f18e38ec8",
        "42062ce0-d8d9-43d8-b678-132d724aa666",
        "7c83849d-de09-4146-8c4e-0e592dc38ceb"
      ]
    },
    {
      "id": "f3bcf46f-29ad-4177-93f0-6af5f088927e",
      "recommendation_ids": [
        "b55ba9a7-0026-4d83-9bdb-fcb5f99fac49",
        "95954190-9b18-4d6c-9e41-4ce9d0641019",
        "d1d41fb6-76c1-4548-97fb-40d402b01fb2",
        "f0acdcb6-7ce2-4ff0-93ff-4a19a0e1991e"
      ]
    },
    {
      "id": "37441185-8722-4480-8cef-c4801979688f",
      "recommendation_ids": [
        "895ee014-8e0f-491b-aa42-cc7801d40d51",
        "8123e3fd-c619-4c6d-b6c1-02714d3951fa",
        "0e1eea53-91fb-4c42-a218-16c32411e9c1"
      ]
    },
    {
      "id": "13bf5a10-3f54-40c4-b377-24824c1e6340",
      "recommendation_ids": [
        "61c5c3ea-6b7a-4e11-a467-fbac66956e17",
        "32d04638-72f7-416b-b539-599e479c49b3",
        "afddceff-42e0-4932-9565-e4d6aa1ee154",
        "b281aa28-bf19-4a8d-86bd-952e753e7a07"
      ]
    },
    {
      "id": "36811cb2-406a-4000-8422-589a83488c6c",
      "recommendation_ids": [
        "2d0241e0-5c08-4ae2-a32a-f749105322cf",
        "5ba742c4-2a7f-4b25-bb2f-8f7df632a2ab",
        "e410cf15-7535-418f-858c-724b82492dac",
        "d970e349-8f45-4c73-9ed2-5f00f090af9f"
      ]
    },
    {
      "id": "bf38abad-f066-42ba-b113-ba3b543dbc77",
      "recommendation_ids": [
        "5b673ca1-1264-49c8-98ee-ea8984160187",
        "2b88a140-45ce-4000-9d13-ddc23eef4370",
        "7efab50a-cac4-462c-a358-4693570e91fb"
      ]
    },
    {
      "id": "61073746-c7fd-419e-8cfa-7e3edc94fd4d",
      "recommendation_ids": [
        "c28431a6-304e-46d5-90f7-16bae1defb77",
        "8b4070e5-b428-47e4-9c36-e1643ad43d82",
        "72467852-ba4e-469d-9f5f-a2f2cadad41d",
        "1d53ba40-ead9-4ada-806b-e3c33ea61229"
      ]
    },
    {
      "id": "8f2c9aa1-f67a-4dd3-b38b-21e657d944f2",
      "recommendation_ids": [
        "220cfb37-2758-4af0-a7ad-7d2f49846184",
        "ea2d5acd-f119-4880-a06d-0d35ccd24d3a",
        "e965cb59-4acd-4b00-90c5-9545b0036d4c"
      ]
    },
    {
      "id": "a9d7b324-35c8-46eb-bea7-58689c78c42a",
      "recommendation_ids": [
        "975df24c-0f19-4f62-9f9f-e54c9874761c",
        "b28de089-23ee-44d8-96d4-bb39e7820e7e",
        "8fcbc2c9-ce04-437b-8e54-ee4cb0f41b84",
        "35850ddb-396d-481a-9a84-3184ae3f5c2e"
      ]
    },
    {
      "id": "6fcb4af1-9963-4ed4-8c49-15eea9547203",
      "recommendation_ids": [
        "3e81c197-e3a5-4643-922c-79c3bbbf7885",
        "74369bd2-cada-4afa-9876-419656342545",
        "d0604908-026e-44c3-85c0-653daddbd736",
        "720efcfe-25bc-43cd-87c2-9e8d287ca255"
      ]
    },
    {
      "id": "5c8a1cd8-8d09-4556-bda3-309661ced1ec",
      "recommendation_ids": [
        "d0703a35-d529-4c8e-abea-3587bd4a870a",
        "92ceade9-9f75-4412-8fee-258ef9011b57",
        "f07dd916-0748-4835-9c04-3e828f2013b6",
        "b3a31c12-d16e-48a9-ad5c-73cee9cbe38c"
      ]
    },
    {
      "id": "57c0320e-70d4-4f87-a669-80422ed3cf0b",
      "recommendation_ids": [
        "a167b8bf-172a-44a4-b55c-051a1ef82ab4",
        "bc78bc88-97df-48f4-aca1-62d24b77276e",
        "3acbbec4-871b-480f-8cbb-e1bfcbf207c9"
      ]
    },
    {
      "id": "b3a6cc5c-3a91-4d85-8d15-3be8907d47e0",
      "recommendation_ids": [
        "66bfb1d1-46ae-48d8-82c6-6730ec7ee300",
        "6057d7e5-336c-412f-9a3b-a3dca91004a4",
        "cbd11c24-3816-4c8f-995a-e3190077b0c8"
      ]
    },
    {
      "id": "e259cd84-21e4-4ba9-84d3-6f1ed774ce01",
      "recommendation_ids": [
        "5f41e1ae-3744-4e93-ae6f-ec005485c294",
        "cbfa3e87-b45c-440c-8792-d135f6fa39bf"
      ]
    },
    {
      "id": "964a4a66-7e29-4f36-90fc-077f0e695103",
      "recommendation_ids": [
        "ca28389c-2062-40d0-ac3e-5187a0f0efe1",
        "b2161d50-06d7-4f91-888d-6f93f4c5126d"
      ]
    },
    {
      "id": "d374bfb0-b494-46e6-93e7-5b9707dab8b9",
      "recommendation_ids": [
        "29cf0c8c-0ccf-49a9-94c0-2e8291131859",
        "384767c5-dfe4-4a5e-86c6-7be18e5a0b84"
      ]
    },
    {
      "id": "3840ae6e-7681-4eb7-a9ae-69fc5fe0660d",
      "recommendation_ids": [
        "0776310d-76b9-4b33-bfa0-33a78edb818c",
        "8d93256e-de58-478b-9d97-d37dd5d9b26d"
      ]
    }
  ],
  "recommendations": [
    {
      "id": "493193b6-30c5-4f14-8801-29e6f9f9af3c",
      "content": {
        "id": "a1b2c3d4-e5f6-7890-1234-567890abcdef",
        "type": "GUIDELINE",
        "classification": "CRITICAL",
        "verbatim_text": "the main rule is that Zebracorp does not give guarantees to our suppliers to guarantee Zebracorp´s payments.",
        "plain_text": "Zebracorp's primary policy is not to provide guarantees to suppliers for Zebracorp's payments.",
        "expert_insight": "This is a fundamental risk management principle for Zebracorp, aiming to limit its financial liabilities and maintain a strong balance sheet. It shifts the credit risk assessment entirely to the supplier.",
        "confidence": 1.0,
        "conditions": "None, this is the main rule.",
        "justification": "Explicitly stated as 'the main rule' and uses 'does not give', indicating a strict prohibition.",
        "implication_company": "Zebracorp avoids increasing its financial liabilities and maintains a conservative financial posture.",
        "implication_supplier": "Suppliers cannot expect payment guarantees from Zebracorp and must conduct their own credit risk assessments on Zebracorp.",
        "source_insight": "The text provides the rationale that guarantees would need to be recorded in financial accounts and increase liabilities.",
        "text": "the main rule is that Zebracorp does not give guarantees to our suppliers to guarantee Zebracorp´s payments."
      },
      "source_agent": "AGENT_1",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "Senior Legal Counsel (Guidelines)",
        "model": "gemini-2.5-flash",
        "temperature": 0.0,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_1_prompt.txt"
      }
    },
    {
      "id": "54b643d6-4c4b-439e-bab5-86b5f6e96bf6",
      "content": {
        "id": "b2c3d4e5-f6a7-8901-2345-67890abcdef0",
        "type": "GUIDELINE",
        "classification": "CRITICAL",
        "verbatim_text": "This applies to bank guarantees, Letters of Credit and other such external guarantees as well as parent company guarantees.",
        "plain_text": "The policy of not providing guarantees covers all types of guarantees, including bank guarantees, Letters of Credit, and parent company guarantees.",
        "expert_insight": "This clarifies the comprehensive scope of Zebracorp's no-guarantee policy, ensuring no loopholes for different guarantee types.",
        "confidence": 1.0,
        "conditions": "Applies to the main rule of Zebracorp not giving guarantees.",
        "justification": "Directly extends the scope of the 'CRITICAL' main rule.",
        "implication_company": "Ensures consistent application of the no-guarantee policy across all financial instruments.",
        "implication_supplier": "Confirms that no form of Zebracorp guarantee will be provided for payment security.",
        "source_insight": "Explicitly lists the types of guarantees covered by the main rule.",
        "text": "This applies to bank guarantees, Letters of Credit and other such external guarantees as well as parent company guarantees."
      },
      "source_agent": "AGENT_1",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "Senior Legal Counsel (Guidelines)",
        "model": "gemini-2.5-flash",
        "temperature": 0.0,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_1_prompt.txt"
      }
    },
    {
      "id": "00f3aacf-a2c4-4e7a-98c9-3812b05d1def",
      "content": {
        "id": "c3d4e5f6-a7b8-9012-3456-7890abcdef01",
        "type": "GUIDELINE",
        "classification": "CRITICAL",
        "verbatim_text": "Any exceptions to this will need to be handled as per Zebracorp Group Guarantee SOP and must be agreed with Zebracorp Global Guarantee Center.",
        "plain_text": "Any exceptions to Zebracorp's no-guarantee policy must follow the Zebracorp Group Guarantee SOP and require agreement from the Zebracorp Global Guarantee Center.",
        "expert_insight": "This establishes a stringent, centralized control mechanism for any deviation from the core policy, highlighting the high risk associated with issuing guarantees.",
        "confidence": 1.0,
        "conditions": "If an exception to the no-guarantee policy is considered.",
        "justification": "Uses 'will need to be handled' and 'must be agreed', indicating mandatory compliance and high-level approval.",
        "implication_company": "Ensures strict governance and centralized oversight for any guarantee issuance, mitigating financial risk.",
        "implication_supplier": "Exceptions are extremely difficult to obtain and require significant internal Zebracorp process.",
        "source_insight": "Emphasizes the formal process and specific approval authority required for exceptions.",
        "text": "Any exceptions to this will need to be handled as per Zebracorp Group Guarantee SOP and must be agreed with Zebracorp Global Guarantee Center."
      },
      "source_agent": "AGENT_1",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "Senior Legal Counsel (Guidelines)",
        "model": "gemini-2.5-flash",
        "temperature": 0.0,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_1_prompt.txt"
      }
    },
    {
      "id": "bed5cf93-2fda-4b40-b10e-28026563b989",
      "content": {
        "id": "d4e5f6a7-b8c9-0123-4567-890abcdef012",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "In the event Zebracorp makes any advance payment or other prepayments to the supplier, Zebracorp may require a so called advance payment guarantee as a security from the supplier.",
        "plain_text": "Zebracorp reserves the right to require an advance payment guarantee from a supplier when making advance payments or prepayments.",
        "expert_insight": "This is a crucial risk mitigation right for Zebracorp, protecting its financial interests in cases where it provides funds upfront to a supplier.",
        "confidence": 1.0,
        "conditions": "If Zebracorp makes advance payments or prepayments to a supplier.",
        "justification": "Uses 'may require', indicating a discretionary right that is strategically important for financial security.",
        "implication_company": "Zebracorp has a mechanism to secure its prepayments, reducing financial exposure.",
        "implication_supplier": "Suppliers receiving advance payments may be obligated to provide an advance payment guarantee.",
        "source_insight": "The text frames this as a security measure for Zebracorp.",
        "text": "In the event Zebracorp makes any advance payment or other prepayments to the supplier, Zebracorp may require a so called advance payment guarantee as a security from the supplier."
      },
      "source_agent": "AGENT_1",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "Senior Legal Counsel (Guidelines)",
        "model": "gemini-2.5-flash",
        "temperature": 0.0,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_1_prompt.txt"
      }
    },
    {
      "id": "bdfdc974-9e5d-4b5d-a153-28cd9f36012f",
      "content": {
        "id": "e5f6a7b8-c9d0-1234-5678-90abcdef0123",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "The need for such advance payment guarantee depends on the value of the prepayment as well as other factors, and is ultimately decided by Procurement with F&C consultation.",
        "plain_text": "The decision to require an advance payment guarantee is made by Zebracorp's Procurement department, in consultation with Finance & Control (F&C), based on prepayment value and other factors.",
        "expert_insight": "This outlines the internal decision-making process, ensuring that the requirement for a guarantee is not arbitrary but based on a considered assessment involving relevant departments.",
        "confidence": 1.0,
        "conditions": "When considering an advance payment guarantee.",
        "justification": "Describes a mandatory internal process for a 'HIGH' impact decision.",
        "implication_company": "Ensures a structured and informed decision-making process for requesting advance payment guarantees.",
        "implication_supplier": "The decision is internal to Zebracorp, but the supplier should be aware of the factors influencing it.",
        "source_insight": "Highlights the involvement of specific departments (Procurement, F&C) in the decision.",
        "text": "The need for such advance payment guarantee depends on the value of the prepayment as well as other factors, and is ultimately decided by Procurement with F&C consultation."
      },
      "source_agent": "AGENT_1",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "Senior Legal Counsel (Guidelines)",
        "model": "gemini-2.5-flash",
        "temperature": 0.0,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_1_prompt.txt"
      }
    },
    {
      "id": "0313343b-bc05-4dc7-ba77-ad1f18e38ec8",
      "content": {
        "id": "f6a7b8c9-d0e1-2345-6789-0abcdef01234",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "Zebracorp may also from time to time require performance bonds or guarantees from certain of its subcontractors in particular for key customer projects where the customer of Zebracorp is requesting such guarantees, or where such guarantee is otherwise found to be necessary in order to secure the performance of subcontractor’s obligations.",
        "plain_text": "Zebracorp may require performance bonds or guarantees from subcontractors, especially for key customer projects or when necessary to secure subcontractor performance.",
        "expert_insight": "This provides Zebracorp with a critical tool to manage performance risk, particularly when its own customer contracts demand such security or when subcontractor performance is vital.",
        "confidence": 1.0,
        "conditions": "For certain subcontractors, key customer projects, or when necessary to secure subcontractor performance.",
        "justification": "Uses 'may require', indicating a discretionary right that is strategically important for project and performance security.",
        "implication_company": "Zebracorp can mitigate performance risks from subcontractors, especially in critical projects.",
        "implication_supplier": "Subcontractors may be required to provide performance bonds or guarantees.",
        "source_insight": "Provides specific scenarios (key customer projects, securing obligations) where this right would be exercised.",
        "text": "Zebracorp may also from time to time require performance bonds or guarantees from certain of its subcontractors in particular for key customer projects where the customer of Zebracorp is requesting such guarantees, or where such guarantee is otherwise found to be necessary in order to secure the performance of subcontractor’s obligations."
      },
      "source_agent": "AGENT_1",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "Senior Legal Counsel (Guidelines)",
        "model": "gemini-2.5-flash",
        "temperature": 0.0,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_1_prompt.txt"
      }
    },
    {
      "id": "b55ba9a7-0026-4d83-9bdb-fcb5f99fac49",
      "content": {
        "id": "a7b8c9d0-e1f2-3456-7890-abcdef012345",
        "type": "GUIDELINE",
        "classification": "CRITICAL",
        "verbatim_text": "Any guarantee to be issued in favor of Zebracorp must be from an international bank acceptable to Zebracorp.",
        "plain_text": "All guarantees provided to Zebracorp must originate from an international bank that is acceptable to Zebracorp.",
        "expert_insight": "This ensures the reliability and enforceability of guarantees by specifying the source (international bank) and retaining Zebracorp's right to approve the specific institution.",
        "confidence": 1.0,
        "conditions": "For any guarantee issued in favor of Zebracorp.",
        "justification": "Uses 'must be from', indicating a mandatory requirement for the source of the guarantee.",
        "implication_company": "Zebracorp ensures the quality and international standing of its guarantors.",
        "implication_supplier": "Suppliers are restricted to using international banks acceptable to Zebracorp for guarantees.",
        "source_insight": "Highlights both the 'international bank' and 'acceptable to Zebracorp' criteria.",
        "text": "Any guarantee to be issued in favor of Zebracorp must be from an international bank acceptable to Zebracorp."
      },
      "source_agent": "AGENT_1",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "Senior Legal Counsel (Guidelines)",
        "model": "gemini-2.5-flash",
        "temperature": 0.0,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_1_prompt.txt"
      }
    },
    {
      "id": "895ee014-8e0f-491b-aa42-cc7801d40d51",
      "content": {
        "id": "b8c9d0e1-f2a3-4567-8901-abcdef012346",
        "type": "GUIDELINE",
        "classification": "CRITICAL",
        "verbatim_text": "Bank rating should be investment grade (BBB-) at minimum.",
        "plain_text": "Banks providing guarantees to Zebracorp must have a minimum investment grade rating of BBB-.",
        "expert_insight": "This sets a clear financial threshold for guarantor banks, protecting Zebracorp from counterparty risk by ensuring the guarantor's financial stability.",
        "confidence": 1.0,
        "conditions": "For banks providing guarantees to Zebracorp.",
        "justification": "Uses 'should be... at minimum', which in a legal context for financial instruments implies a mandatory floor.",
        "implication_company": "Zebracorp minimizes the risk of guarantor default by requiring a strong credit rating.",
        "implication_supplier": "Suppliers must ensure their chosen bank meets Zebracorp's minimum credit rating requirement.",
        "source_insight": "Specifies the exact minimum rating (BBB-).",
        "text": "Bank rating should be investment grade (BBB-) at minimum."
      },
      "source_agent": "AGENT_1",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "Senior Legal Counsel (Guidelines)",
        "model": "gemini-2.5-flash",
        "temperature": 0.0,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_1_prompt.txt"
      }
    },
    {
      "id": "61c5c3ea-6b7a-4e11-a467-fbac66956e17",
      "content": {
        "id": "c9d0e1f2-a3b4-5678-9012-abcdef012347",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "For this reason, the benefits of requesting supplier guarantees must be carefully assessed.",
        "plain_text": "Zebracorp must carefully assess the benefits of requesting supplier guarantees, considering potential indirect costs.",
        "expert_insight": "This is an important internal control, ensuring that the cost-benefit of demanding a guarantee is always evaluated, preventing unnecessary expenses that might be passed back to Zebracorp.",
        "confidence": 1.0,
        "conditions": "When considering requesting supplier guarantees.",
        "justification": "Uses 'must be carefully assessed', indicating a mandatory internal due diligence process.",
        "implication_company": "Zebracorp avoids unnecessary costs by evaluating the true benefit of guarantees.",
        "implication_supplier": "Guarantees are not automatically requested; Zebracorp performs an internal assessment.",
        "source_insight": "The preceding sentence explains that financial institution guarantees carry a charge, which is often passed on to Zebracorp.",
        "text": "For this reason, the benefits of requesting supplier guarantees must be carefully assessed."
      },
      "source_agent": "AGENT_1",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "Senior Legal Counsel (Guidelines)",
        "model": "gemini-2.5-flash",
        "temperature": 0.0,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_1_prompt.txt"
      }
    },
    {
      "id": "2d0241e0-5c08-4ae2-a32a-f749105322cf",
      "content": {
        "id": "d0e1f2a3-b4c5-6789-0123-abcdef012348",
        "type": "GUIDELINE",
        "classification": "CRITICAL",
        "verbatim_text": "When using a corporate/parent company guarantees, it should however be noted that these are acceptable only if the credit rating of the issuing parent entity is BBB- at minimum.",
        "plain_text": "Corporate or parent company guarantees are only acceptable if the issuing parent entity has a minimum credit rating of BBB-.",
        "expert_insight": "This extends the critical creditworthiness requirement from banks to parent companies, ensuring that any corporate guarantor also possesses sufficient financial strength.",
        "confidence": 1.0,
        "conditions": "When considering corporate/parent company guarantees.",
        "justification": "Uses 'acceptable only if... at minimum', establishing a strict, mandatory condition.",
        "implication_company": "Zebracorp ensures the financial stability of corporate/parent company guarantors.",
        "implication_supplier": "Parent companies providing guarantees must meet Zebracorp's minimum credit rating requirement.",
        "source_insight": "Directly parallels the bank rating requirement, emphasizing its importance.",
        "text": "When using a corporate/parent company guarantees, it should however be noted that these are acceptable only if the credit rating of the issuing parent entity is BBB- at minimum."
      },
      "source_agent": "AGENT_1",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "Senior Legal Counsel (Guidelines)",
        "model": "gemini-2.5-flash",
        "temperature": 0.0,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_1_prompt.txt"
      }
    },
    {
      "id": "5b673ca1-1264-49c8-98ee-ea8984160187",
      "content": {
        "id": "e1f2a3b4-c5d6-7890-1234-abcdef012349",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "Also, for corporate/parent company guarantees Zebracorp´s model guarantee wordings should be used.",
        "plain_text": "Zebracorp's model guarantee wordings should be used for all corporate and parent company guarantees.",
        "expert_insight": "Standardizing guarantee wordings is crucial for legal consistency, enforceability, and efficient processing, reducing legal risk for Zebracorp.",
        "confidence": 1.0,
        "conditions": "For corporate/parent company guarantees.",
        "justification": "Uses 'should be used', indicating a strong preference and standard practice for legal consistency.",
        "implication_company": "Ensures legal consistency and enforceability of corporate/parent company guarantees.",
        "implication_supplier": "Suppliers must use Zebracorp's standard templates for corporate/parent company guarantees.",
        "source_insight": "Implies the existence of pre-approved legal templates for these guarantees.",
        "text": "Also, for corporate/parent company guarantees Zebracorp´s model guarantee wordings should be used."
      },
      "source_agent": "AGENT_1",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "Senior Legal Counsel (Guidelines)",
        "model": "gemini-2.5-flash",
        "temperature": 0.0,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_1_prompt.txt"
      }
    },
    {
      "id": "c28431a6-304e-46d5-90f7-16bae1defb77",
      "content": {
        "id": "f2a3b4c5-d6e7-8901-2345-abcdef012350",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "The corporate/parent company guarantee should be under same applicable law as the supply agreement which is generally New York law.",
        "plain_text": "Corporate/parent company guarantees should be governed by the same applicable law as the supply agreement, typically New York law.",
        "expert_insight": "This ensures legal coherence and simplifies dispute resolution by avoiding conflicts of law between the main contract and the guarantee.",
        "confidence": 1.0,
        "conditions": "For corporate/parent company guarantees.",
        "justification": "Uses 'should be under', indicating a strong preference for legal consistency to avoid complications.",
        "implication_company": "Simplifies legal enforcement and interpretation by aligning governing laws.",
        "implication_supplier": "Guarantees must align with the governing law of the supply agreement.",
        "source_insight": "Specifies New York law as the general preference for supply agreements.",
        "text": "The corporate/parent company guarantee should be under same applicable law as the supply agreement which is generally New York law."
      },
      "source_agent": "AGENT_1",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "Senior Legal Counsel (Guidelines)",
        "model": "gemini-2.5-flash",
        "temperature": 0.0,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_1_prompt.txt"
      }
    },
    {
      "id": "220cfb37-2758-4af0-a7ad-7d2f49846184",
      "content": {
        "id": "a3b4c5d6-e7f8-9012-3456-abcdef012351",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "Other governing law provisions should be cleared with Legal and Compliance or Finance.",
        "plain_text": "Any deviations from the preferred governing law for guarantees must be approved by Zebracorp's Legal and Compliance or Finance departments.",
        "expert_insight": "This establishes a mandatory internal review process for any non-standard governing law, protecting Zebracorp from unforeseen legal complexities.",
        "confidence": 1.0,
        "conditions": "If governing law provisions other than the standard are proposed.",
        "justification": "Uses 'should be cleared', indicating a mandatory internal approval process for deviations from a 'HIGH' impact rule.",
        "implication_company": "Ensures legal and financial review of non-standard governing law provisions, mitigating risk.",
        "implication_supplier": "Deviations from standard governing law require internal Zebracorp approval.",
        "source_insight": "Highlights the specific departments responsible for clearing such deviations.",
        "text": "Other governing law provisions should be cleared with Legal and Compliance or Finance."
      },
      "source_agent": "AGENT_1",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "Senior Legal Counsel (Guidelines)",
        "model": "gemini-2.5-flash",
        "temperature": 0.0,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_1_prompt.txt"
      }
    },
    {
      "id": "975df24c-0f19-4f62-9f9f-e54c9874761c",
      "content": {
        "id": "b4c5d6e7-f8a9-0123-4567-abcdef012352",
        "type": "GUIDELINE",
        "classification": "CRITICAL",
        "verbatim_text": "As for bank guarantees/performance bonds, Zebracorp should only accept so called on-demand guarantees or stand-by Letters of Credit.",
        "plain_text": "Zebracorp will only accept on-demand guarantees or stand-by Letters of Credit for bank guarantees and performance bonds.",
        "expert_insight": "This is a critical requirement for enforceability. On-demand guarantees are much easier to call upon, providing Zebracorp with immediate access to funds without needing to prove default in court.",
        "confidence": 1.0,
        "conditions": "For bank guarantees and performance bonds.",
        "justification": "Uses 'should only accept', which in this context implies a strict, mandatory requirement for the type of guarantee due to enforceability.",
        "implication_company": "Zebracorp ensures maximum enforceability and ease of calling upon guarantees.",
        "implication_supplier": "Suppliers must provide specific types of guarantees (on-demand or stand-by L/C).",
        "source_insight": "Explicitly names the preferred types of guarantees for their enforceability.",
        "text": "As for bank guarantees/performance bonds, Zebracorp should only accept so called on-demand guarantees or stand-by Letters of Credit."
      },
      "source_agent": "AGENT_1",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "Senior Legal Counsel (Guidelines)",
        "model": "gemini-2.5-flash",
        "temperature": 0.0,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_1_prompt.txt"
      }
    },
    {
      "id": "3e81c197-e3a5-4643-922c-79c3bbbf7885",
      "content": {
        "id": "c5d6e7f8-a9b0-1234-5678-abcdef012353",
        "type": "GUIDELINE",
        "classification": "CRITICAL",
        "verbatim_text": "Any deviations to these templates would need to be approved by Zebracorp Global Guarantee Center and/or Zebracorp Finance Legal.",
        "plain_text": "Any deviations from Zebracorp's guarantee templates must be approved by the Zebracorp Global Guarantee Center and/or Zebracorp Finance Legal.",
        "expert_insight": "This ensures strict control over the legal wording of guarantees, preventing the introduction of unfavorable terms or ambiguities that could compromise Zebracorp's rights.",
        "confidence": 1.0,
        "conditions": "If there are deviations from Zebracorp's guarantee templates.",
        "justification": "Uses 'would need to be approved', indicating a mandatory, high-level approval process for any changes to standard legal documents.",
        "implication_company": "Zebracorp maintains control over the legal terms of guarantees, mitigating legal risk.",
        "implication_supplier": "Deviations from Zebracorp's templates require significant internal approval from Zebracorp.",
        "source_insight": "Highlights the specific departments responsible for approving template deviations.",
        "text": "Any deviations to these templates would need to be approved by Zebracorp Global Guarantee Center and/or Zebracorp Finance Legal."
      },
      "source_agent": "AGENT_1",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "Senior Legal Counsel (Guidelines)",
        "model": "gemini-2.5-flash",
        "temperature": 0.0,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_1_prompt.txt"
      }
    },
    {
      "id": "d0703a35-d529-4c8e-abea-3587bd4a870a",
      "content": {
        "id": "d6e7f8a9-b0c1-2345-6789-abcdef012354",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "Final guarantee documentation should be delivered to Zebracorp Global Guarantee Center which will keep track on existing guarantees and which will store the guarantees.",
        "plain_text": "Final guarantee documentation must be delivered to the Zebracorp Global Guarantee Center for tracking and storage.",
        "expert_insight": "This establishes a centralized repository and management process for all guarantees, which is essential for effective risk management, compliance, and timely action (e.g., calling on a guarantee or managing expiry dates).",
        "confidence": 1.0,
        "conditions": "Upon finalization of guarantee documentation.",
        "justification": "Uses 'should be delivered', indicating a mandatory internal process for critical document management.",
        "implication_company": "Ensures centralized management, tracking, and secure storage of all guarantees, improving risk oversight.",
        "implication_supplier": "Suppliers need to ensure final documentation is correctly submitted to Zebracorp's Global Guarantee Center.",
        "source_insight": "Explains the purpose of delivery: tracking and storage.",
        "text": "Final guarantee documentation should be delivered to Zebracorp Global Guarantee Center which will keep track on existing guarantees and which will store the guarantees."
      },
      "source_agent": "AGENT_1",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "Senior Legal Counsel (Guidelines)",
        "model": "gemini-2.5-flash",
        "temperature": 0.0,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_1_prompt.txt"
      }
    },
    {
      "id": "a167b8bf-172a-44a4-b55c-051a1ef82ab4",
      "content": {
        "id": "a1b2c3d4-e5f6-7890-1234-567890abcdef",
        "type": "OTHER",
        "verbatim_text": "Zebracorp is generally relying on its suppliers having conducted necessary credit risk assessments on Zebracorp contracting entity and having satisfied itself as to the creditworthiness of Zebracorp.",
        "plain_text": "Zebracorp expects suppliers to conduct their own credit risk assessments on Zebracorp's contracting entity.",
        "expert_insight": "This statement establishes Zebracorp's default position, shifting the burden of due diligence regarding Zebracorp's creditworthiness onto the supplier. It implicitly reduces Zebracorp's perceived need to provide guarantees.",
        "confidence": 0.95,
        "subtype": "INFO",
        "justification": "Provides background information on Zebracorp's expectation from suppliers regarding credit checks.",
        "implication_company": "Reduces the internal pressure to provide guarantees by setting an expectation for supplier due diligence.",
        "implication_supplier": "Suppliers must perform their own credit risk assessments on Zebracorp and cannot rely on Zebracorp providing guarantees.",
        "source_insight": "Highlights Zebracorp's proactive stance in managing its own financial obligations and risk exposure.",
        "text": "Zebracorp is generally relying on its suppliers having conducted necessary credit risk assessments on Zebracorp contracting entity and having satisfied itself as to the creditworthiness of Zebracorp."
      },
      "source_agent": "AGENT_2",
      "confidence": 0.95,
      "config_snapshot": {
        "name": "Strategic Advisor (Context)",
        "model": "gemini-2.5-flash",
        "temperature": 0.2,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_2_prompt.txt"
      }
    },
    {
      "id": "66bfb1d1-46ae-48d8-82c6-6730ec7ee300",
      "content": {
        "id": "b2c3d4e5-f6a7-8901-2345-67890abcdef0",
        "type": "OTHER",
        "verbatim_text": "Any guarantee issued by Zebracorp would need to recorded in our financial accounts and would increase our financial liabilities.",
        "plain_text": "Issuing guarantees increases Zebracorp's financial liabilities and requires formal recording in financial accounts.",
        "expert_insight": "This explains the internal financial impact of issuing guarantees, providing a strong rationale for Zebracorp's reluctance to do so. It's a key internal constraint.",
        "confidence": 0.95,
        "subtype": "INFO",
        "justification": "Explains the financial implications for Zebracorp when issuing guarantees.",
        "implication_company": "Reinforces the financial reasons for Zebracorp's policy of not issuing guarantees.",
        "implication_supplier": "Helps suppliers understand Zebracorp's internal financial constraints and why guarantees are difficult to obtain.",
        "source_insight": "This is a factual statement about accounting and financial reporting, underpinning the strategic policy.",
        "text": "Any guarantee issued by Zebracorp would need to recorded in our financial accounts and would increase our financial liabilities."
      },
      "source_agent": "AGENT_2",
      "confidence": 0.95,
      "config_snapshot": {
        "name": "Strategic Advisor (Context)",
        "model": "gemini-2.5-flash",
        "temperature": 0.2,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_2_prompt.txt"
      }
    },
    {
      "id": "09483bc0-c098-490f-bbf0-7e7fe20480c5",
      "content": {
        "id": "c3d4e5f6-a7b8-9012-3456-7890abcdef01",
        "type": "OTHER",
        "verbatim_text": "For these reasons, the main rule is that Zebracorp does not give guarantees to our suppliers to guarantee Zebracorp´s payments.",
        "plain_text": "Zebracorp's primary policy is not to provide guarantees for its own payments to suppliers.",
        "expert_insight": "This is a core policy statement, establishing Zebracorp's default and strong negotiating position. It's a fundamental 'no' in most scenarios.",
        "confidence": 1.0,
        "subtype": "INFO",
        "justification": "States a fundamental policy of Zebracorp regarding guarantees.",
        "implication_company": "Provides a clear, strong default position to resist supplier requests for payment guarantees.",
        "implication_supplier": "Suppliers should not expect Zebracorp to provide payment guarantees, as this is against their main policy.",
        "source_insight": "This is the overarching principle derived from the preceding financial and operational considerations.",
        "text": "For these reasons, the main rule is that Zebracorp does not give guarantees to our suppliers to guarantee Zebracorp´s payments."
      },
      "source_agent": "AGENT_2",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "Strategic Advisor (Context)",
        "model": "gemini-2.5-flash",
        "temperature": 0.2,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_2_prompt.txt"
      }
    },
    {
      "id": "16a9550f-ef17-473e-b310-375d38ccb01c",
      "content": {
        "id": "d4e5f6a7-b8c9-0123-4567-890abcdef012",
        "type": "OTHER",
        "verbatim_text": "Any exceptions to this will need to be handled as per Zebracorp Group Guarantee SOP and must be agreed with Zebracorp Global Guarantee Center.",
        "plain_text": "Any exceptions to Zebracorp's 'no guarantee' policy require adherence to the Group Guarantee SOP and approval from the Global Guarantee Center.",
        "expert_insight": "This outlines a strict internal process for deviations, indicating a high bar for any exceptions. It signals that obtaining a guarantee from Zebracorp is a complex, high-level internal approval process.",
        "confidence": 1.0,
        "subtype": "INSTRUCTION",
        "justification": "Details the internal process and approval requirements for making exceptions to the guarantee policy.",
        "implication_company": "Ensures strict control and oversight for any deviations from the no-guarantee policy.",
        "implication_supplier": "Indicates that obtaining a guarantee from Zebracorp is a difficult and highly regulated process, requiring high-level internal Zebracorp approval.",
        "source_insight": "Emphasizes the bureaucratic hurdles involved, reinforcing the 'main rule' by making exceptions difficult.",
        "text": "Any exceptions to this will need to be handled as per Zebracorp Group Guarantee SOP and must be agreed with Zebracorp Global Guarantee Center."
      },
      "source_agent": "AGENT_2",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "Strategic Advisor (Context)",
        "model": "gemini-2.5-flash",
        "temperature": 0.2,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_2_prompt.txt"
      }
    },
    {
      "id": "86098dad-4c66-4e09-bd7b-101ebf3d6b58",
      "content": {
        "id": "e5f6a7b8-c9d0-1234-5678-90abcdef0123",
        "type": "OTHER",
        "verbatim_text": "The need for such advance payment guarantee depends on the value of the prepayment as well as other factors, and is ultimately decided by Procurement with F&C consultation.",
        "plain_text": "The decision to require an advance payment guarantee from a supplier is made by Procurement, considering prepayment value and other factors, with consultation from Finance & Control (F&C).",
        "expert_insight": "This defines the internal decision-making process and factors for requiring advance payment guarantees, indicating a risk-based and collaborative approach within Zebracorp.",
        "confidence": 0.95,
        "subtype": "INSTRUCTION",
        "justification": "Outlines the internal decision-making process for requiring advance payment guarantees from suppliers.",
        "implication_company": "Provides a clear internal process for assessing and deciding on advance payment guarantees, ensuring appropriate risk management.",
        "implication_supplier": "The requirement for an advance payment guarantee is not automatic and depends on Zebracorp's internal assessment, which may be influenced by negotiation.",
        "source_insight": "Highlights the inter-departmental collaboration (Procurement and F&C) in risk assessment.",
        "text": "The need for such advance payment guarantee depends on the value of the prepayment as well as other factors, and is ultimately decided by Procurement with F&C consultation."
      },
      "source_agent": "AGENT_2",
      "confidence": 0.95,
      "config_snapshot": {
        "name": "Strategic Advisor (Context)",
        "model": "gemini-2.5-flash",
        "temperature": 0.2,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_2_prompt.txt"
      }
    },
    {
      "id": "95954190-9b18-4d6c-9e41-4ce9d0641019",
      "content": {
        "id": "f6a7b8c9-d0e1-2345-6789-0abcdef01234",
        "type": "OTHER",
        "verbatim_text": "Any guarantee to be issued in favor of Zebracorp must be from an international bank acceptable to Zebracorp. Bank rating should be investment grade (BBB-) at minimum.",
        "plain_text": "Guarantees issued to Zebracorp must be from an international bank acceptable to Zebracorp, with a minimum investment grade (BBB-) credit rating.",
        "expert_insight": "This sets clear quality and reliability standards for banks providing guarantees to Zebracorp, ensuring the enforceability and value of the security received.",
        "confidence": 1.0,
        "subtype": "INSTRUCTION",
        "justification": "Specifies the mandatory requirements for banks issuing guarantees in favor of Zebracorp.",
        "implication_company": "Ensures the quality, reliability, and enforceability of received bank guarantees.",
        "implication_supplier": "Suppliers must ensure their chosen bank meets Zebracorp's criteria for international presence, acceptability, and minimum credit rating.",
        "source_insight": "These are non-negotiable technical requirements for the counterparty providing the guarantee.",
        "text": "Any guarantee to be issued in favor of Zebracorp must be from an international bank acceptable to Zebracorp. Bank rating should be investment grade (BBB-) at minimum."
      },
      "source_agent": "AGENT_2",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "Strategic Advisor (Context)",
        "model": "gemini-2.5-flash",
        "temperature": 0.2,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_2_prompt.txt"
      }
    },
    {
      "id": "32d04638-72f7-416b-b539-599e479c49b3",
      "content": {
        "id": "a7b8c9d0-e1f2-3456-7890-abcdef012345",
        "type": "OTHER",
        "verbatim_text": "A parent company guarantee may be preferred over a bank issued guarantee or bond due to the fact that guarantees/bonds issued by financial institutions carry a charge. This charge is often directly or indirectly passed on the prices paid by Zebracorp. For this reason, the benefits of requesting supplier guarantees must be carefully assessed.",
        "plain_text": "Zebracorp may prefer parent company guarantees over bank guarantees because bank guarantees incur charges that are often passed on to Zebracorp, necessitating a careful assessment of the benefits of requesting any supplier guarantee.",
        "expert_insight": "This is a clear negotiation tactic aimed at cost reduction. Zebracorp highlights the financial burden of bank guarantees to encourage suppliers to offer potentially cheaper parent company guarantees, while also emphasizing a cost-benefit analysis for all guarantee requests.",
        "confidence": 0.95,
        "subtype": "TACTIC",
        "justification": "Provides a strategic reason for preferring one type of guarantee over another, driven by cost implications, and advises a cost-benefit assessment.",
        "implication_company": "Potential for cost savings by encouraging parent company guarantees and a disciplined approach to requesting guarantees.",
        "implication_supplier": "Should be aware that Zebracorp may push for parent company guarantees to avoid bank charges, and that any guarantee request will be subject to Zebracorp's cost-benefit analysis.",
        "source_insight": "Combines a preference with its underlying financial rationale and an internal instruction for assessment.",
        "text": "A parent company guarantee may be preferred over a bank issued guarantee or bond due to the fact that guarantees/bonds issued by financial institutions carry a charge. This charge is often directly or indirectly passed on the prices paid by Zebracorp. For this reason, the benefits of requesting supplier guarantees must be carefully assessed."
      },
      "source_agent": "AGENT_2",
      "confidence": 0.95,
      "config_snapshot": {
        "name": "Strategic Advisor (Context)",
        "model": "gemini-2.5-flash",
        "temperature": 0.2,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_2_prompt.txt"
      }
    },
    {
      "id": "5ba742c4-2a7f-4b25-bb2f-8f7df632a2ab",
      "content": {
        "id": "b8c9d0e1-f2a3-4567-8901-234567890abc",
        "type": "OTHER",
        "verbatim_text": "When using a corporate/parent company guarantees, it should however be noted that these are acceptable only if the credit rating of the issuing parent entity is BBB- at minimum. Also, for corporate/parent company guarantees Zebracorp´s model guarantee wordings should be used.",
        "plain_text": "Corporate/parent company guarantees are acceptable only if the issuing entity has a minimum credit rating of BBB- and Zebracorp's model guarantee wordings are used.",
        "expert_insight": "This sets clear standards for parent company guarantees, mirroring the bank guarantee requirements for creditworthiness and ensuring legal consistency through standardized templates.",
        "confidence": 1.0,
        "subtype": "INSTRUCTION",
        "justification": "Specifies the mandatory requirements for accepting corporate/parent company guarantees.",
        "implication_company": "Ensures the financial strength of the parent company providing the guarantee and legal consistency through standardized wording.",
        "implication_supplier": "Parent companies must meet the minimum BBB- credit rating, and suppliers must use Zebracorp's specific legal wording for parent company guarantees.",
        "source_insight": "These are critical conditions for the validity and enforceability of parent company guarantees.",
        "text": "When using a corporate/parent company guarantees, it should however be noted that these are acceptable only if the credit rating of the issuing parent entity is BBB- at minimum. Also, for corporate/parent company guarantees Zebracorp´s model guarantee wordings should be used."
      },
      "source_agent": "AGENT_2",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "Strategic Advisor (Context)",
        "model": "gemini-2.5-flash",
        "temperature": 0.2,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_2_prompt.txt"
      }
    },
    {
      "id": "8b4070e5-b428-47e4-9c36-e1643ad43d82",
      "content": {
        "id": "c9d0e1f2-a3b4-5678-9012-34567890abcd",
        "type": "OTHER",
        "verbatim_text": "The corporate/parent company guarantee should be under same applicable law as the supply agreement which is generally New York law. Other governing law provisions should be cleared with Legal and Compliance or Finance.",
        "plain_text": "Corporate/parent company guarantees should generally be governed by New York law, matching the supply agreement. Any deviations require approval from Legal and Compliance or Finance.",
        "expert_insight": "This ensures legal consistency and simplifies enforcement by aligning governing laws. The requirement for internal approval for deviations indicates a strong preference for standard terms.",
        "confidence": 1.0,
        "subtype": "INSTRUCTION",
        "justification": "Provides guidance on the governing law for parent company guarantees and the process for deviations.",
        "implication_company": "Streamlines legal enforcement by maintaining consistent governing law and ensures legal review for non-standard clauses.",
        "implication_supplier": "Should expect New York law to govern parent company guarantees; deviations will require significant internal Zebracorp approval.",
        "source_insight": "This is a standard legal practice to avoid conflicts of law and simplify dispute resolution.",
        "text": "The corporate/parent company guarantee should be under same applicable law as the supply agreement which is generally New York law. Other governing law provisions should be cleared with Legal and Compliance or Finance."
      },
      "source_agent": "AGENT_2",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "Strategic Advisor (Context)",
        "model": "gemini-2.5-flash",
        "temperature": 0.2,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_2_prompt.txt"
      }
    },
    {
      "id": "b28de089-23ee-44d8-96d4-bb39e7820e7e",
      "content": {
        "id": "d0e1f2a3-b4c5-6789-0123-4567890abcde",
        "type": "OTHER",
        "verbatim_text": "As for bank guarantees/performance bonds, Zebracorp should only accept so called on-demand guarantees or stand-by Letters of Credit.",
        "plain_text": "For bank guarantees/performance bonds, Zebracorp will only accept on-demand guarantees or stand-by Letters of Credit.",
        "expert_insight": "This specifies the preferred and most robust types of bank guarantees, ensuring quick and unconditional payment to Zebracorp, maximizing enforceability.",
        "confidence": 1.0,
        "subtype": "INSTRUCTION",
        "justification": "States the specific types of bank guarantees Zebracorp will accept, indicating a preference for strong, easily enforceable instruments.",
        "implication_company": "Maximizes the enforceability and speed of payment from bank guarantees, reducing risk.",
        "implication_supplier": "Must provide on-demand guarantees or stand-by L/Cs, which are generally more costly and harder to obtain than conditional guarantees.",
        "source_insight": "This is a critical legal requirement for the quality and utility of the guarantee instrument.",
        "text": "As for bank guarantees/performance bonds, Zebracorp should only accept so called on-demand guarantees or stand-by Letters of Credit."
      },
      "source_agent": "AGENT_2",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "Strategic Advisor (Context)",
        "model": "gemini-2.5-flash",
        "temperature": 0.2,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_2_prompt.txt"
      }
    },
    {
      "id": "74369bd2-cada-4afa-9876-419656342545",
      "content": {
        "id": "e1f2a3b4-c5d6-7890-1234-567890abcdef",
        "type": "OTHER",
        "verbatim_text": "Other guarantee templates are available from Legal & Compliance. Any deviations to these templates would need to be approved by Zebracorp Global Guarantee Center and/or Zebracorp Finance Legal.",
        "plain_text": "Additional guarantee templates are available from Legal & Compliance, and any deviations from these templates require approval from the Global Guarantee Center and/or Finance Legal.",
        "expert_insight": "This points to internal resources for standardized legal documentation and establishes a strict internal approval process for any modifications, ensuring legal and financial oversight.",
        "confidence": 1.0,
        "subtype": "INSTRUCTION",
        "justification": "Provides information on the availability of templates and the strict approval process for any deviations.",
        "implication_company": "Centralized resource for legal templates and ensures legal/financial oversight for non-standard guarantee wording.",
        "implication_supplier": "Implies Zebracorp has standard templates for various guarantee types, and deviations will face significant internal scrutiny and approval hurdles.",
        "source_insight": "Reinforces Zebracorp's preference for standardized legal language to minimize risk.",
        "text": "Other guarantee templates are available from Legal & Compliance. Any deviations to these templates would need to be approved by Zebracorp Global Guarantee Center and/or Zebracorp Finance Legal."
      },
      "source_agent": "AGENT_2",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "Strategic Advisor (Context)",
        "model": "gemini-2.5-flash",
        "temperature": 0.2,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_2_prompt.txt"
      }
    },
    {
      "id": "92ceade9-9f75-4412-8fee-258ef9011b57",
      "content": {
        "id": "f2a3b4c5-d6e7-8901-2345-67890abcdef0",
        "type": "OTHER",
        "verbatim_text": "Final guarantee documentation should be delivered to Zebracorp Global Guarantee Center which will keep track on existing guarantees and which will store the guarantees.",
        "plain_text": "Final guarantee documents must be submitted to Zebracorp's Global Guarantee Center for tracking and storage.",
        "expert_insight": "This defines the final administrative step for managing received guarantees, ensuring proper record-keeping and centralized oversight.",
        "confidence": 1.0,
        "subtype": "INSTRUCTION",
        "justification": "Details the administrative process for handling final guarantee documentation.",
        "implication_company": "Ensures centralized management, tracking, and secure storage for all received guarantees.",
        "implication_supplier": "Needs to ensure final documentation is sent to the correct Zebracorp department to complete the process.",
        "source_insight": "This is an operational instruction for internal document management.",
        "text": "Final guarantee documentation should be delivered to Zebracorp Global Guarantee Center which will keep track on existing guarantees and which will store the guarantees."
      },
      "source_agent": "AGENT_2",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "Strategic Advisor (Context)",
        "model": "gemini-2.5-flash",
        "temperature": 0.2,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_2_prompt.txt"
      }
    },
    {
      "id": "bc78bc88-97df-48f4-aca1-62d24b77276e",
      "content": {
        "id": "2d1b11e2-b5e0-4c4f-9a0d-27d142079075",
        "type": "OTHER",
        "subtype": "INFO",
        "verbatim_text": "Zebracorp is generally relying on its suppliers having conducted necessary credit risk assessments on Zebracorp contracting entity and having satisfied itself as to the creditworthiness of Zebracorp.",
        "plain_text": "Zebracorp expects its suppliers to conduct their own credit risk assessments on Zebracorp's contracting entity and ensure its creditworthiness.",
        "expert_insight": "This statement clarifies Zebracorp's expectation that suppliers perform their due diligence regarding Zebracorp's financial standing, shifting the initial assessment burden to the supplier.",
        "confidence": 1.0,
        "justification": "N/A",
        "implication_company": "Zebracorp expects suppliers to perform their own credit risk assessments, reducing Zebracorp's need to proactively provide such assurances.",
        "implication_supplier": "Suppliers are expected to conduct credit risk assessments on Zebracorp before entering into agreements.",
        "source_insight": "N/A",
        "text": "Zebracorp is generally relying on its suppliers having conducted necessary credit risk assessments on Zebracorp contracting entity and having satisfied itself as to the creditworthiness of Zebracorp."
      },
      "source_agent": "AGENT_4",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout A",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_4_prompt.txt"
      }
    },
    {
      "id": "6057d7e5-336c-412f-9a3b-a3dca91004a4",
      "content": {
        "id": "b3e047f3-e51c-4b5a-939e-2f954f9a0d9e",
        "type": "OTHER",
        "subtype": "INFO",
        "verbatim_text": "Any guarantee issued by Zebracorp would need to recorded in our financial accounts and would increase our financial liabilities.",
        "plain_text": "Any guarantee issued by Zebracorp must be recorded in its financial accounts and will increase its financial liabilities.",
        "expert_insight": "This highlights the financial impact and accounting implications of issuing guarantees, explaining why Zebracorp is generally reluctant to provide them.",
        "confidence": 1.0,
        "justification": "N/A",
        "implication_company": "Issuing guarantees has direct financial accounting and liability implications for Zebracorp.",
        "implication_supplier": "N/A",
        "source_insight": "N/A",
        "text": "Any guarantee issued by Zebracorp would need to recorded in our financial accounts and would increase our financial liabilities."
      },
      "source_agent": "AGENT_4",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout A",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_4_prompt.txt"
      }
    },
    {
      "id": "79740dd8-3580-401c-a272-be6ee08587e4",
      "content": {
        "id": "e0b1a2c3-d4e5-4f6a-7b8c-9d0e1f2a3b4c",
        "type": "GUIDELINE",
        "classification": "CRITICAL",
        "verbatim_text": "For these reasons, the main rule is that Zebracorp does not give guarantees to our suppliers to guarantee Zebracorp´s payments.",
        "plain_text": "As a primary rule, Zebracorp does not provide guarantees to its suppliers for Zebracorp's payments.",
        "expert_insight": "This establishes a fundamental policy for Zebracorp, aiming to limit its financial liabilities and administrative burden associated with guarantees.",
        "confidence": 1.0,
        "conditions": "N/A",
        "justification": "Guarantees increase financial liabilities and require recording in financial accounts.",
        "implication_company": "Zebracorp avoids increasing its financial liabilities and administrative overhead by generally not issuing guarantees.",
        "implication_supplier": "Suppliers should not expect Zebracorp to provide guarantees for its payments.",
        "source_insight": "N/A",
        "text": "For these reasons, the main rule is that Zebracorp does not give guarantees to our suppliers to guarantee Zebracorp´s payments."
      },
      "source_agent": "AGENT_4",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout A",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_4_prompt.txt"
      }
    },
    {
      "id": "1f552692-bd84-46dd-83d4-7d76138f082b",
      "content": {
        "id": "f5e6d7c8-a9b0-41c2-5d6e-7f8a9b0c1d2e",
        "type": "OTHER",
        "subtype": "INFO",
        "verbatim_text": "This applies to bank guarantees, Letters of Credit and other such external guarantees as well as parent company guarantees.",
        "plain_text": "The policy of not giving guarantees covers all types, including bank guarantees, Letters of Credit, and parent company guarantees.",
        "expert_insight": "This clarifies the broad scope of Zebracorp's no-guarantee policy, ensuring that all forms of guarantees are included.",
        "confidence": 1.0,
        "justification": "N/A",
        "implication_company": "Zebracorp's policy is comprehensive across all guarantee types.",
        "implication_supplier": "Suppliers cannot expect any form of guarantee from Zebracorp for its payments.",
        "source_insight": "N/A",
        "text": "This applies to bank guarantees, Letters of Credit and other such external guarantees as well as parent company guarantees."
      },
      "source_agent": "AGENT_4",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout A",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_4_prompt.txt"
      }
    },
    {
      "id": "f05ea914-74eb-488e-90d7-1fc6dc7fab98",
      "content": {
        "id": "a1b2c3d4-e5f6-47a8-9b0c-1d2e3f4a5b6c",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "Any exceptions to this will need to be handled as per Zebracorp Group Guarantee SOP and must be agreed with Zebracorp Global Guarantee Center.",
        "plain_text": "Any exceptions to Zebracorp's no-guarantee policy must follow the Zebracorp Group Guarantee SOP and require agreement from the Zebracorp Global Guarantee Center.",
        "expert_insight": "This outlines the strict internal process for any deviation from the general rule, emphasizing centralized control and adherence to established procedures for managing financial risks.",
        "confidence": 1.0,
        "conditions": "If an exception to Zebracorp's no-guarantee policy is considered.",
        "justification": "Ensures proper governance and risk management for deviations from the standard policy.",
        "implication_company": "Zebracorp has a formal, controlled process for approving any guarantee exceptions, involving specific internal departments.",
        "implication_supplier": "Suppliers seeking a guarantee from Zebracorp must be aware of Zebracorp's internal approval process, which is likely complex and time-consuming.",
        "source_insight": "N/A",
        "text": "Any exceptions to this will need to be handled as per Zebracorp Group Guarantee SOP and must be agreed with Zebracorp Global Guarantee Center."
      },
      "source_agent": "AGENT_4",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout A",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_4_prompt.txt"
      }
    },
    {
      "id": "41089495-9692-4406-9e8f-7933ef80700c",
      "content": {
        "id": "c7d8e9f0-a1b2-4c3d-5e6f-7a8b9c0d1e2f",
        "type": "GUIDELINE",
        "classification": "MEDIUM",
        "verbatim_text": "In the event Zebracorp makes any advance payment or other prepayments to the supplier, Zebracorp may require a so called advance payment guarantee as a security from the supplier.",
        "plain_text": "Zebracorp reserves the right to require an advance payment guarantee from a supplier when making advance payments or prepayments.",
        "expert_insight": "This establishes Zebracorp's right to secure its prepayments, mitigating the risk of supplier non-performance or insolvency after receiving funds.",
        "confidence": 1.0,
        "conditions": "Zebracorp makes an advance payment or other prepayment to a supplier.",
        "justification": "To secure Zebracorp's prepayments and mitigate financial risk.",
        "implication_company": "Zebracorp can protect its financial interests when making advance payments.",
        "implication_supplier": "Suppliers receiving advance payments from Zebracorp may be required to provide an advance payment guarantee.",
        "source_insight": "N/A",
        "text": "In the event Zebracorp makes any advance payment or other prepayments to the supplier, Zebracorp may require a so called advance payment guarantee as a security from the supplier."
      },
      "source_agent": "AGENT_4",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout A",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_4_prompt.txt"
      }
    },
    {
      "id": "d4ebd81f-0c8c-4dc9-b855-1aae27079554",
      "content": {
        "id": "d0e1f2a3-b4c5-4d6e-7f8a-9b0c1d2e3f4a",
        "type": "OTHER",
        "subtype": "INSTRUCTION",
        "verbatim_text": "The need for such advance payment guarantee depends on the value of the prepayment as well as other factors, and is ultimately decided by Procurement with F&C consultation.",
        "plain_text": "The decision to require an advance payment guarantee is made by Procurement, in consultation with F&C, based on the prepayment's value and other relevant factors.",
        "expert_insight": "This clarifies the internal decision-making process within Zebracorp, indicating that the requirement for such guarantees is not automatic but subject to a risk assessment by specific departments.",
        "confidence": 1.0,
        "justification": "N/A",
        "implication_company": "Procurement, in consultation with F&C, is responsible for assessing and deciding the need for advance payment guarantees.",
        "implication_supplier": "N/A",
        "source_insight": "N/A",
        "text": "The need for such advance payment guarantee depends on the value of the prepayment as well as other factors, and is ultimately decided by Procurement with F&C consultation."
      },
      "source_agent": "AGENT_4",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout A",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_4_prompt.txt"
      }
    },
    {
      "id": "42062ce0-d8d9-43d8-b678-132d724aa666",
      "content": {
        "id": "e1f2a3b4-c5d6-4e7f-8a9b-0c1d2e3f4a5b",
        "type": "GUIDELINE",
        "classification": "MEDIUM",
        "verbatim_text": "Zebracorp may also from time to time require performance bonds or guarantees from certain of its subcontractors in particular for key customer projects where the customer of Zebracorp is requesting such guarantees, or where such guarantee is otherwise found to be necessary in order to secure the performance of subcontractor’s obligations.",
        "plain_text": "Zebracorp may require performance bonds or guarantees from subcontractors, especially for key customer projects or when necessary to secure subcontractor performance.",
        "expert_insight": "This outlines Zebracorp's right to secure subcontractor performance, particularly in high-stakes projects, protecting its own commitments to customers and ensuring project delivery.",
        "confidence": 1.0,
        "conditions": "Key customer projects where the customer requests such guarantees, or when deemed necessary to secure subcontractor performance.",
        "justification": "To secure the performance of subcontractor’s obligations and meet customer requirements.",
        "implication_company": "Zebracorp can mitigate risks associated with subcontractor performance, especially in critical projects.",
        "implication_supplier": "Subcontractors working on key customer projects or in situations where their performance needs securing may be required to provide performance bonds or guarantees.",
        "source_insight": "N/A",
        "text": "Zebracorp may also from time to time require performance bonds or guarantees from certain of its subcontractors in particular for key customer projects where the customer of Zebracorp is requesting such guarantees, or where such guarantee is otherwise found to be necessary in order to secure the performance of subcontractor’s obligations."
      },
      "source_agent": "AGENT_4",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout A",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_4_prompt.txt"
      }
    },
    {
      "id": "d1d41fb6-76c1-4548-97fb-40d402b01fb2",
      "content": {
        "id": "f2a3b4c5-d6e7-4f8a-9b0c-1d2e3f4a5b6c",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "Any guarantee to be issued in favor of Zebracorp must be from an international bank acceptable to Zebracorp.",
        "plain_text": "Guarantees issued in favor of Zebracorp must originate from an international bank that is acceptable to Zebracorp.",
        "expert_insight": "This sets a clear standard for the source of guarantees, ensuring that Zebracorp only accepts instruments from reputable and internationally recognized financial institutions it deems trustworthy.",
        "confidence": 1.0,
        "conditions": "A guarantee is issued in favor of Zebracorp.",
        "justification": "Ensures the reliability and enforceability of the guarantee.",
        "implication_company": "Zebracorp maintains control over the quality and reliability of the financial institutions providing guarantees.",
        "implication_supplier": "Suppliers must ensure that any bank providing a guarantee to Zebracorp is an international bank acceptable to Zebracorp.",
        "source_insight": "N/A",
        "text": "Any guarantee to be issued in favor of Zebracorp must be from an international bank acceptable to Zebracorp."
      },
      "source_agent": "AGENT_4",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout A",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_4_prompt.txt"
      }
    },
    {
      "id": "8123e3fd-c619-4c6d-b6c1-02714d3951fa",
      "content": {
        "id": "a3b4c5d6-e7f8-4a9b-0c1d-2e3f4a5b6c7d",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "Bank rating should be investment grade (BBB-) at minimum.",
        "plain_text": "The issuing bank for a guarantee must have a minimum investment grade rating of BBB-.",
        "expert_insight": "This specifies a minimum creditworthiness standard for banks issuing guarantees to Zebracorp, protecting Zebracorp from potential default by the guaranteeing institution.",
        "confidence": 1.0,
        "conditions": "A guarantee is issued from a bank in favor of Zebracorp.",
        "justification": "Ensures the financial stability and reliability of the issuing bank.",
        "implication_company": "Zebracorp minimizes the risk of a guarantee becoming worthless due to the issuing bank's financial instability.",
        "implication_supplier": "Suppliers must ensure their chosen bank for guarantees meets Zebracorp's minimum BBB- investment grade rating requirement.",
        "source_insight": "N/A",
        "text": "Bank rating should be investment grade (BBB-) at minimum."
      },
      "source_agent": "AGENT_4",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout A",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_4_prompt.txt"
      }
    },
    {
      "id": "5f41e1ae-3744-4e93-ae6f-ec005485c294",
      "content": {
        "id": "b4c5d6e7-f8a9-4b0c-1d2e-3f4a5b6c7d8e",
        "type": "OTHER",
        "subtype": "INFO",
        "verbatim_text": "A parent company guarantee may be preferred over a bank issued guarantee or bond due to the fact that guarantees/bonds issued by financial institutions carry a charge.",
        "plain_text": "Parent company guarantees might be preferred over bank-issued guarantees or bonds because financial institutions charge fees for their guarantees.",
        "expert_insight": "This indicates Zebracorp's preference for cost-effective guarantee solutions, acknowledging the hidden costs associated with bank-issued instruments.",
        "confidence": 1.0,
        "justification": "Guarantees/bonds issued by financial institutions carry a charge.",
        "implication_company": "Zebracorp considers the cost implications when deciding on the type of guarantee to request.",
        "implication_supplier": "Suppliers might find it more cost-effective to offer a parent company guarantee if acceptable to Zebracorp.",
        "source_insight": "N/A",
        "text": "A parent company guarantee may be preferred over a bank issued guarantee or bond due to the fact that guarantees/bonds issued by financial institutions carry a charge."
      },
      "source_agent": "AGENT_4",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout A",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_4_prompt.txt"
      }
    },
    {
      "id": "ca28389c-2062-40d0-ac3e-5187a0f0efe1",
      "content": {
        "id": "c5d6e7f8-a9b0-4c1d-2e3f-4a5b6c7d8e9f",
        "type": "OTHER",
        "subtype": "INFO",
        "verbatim_text": "This charge is often directly or indirectly passed on the prices paid by Zebracorp.",
        "plain_text": "The charges associated with bank guarantees are frequently passed on to Zebracorp, either directly or indirectly, through pricing.",
        "expert_insight": "This further justifies Zebracorp's preference for parent company guarantees by highlighting that the cost of bank guarantees ultimately impacts Zebracorp's expenses.",
        "confidence": 1.0,
        "justification": "N/A",
        "implication_company": "Zebracorp bears the cost of bank guarantees, even if indirectly, which influences its preference for other guarantee types.",
        "implication_supplier": "N/A",
        "source_insight": "N/A",
        "text": "This charge is often directly or indirectly passed on the prices paid by Zebracorp."
      },
      "source_agent": "AGENT_4",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout A",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_4_prompt.txt"
      }
    },
    {
      "id": "afddceff-42e0-4932-9565-e4d6aa1ee154",
      "content": {
        "id": "d6e7f8a9-b0c1-4d2e-3f4a-5b6c7d8e9f0a",
        "type": "OTHER",
        "subtype": "INSTRUCTION",
        "verbatim_text": "For this reason, the benefits of requesting supplier guarantees must be carefully assessed.",
        "plain_text": "Due to the potential costs, Zebracorp must carefully evaluate the benefits of requiring supplier guarantees.",
        "expert_insight": "This emphasizes a cost-benefit analysis approach, ensuring that the security provided by a guarantee outweighs the potential financial burden on Zebracorp.",
        "confidence": 1.0,
        "justification": "The charges for bank guarantees are often passed on to Zebracorp.",
        "implication_company": "Zebracorp should conduct a thorough cost-benefit analysis before requiring supplier guarantees.",
        "implication_supplier": "N/A",
        "source_insight": "N/A",
        "text": "For this reason, the benefits of requesting supplier guarantees must be carefully assessed."
      },
      "source_agent": "AGENT_4",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout A",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_4_prompt.txt"
      }
    },
    {
      "id": "e410cf15-7535-418f-858c-724b82492dac",
      "content": {
        "id": "e7f8a9b0-c1d2-4e3f-8a9b-0c1d2e3f4a5b",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "When using a corporate/parent company guarantees, it should however be noted that these are acceptable only if the credit rating of the issuing parent entity is BBB- at minimum.",
        "plain_text": "Corporate or parent company guarantees are acceptable only if the issuing parent entity has a credit rating of at least BBB- (investment grade).",
        "expert_insight": "This sets a critical financial standard for parent company guarantees, ensuring that even if a bank is not involved, the guarantor's financial strength meets Zebracorp's risk tolerance.",
        "confidence": 1.0,
        "conditions": "A corporate/parent company guarantee is used.",
        "justification": "Ensures the financial stability and reliability of the issuing parent entity.",
        "implication_company": "Zebracorp maintains a minimum creditworthiness standard for parent company guarantors.",
        "implication_supplier": "Parent companies providing guarantees must have a minimum credit rating of BBB-.",
        "source_insight": "N/A",
        "text": "When using a corporate/parent company guarantees, it should however be noted that these are acceptable only if the credit rating of the issuing parent entity is BBB- at minimum."
      },
      "source_agent": "AGENT_4",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout A",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_4_prompt.txt"
      }
    },
    {
      "id": "2b88a140-45ce-4000-9d13-ddc23eef4370",
      "content": {
        "id": "f8a9b0c1-d2e3-4f4a-9b0c-1d2e3f4a5b6c",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "Also, for corporate/parent company guarantees Zebracorp´s model guarantee wordings should be used.",
        "plain_text": "Zebracorp's model guarantee wordings must be used for corporate/parent company guarantees.",
        "expert_insight": "This ensures legal consistency and protection for Zebracorp by standardizing the language and terms of parent company guarantees, minimizing legal risks.",
        "confidence": 1.0,
        "conditions": "A corporate/parent company guarantee is used.",
        "justification": "Ensures legal consistency and protection for Zebracorp.",
        "implication_company": "Zebracorp ensures that the legal terms of parent company guarantees are standardized and favorable.",
        "implication_supplier": "Suppliers must use Zebracorp's standard model wordings for parent company guarantees.",
        "source_insight": "N/A",
        "text": "Also, for corporate/parent company guarantees Zebracorp´s model guarantee wordings should be used."
      },
      "source_agent": "AGENT_4",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout A",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_4_prompt.txt"
      }
    },
    {
      "id": "72467852-ba4e-469d-9f5f-a2f2cadad41d",
      "content": {
        "id": "a9b0c1d2-e3f4-4a5b-6c7d-8e9f0a1b2c3d",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "The corporate/parent company guarantee should be under same applicable law as the supply agreement which is generally New York law.",
        "plain_text": "Corporate/parent company guarantees should be governed by the same applicable law as the supply agreement, which is typically New York law.",
        "expert_insight": "This ensures legal coherence and simplifies dispute resolution by having a single governing law for related contractual documents.",
        "confidence": 1.0,
        "conditions": "A corporate/parent company guarantee is used.",
        "justification": "Ensures legal consistency and simplifies dispute resolution.",
        "implication_company": "Zebracorp ensures legal consistency across related agreements, typically under New York law.",
        "implication_supplier": "Suppliers must ensure the governing law of their parent company guarantee aligns with the supply agreement, generally New York law.",
        "source_insight": "N/A",
        "text": "The corporate/parent company guarantee should be under same applicable law as the supply agreement which is generally New York law."
      },
      "source_agent": "AGENT_4",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout A",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_4_prompt.txt"
      }
    },
    {
      "id": "ea2d5acd-f119-4880-a06d-0d35ccd24d3a",
      "content": {
        "id": "b0c1d2e3-f4a5-4b6c-7d8e-9f0a1b2c3d4e",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "Other governing law provisions should be cleared with Legal and Compliance or Finance.",
        "plain_text": "Any deviations from the standard governing law for corporate/parent company guarantees must be approved by Legal and Compliance or Finance.",
        "expert_insight": "This establishes a formal approval process for any exceptions to the governing law, maintaining control over legal risk and ensuring expert review.",
        "confidence": 1.0,
        "conditions": "Governing law provisions for corporate/parent company guarantees differ from the supply agreement's applicable law.",
        "justification": "Ensures proper legal and financial review for deviations from standard governing law.",
        "implication_company": "Zebracorp maintains strict control over legal terms, requiring internal approval for any non-standard governing law.",
        "implication_supplier": "Suppliers proposing a different governing law for parent company guarantees must obtain Zebracorp's internal approval.",
        "source_insight": "N/A",
        "text": "Other governing law provisions should be cleared with Legal and Compliance or Finance."
      },
      "source_agent": "AGENT_4",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout A",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_4_prompt.txt"
      }
    },
    {
      "id": "8fcbc2c9-ce04-437b-8e54-ee4cb0f41b84",
      "content": {
        "id": "c1d2e3f4-a5b6-4c7d-8e9f-0a1b2c3d4e5f",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "As for bank guarantees/performance bonds, Zebracorp should only accept so called on-demand guarantees or stand-by Letters of Credit.",
        "plain_text": "For bank guarantees and performance bonds, Zebracorp will only accept on-demand guarantees or stand-by Letters of Credit.",
        "expert_insight": "This specifies the preferred types of bank-issued instruments, opting for those that are most readily enforceable and provide immediate security without complex conditions.",
        "confidence": 1.0,
        "conditions": "Accepting bank guarantees/performance bonds.",
        "justification": "On-demand guarantees and stand-by Letters of Credit offer greater security and ease of enforcement.",
        "implication_company": "Zebracorp ensures it receives guarantees that are easily enforceable and provide robust security.",
        "implication_supplier": "Suppliers must provide bank guarantees or performance bonds in the form of on-demand guarantees or stand-by Letters of Credit.",
        "source_insight": "N/A",
        "text": "As for bank guarantees/performance bonds, Zebracorp should only accept so called on-demand guarantees or stand-by Letters of Credit."
      },
      "source_agent": "AGENT_4",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout A",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_4_prompt.txt"
      }
    },
    {
      "id": "29cf0c8c-0ccf-49a9-94c0-2e8291131859",
      "content": {
        "id": "d2e3f4a5-b6c7-4d8e-9f0a-1b2c3d4e5f6a",
        "type": "OTHER",
        "subtype": "INFO",
        "verbatim_text": "A template for an Advance Payment Guarantee can be found below.",
        "plain_text": "A template for an Advance Payment Guarantee is provided within this document.",
        "expert_insight": "This indicates the availability of a standardized template to facilitate the creation of advance payment guarantees, ensuring consistency and compliance.",
        "confidence": 1.0,
        "justification": "N/A",
        "implication_company": "Zebracorp provides resources to standardize guarantee documentation.",
        "implication_supplier": "Suppliers have access to a template for advance payment guarantees, simplifying compliance.",
        "source_insight": "N/A",
        "text": "A template for an Advance Payment Guarantee can be found below."
      },
      "source_agent": "AGENT_4",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout A",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_4_prompt.txt"
      }
    },
    {
      "id": "0776310d-76b9-4b33-bfa0-33a78edb818c",
      "content": {
        "id": "e3f4a5b6-c7d8-4e9f-0a1b-2c3d4e5f6a7b",
        "type": "OTHER",
        "subtype": "INFO",
        "verbatim_text": "Other guarantee templates are available from Legal & Compliance.",
        "plain_text": "Additional guarantee templates can be obtained from Zebracorp's Legal & Compliance department.",
        "expert_insight": "This points to Legal & Compliance as the central repository for standardized guarantee documentation, ensuring legal review and consistency across all guarantee types.",
        "confidence": 1.0,
        "justification": "N/A",
        "implication_company": "Legal & Compliance serves as a central resource for guarantee templates.",
        "implication_supplier": "Suppliers needing other guarantee templates should contact Zebracorp's Legal & Compliance department.",
        "source_insight": "N/A",
        "text": "Other guarantee templates are available from Legal & Compliance."
      },
      "source_agent": "AGENT_4",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout A",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_4_prompt.txt"
      }
    },
    {
      "id": "d0604908-026e-44c3-85c0-653daddbd736",
      "content": {
        "id": "f4a5b6c7-d8e9-4f0a-1b2c-3d4e5f6a7b8c",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "Any deviations to these templates would need to be approved by Zebracorp Global Guarantee Center and/or Zebracorp Finance Legal.",
        "plain_text": "Any modifications to Zebracorp's guarantee templates require approval from the Zebracorp Global Guarantee Center and/or Zebracorp Finance Legal.",
        "expert_insight": "This reinforces the strict control over guarantee documentation, ensuring that any changes are reviewed and approved by relevant expert departments to maintain legal and financial integrity.",
        "confidence": 1.0,
        "conditions": "Deviations from standard guarantee templates are proposed.",
        "justification": "Ensures proper review and approval of non-standard guarantee wordings to maintain legal and financial integrity.",
        "implication_company": "Zebracorp maintains strict control over the wording of guarantees, requiring internal approval for any deviations.",
        "implication_supplier": "Suppliers proposing changes to Zebracorp's guarantee templates must obtain approval from the specified Zebracorp departments.",
        "source_insight": "N/A",
        "text": "Any deviations to these templates would need to be approved by Zebracorp Global Guarantee Center and/or Zebracorp Finance Legal."
      },
      "source_agent": "AGENT_4",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout A",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_4_prompt.txt"
      }
    },
    {
      "id": "f07dd916-0748-4835-9c04-3e828f2013b6",
      "content": {
        "id": "a5b6c7d8-e9f0-4a1b-2c3d-4e5f6a7b8c9d",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "Final guarantee documentation should be delivered to Zebracorp Global Guarantee Center which will keep track on existing guarantees and which will store the guarantees.",
        "plain_text": "All final guarantee documentation must be submitted to the Zebracorp Global Guarantee Center for tracking and storage.",
        "expert_insight": "This establishes a centralized process for managing and archiving all guarantees, crucial for auditability, risk management, and ensuring that all active guarantees are properly recorded and accessible.",
        "confidence": 1.0,
        "conditions": "Final guarantee documentation is available.",
        "justification": "Ensures centralized tracking, storage, and management of all guarantees for risk management and audit purposes.",
        "implication_company": "Zebracorp ensures proper record-keeping and centralized management of all received guarantees.",
        "implication_supplier": "Suppliers must ensure that final guarantee documentation is delivered to the Zebracorp Global Guarantee Center.",
        "source_insight": "N/A",
        "text": "Final guarantee documentation should be delivered to Zebracorp Global Guarantee Center which will keep track on existing guarantees and which will store the guarantees."
      },
      "source_agent": "AGENT_4",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout A",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_4_prompt.txt"
      }
    },
    {
      "id": "3acbbec4-871b-480f-8cbb-e1bfcbf207c9",
      "content": {
        "id": "a1b2c3d4-e5f6-7890-1234-567890abcdef",
        "type": "OTHER",
        "subtype": "INFO",
        "verbatim_text": "Zebracorp is generally relying on its suppliers having conducted necessary credit risk assessments on Zebracorp contracting entity and having satisfied itself as to the creditworthiness of Zebracorp.",
        "plain_text": "Zebracorp expects its suppliers to perform their own credit risk assessments on Zebracorp's contracting entity and confirm its creditworthiness.",
        "expert_insight": "This statement clarifies Zebracorp's default position, shifting the burden of credit risk assessment onto the supplier. Suppliers should be aware that Zebracorp does not typically provide guarantees and they must conduct their own due diligence.",
        "confidence": 1.0,
        "justification": "This provides background context on Zebracorp's expectations regarding supplier due diligence.",
        "implication_company": "Reduces the administrative and financial burden on Zebracorp by placing credit assessment responsibility on suppliers.",
        "implication_supplier": "Suppliers must proactively assess Zebracorp's creditworthiness before entering agreements, as guarantees from Zebracorp are not standard.",
        "source_insight": "N/A",
        "text": "Zebracorp is generally relying on its suppliers having conducted necessary credit risk assessments on Zebracorp contracting entity and having satisfied itself as to the creditworthiness of Zebracorp."
      },
      "source_agent": "AGENT_5",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout B",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_5_prompt.txt"
      }
    },
    {
      "id": "cbd11c24-3816-4c8f-995a-e3190077b0c8",
      "content": {
        "id": "b2c3d4e5-f6a7-8901-2345-67890abcdef0",
        "type": "OTHER",
        "subtype": "INFO",
        "verbatim_text": "Any guarantee issued by Zebracorp would need to recorded in our financial accounts and would increase our financial liabilities.",
        "plain_text": "Guarantees issued by Zebracorp must be recorded in its financial accounts and will increase its financial liabilities.",
        "expert_insight": "This highlights the financial implications of Zebracorp issuing guarantees, explaining the rationale behind its general policy against providing them.",
        "confidence": 1.0,
        "justification": "Explains the financial impact of issuing guarantees, providing context for the subsequent rule.",
        "implication_company": "Issuing guarantees has direct financial reporting and liability consequences.",
        "implication_supplier": "Understanding this helps suppliers grasp why Zebracorp is reluctant to issue guarantees.",
        "source_insight": "N/A",
        "text": "Any guarantee issued by Zebracorp would need to recorded in our financial accounts and would increase our financial liabilities."
      },
      "source_agent": "AGENT_5",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout B",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_5_prompt.txt"
      }
    },
    {
      "id": "5995f287-8fb7-4000-8b72-7565331ff3d6",
      "content": {
        "id": "c3d4e5f6-a7b8-9012-3456-7890abcdef01",
        "type": "GUIDELINE",
        "classification": "CRITICAL",
        "verbatim_text": "For these reasons, the main rule is that Zebracorp does not give guarantees to our suppliers to guarantee Zebracorp´s payments.",
        "plain_text": "Zebracorp's primary policy is not to provide guarantees to its suppliers for Zebracorp's payments.",
        "expert_insight": "This is a fundamental policy statement. Suppliers should assume that Zebracorp will not provide payment guarantees and plan their credit risk management accordingly.",
        "confidence": 1.0,
        "conditions": "N/A",
        "justification": "Based on financial accounting and liability implications.",
        "implication_company": "Reduces financial liability and administrative burden associated with issuing and tracking guarantees.",
        "implication_supplier": "Suppliers cannot expect payment guarantees from Zebracorp and must rely on Zebracorp's creditworthiness or seek alternative security.",
        "source_insight": "N/A",
        "text": "For these reasons, the main rule is that Zebracorp does not give guarantees to our suppliers to guarantee Zebracorp´s payments."
      },
      "source_agent": "AGENT_5",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout B",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_5_prompt.txt"
      }
    },
    {
      "id": "ec497144-5451-4c7b-a0d4-12310a8b8d6d",
      "content": {
        "id": "d4e5f6a7-b8c9-0123-4567-890abcdef012",
        "type": "OTHER",
        "subtype": "INFO",
        "verbatim_text": "This applies to bank guarantees, Letters of Credit and other such external guarantees as well as parent company guarantees.",
        "plain_text": "The policy of not providing guarantees extends to all types, including bank guarantees, Letters of Credit, and parent company guarantees.",
        "expert_insight": "This clarifies the broad scope of Zebracorp's no-guarantee policy, leaving no room for ambiguity regarding specific guarantee types.",
        "confidence": 1.0,
        "justification": "Defines the scope of the 'no guarantees' rule.",
        "implication_company": "Ensures consistent application of the policy across all guarantee types.",
        "implication_supplier": "Suppliers should not expect any form of guarantee from Zebracorp, regardless of the type.",
        "source_insight": "N/A",
        "text": "This applies to bank guarantees, Letters of Credit and other such external guarantees as well as parent company guarantees."
      },
      "source_agent": "AGENT_5",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout B",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_5_prompt.txt"
      }
    },
    {
      "id": "ff2f1287-0770-4024-8f3b-ab29e2329ccb",
      "content": {
        "id": "e5f6a7b8-c9d0-1234-5678-90abcdef0123",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "Any exceptions to this will need to be handled as per Zebracorp Group Guarantee SOP and must be agreed with Zebracorp Global Guarantee Center.",
        "plain_text": "Exceptions to Zebracorp's no-guarantee policy must follow the Zebracorp Group Guarantee SOP and require approval from the Zebracorp Global Guarantee Center.",
        "expert_insight": "While a general rule exists, this outlines a strict, centralized process for any exceptions. Suppliers seeking a guarantee must understand this internal approval hierarchy.",
        "confidence": 1.0,
        "conditions": "An exception to Zebracorp's general policy of not providing guarantees.",
        "justification": "Ensures strict control and oversight over any deviations from the standard policy.",
        "implication_company": "Maintains centralized control over financial liabilities and ensures adherence to internal policies for exceptions.",
        "implication_supplier": "If a guarantee is absolutely necessary, suppliers must be prepared for a rigorous internal approval process within Zebracorp, following specific SOPs.",
        "source_insight": "N/A",
        "text": "Any exceptions to this will need to be handled as per Zebracorp Group Guarantee SOP and must be agreed with Zebracorp Global Guarantee Center."
      },
      "source_agent": "AGENT_5",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout B",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_5_prompt.txt"
      }
    },
    {
      "id": "44a52dad-69cc-47f2-be12-f3e73c322ba9",
      "content": {
        "id": "f6a7b8c9-d0e1-2345-6789-0abcdef01234",
        "type": "GUIDELINE",
        "classification": "MEDIUM",
        "verbatim_text": "In the event Zebracorp makes any advance payment or other prepayments to the supplier, Zebracorp may require a so called advance payment guarantee as a security from the supplier.",
        "plain_text": "If Zebracorp makes advance payments or prepayments, it may require an advance payment guarantee from the supplier as security.",
        "expert_insight": "This establishes Zebracorp's right to request security from suppliers when it makes prepayments, mitigating its own risk. Suppliers should anticipate this requirement when negotiating advance payment terms.",
        "confidence": 1.0,
        "conditions": "Zebracorp makes an advance payment or other prepayment to the supplier.",
        "justification": "To secure Zebracorp's advance payments and mitigate financial risk.",
        "implication_company": "Provides a mechanism to secure prepayments made to suppliers.",
        "implication_supplier": "Suppliers receiving advance payments may be obligated to provide an advance payment guarantee.",
        "source_insight": "N/A",
        "text": "In the event Zebracorp makes any advance payment or other prepayments to the supplier, Zebracorp may require a so called advance payment guarantee as a security from the supplier."
      },
      "source_agent": "AGENT_5",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout B",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_5_prompt.txt"
      }
    },
    {
      "id": "c21c128a-09d1-46a1-8f39-4ae160b08272",
      "content": {
        "id": "a7b8c9d0-e1f2-3456-7890-abcdef012345",
        "type": "OTHER",
        "subtype": "INSTRUCTION",
        "verbatim_text": "The need for such advance payment guarantee depends on the value of the prepayment as well as other factors, and is ultimately decided by Procurement with F&C consultation.",
        "plain_text": "The decision to require an advance payment guarantee is made by Procurement, in consultation with Finance & Control (F&C), based on the prepayment value and other relevant factors.",
        "expert_insight": "This clarifies the internal decision-making process within Zebracorp regarding advance payment guarantees, indicating a structured approach rather than an automatic requirement.",
        "confidence": 1.0,
        "justification": "Provides context on how the decision to require an advance payment guarantee is made.",
        "implication_company": "Ensures a considered approach to requesting guarantees, involving relevant departments.",
        "implication_supplier": "Suppliers can understand the criteria and internal process Zebracorp uses to decide on advance payment guarantees.",
        "source_insight": "N/A",
        "text": "The need for such advance payment guarantee depends on the value of the prepayment as well as other factors, and is ultimately decided by Procurement with F&C consultation."
      },
      "source_agent": "AGENT_5",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout B",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_5_prompt.txt"
      }
    },
    {
      "id": "7c83849d-de09-4146-8c4e-0e592dc38ceb",
      "content": {
        "id": "b8c9d0e1-f2a3-4567-8901-abcdef012346",
        "type": "GUIDELINE",
        "classification": "MEDIUM",
        "verbatim_text": "Zebracorp may also from time to time require performance bonds or guarantees from certain of its subcontractors in particular for key customer projects where the customer of Zebracorp is requesting such guarantees, or where such guarantee is otherwise found to be necessary in order to secure the performance of subcontractor’s obligations.",
        "plain_text": "Zebracorp may require performance bonds or guarantees from subcontractors, especially for key customer projects where the customer requests them, or when deemed necessary to secure subcontractor performance.",
        "expert_insight": "This outlines Zebracorp's right to seek performance security from subcontractors, driven by either customer demands or internal risk assessment. Subcontractors on key projects should be prepared for this requirement.",
        "confidence": 1.0,
        "conditions": "Key customer projects where the customer requests guarantees, OR when deemed necessary to secure subcontractor performance.",
        "justification": "To mitigate performance risk, especially on critical projects or when customer demands dictate.",
        "implication_company": "Protects Zebracorp against subcontractor non-performance, particularly on high-stakes projects.",
        "implication_supplier": "Subcontractors, especially those on key customer projects, should anticipate being asked to provide performance bonds or guarantees.",
        "source_insight": "N/A",
        "text": "Zebracorp may also from time to time require performance bonds or guarantees from certain of its subcontractors in particular for key customer projects where the customer of Zebracorp is requesting such guarantees, or where such guarantee is otherwise found to be necessary in order to secure the performance of subcontractor’s obligations."
      },
      "source_agent": "AGENT_5",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout B",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_5_prompt.txt"
      }
    },
    {
      "id": "f0acdcb6-7ce2-4ff0-93ff-4a19a0e1991e",
      "content": {
        "id": "c9d0e1f2-a3b4-5678-9012-abcdef012347",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "Any guarantee to be issued in favor of Zebracorp must be from an international bank acceptable to Zebracorp.",
        "plain_text": "Guarantees provided to Zebracorp must be issued by an international bank that is acceptable to Zebracorp.",
        "expert_insight": "This sets a clear standard for the source of bank guarantees, ensuring financial stability and international recognition. Suppliers must ensure their chosen bank meets Zebracorp's approval.",
        "confidence": 1.0,
        "conditions": "A guarantee is issued in favor of Zebracorp.",
        "justification": "Ensures the reliability and enforceability of the guarantee.",
        "implication_company": "Maintains a standard for the quality and reliability of financial institutions providing guarantees.",
        "implication_supplier": "Suppliers must select an international bank that Zebracorp deems acceptable for issuing guarantees.",
        "source_insight": "N/A",
        "text": "Any guarantee to be issued in favor of Zebracorp must be from an international bank acceptable to Zebracorp."
      },
      "source_agent": "AGENT_5",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout B",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_5_prompt.txt"
      }
    },
    {
      "id": "0e1eea53-91fb-4c42-a218-16c32411e9c1",
      "content": {
        "id": "d0e1f2a3-b4c5-6789-0123-abcdef012348",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "Bank rating should be investment grade (BBB-) at minimum.",
        "plain_text": "Banks issuing guarantees to Zebracorp must have a minimum investment grade rating of BBB-.",
        "expert_insight": "This is a specific, measurable requirement for the creditworthiness of the issuing bank, ensuring a high level of security for Zebracorp. Suppliers need to verify their bank's rating.",
        "confidence": 1.0,
        "conditions": "A guarantee is issued by a bank in favor of Zebracorp.",
        "justification": "Ensures the financial stability and credibility of the issuing bank.",
        "implication_company": "Reduces the risk associated with the issuing bank's ability to honor the guarantee.",
        "implication_supplier": "Suppliers must ensure their bank meets the minimum BBB- investment grade rating to issue guarantees for Zebracorp.",
        "source_insight": "N/A",
        "text": "Bank rating should be investment grade (BBB-) at minimum."
      },
      "source_agent": "AGENT_5",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout B",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_5_prompt.txt"
      }
    },
    {
      "id": "cbfa3e87-b45c-440c-8792-d135f6fa39bf",
      "content": {
        "id": "e1f2a3b4-c5d6-7890-1234-abcdef012349",
        "type": "OTHER",
        "subtype": "INFO",
        "verbatim_text": "A parent company guarantee may be preferred over a bank issued guarantee or bond due to the fact that guarantees/bonds issued by financial institutions carry a charge.",
        "plain_text": "Parent company guarantees might be preferred over bank guarantees/bonds because financial institutions typically charge for their guarantees.",
        "expert_insight": "This explains Zebracorp's preference for parent company guarantees, driven by cost considerations. Suppliers should be aware of this preference, but also note the subsequent conditions for parent company guarantees.",
        "confidence": 1.0,
        "justification": "Explains the rationale behind Zebracorp's potential preference for parent company guarantees.",
        "implication_company": "Potential cost savings by avoiding charges associated with bank-issued guarantees.",
        "implication_supplier": "Suppliers might find it easier to provide a parent company guarantee if their parent entity meets the criteria, potentially avoiding bank charges.",
        "source_insight": "N/A",
        "text": "A parent company guarantee may be preferred over a bank issued guarantee or bond due to the fact that guarantees/bonds issued by financial institutions carry a charge."
      },
      "source_agent": "AGENT_5",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout B",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_5_prompt.txt"
      }
    },
    {
      "id": "b2161d50-06d7-4f91-888d-6f93f4c5126d",
      "content": {
        "id": "f2a3b4c5-d6e7-8901-2345-abcdef012350",
        "type": "OTHER",
        "subtype": "INFO",
        "verbatim_text": "This charge is often directly or indirectly passed on the prices paid by Zebracorp.",
        "plain_text": "Charges for financial institution guarantees are often passed on to Zebracorp through increased prices.",
        "expert_insight": "This elaborates on the financial impact, showing why Zebracorp seeks to avoid bank-issued guarantees where possible.",
        "confidence": 1.0,
        "justification": "Further explains the cost implication of bank guarantees.",
        "implication_company": "Highlights a direct cost impact that Zebracorp aims to mitigate.",
        "implication_supplier": "Explains why Zebracorp might negotiate for parent company guarantees or scrutinize pricing that includes guarantee costs.",
        "source_insight": "N/A",
        "text": "This charge is often directly or indirectly passed on the prices paid by Zebracorp."
      },
      "source_agent": "AGENT_5",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout B",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_5_prompt.txt"
      }
    },
    {
      "id": "b281aa28-bf19-4a8d-86bd-952e753e7a07",
      "content": {
        "id": "a3b4c5d6-e7f8-9012-3456-abcdef012351",
        "type": "GUIDELINE",
        "classification": "MEDIUM",
        "verbatim_text": "For this reason, the benefits of requesting supplier guarantees must be carefully assessed.",
        "plain_text": "Zebracorp must carefully evaluate the benefits of requesting supplier guarantees due to potential associated costs.",
        "expert_insight": "This mandates an internal cost-benefit analysis before requesting supplier guarantees, especially bank-issued ones. It implies that guarantees are not always automatically requested, even when permissible.",
        "confidence": 1.0,
        "conditions": "N/A",
        "justification": "To ensure that the cost of guarantees (which may be passed on to Zebracorp) is justified by the benefit of the security.",
        "implication_company": "Requires internal due diligence and a cost-benefit analysis before requesting guarantees, optimizing financial outcomes.",
        "implication_supplier": "Suggests that Zebracorp will not always automatically demand a guarantee, and there may be room for discussion if the supplier can demonstrate minimal risk.",
        "source_insight": "N/A",
        "text": "For this reason, the benefits of requesting supplier guarantees must be carefully assessed."
      },
      "source_agent": "AGENT_5",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout B",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_5_prompt.txt"
      }
    },
    {
      "id": "d970e349-8f45-4c73-9ed2-5f00f090af9f",
      "content": {
        "id": "b4c5d6e7-f8a9-0123-4567-abcdef012352",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "When using a corporate/parent company guarantees, it should however be noted that these are acceptable only if the credit rating of the issuing parent entity is BBB- at minimum.",
        "plain_text": "Corporate or parent company guarantees are only acceptable if the issuing parent entity has a minimum credit rating of BBB-.",
        "expert_insight": "While parent company guarantees may be preferred for cost reasons, this imposes a critical creditworthiness requirement on the parent entity. Suppliers must ensure their parent company meets this standard.",
        "confidence": 1.0,
        "conditions": "Using a corporate/parent company guarantee.",
        "justification": "Ensures the financial strength and credibility of the entity providing the guarantee.",
        "implication_company": "Maintains a standard for the financial health of entities providing corporate/parent company guarantees.",
        "implication_supplier": "If offering a parent company guarantee, the supplier's parent entity must have a credit rating of BBB- or higher.",
        "source_insight": "N/A",
        "text": "When using a corporate/parent company guarantees, it should however be noted that these are acceptable only if the credit rating of the issuing parent entity is BBB- at minimum."
      },
      "source_agent": "AGENT_5",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout B",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_5_prompt.txt"
      }
    },
    {
      "id": "7efab50a-cac4-462c-a358-4693570e91fb",
      "content": {
        "id": "c5d6e7f8-a9b0-1234-5678-abcdef012353",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "Also, for corporate/parent company guarantees Zebracorp´s model guarantee wordings should be used.",
        "plain_text": "Zebracorp's model guarantee wordings must be used for corporate/parent company guarantees.",
        "expert_insight": "This ensures standardization and legal robustness of corporate guarantees. Suppliers must use Zebracorp's provided templates without deviation unless approved.",
        "confidence": 1.0,
        "conditions": "Using a corporate/parent company guarantee.",
        "justification": "Ensures legal consistency, enforceability, and alignment with Zebracorp's legal standards.",
        "implication_company": "Standardizes legal language for corporate guarantees, reducing legal review time and risk.",
        "implication_supplier": "Suppliers must use Zebracorp's specific template for parent company guarantees.",
        "source_insight": "N/A",
        "text": "Also, for corporate/parent company guarantees Zebracorp´s model guarantee wordings should be used."
      },
      "source_agent": "AGENT_5",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout B",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_5_prompt.txt"
      }
    },
    {
      "id": "1d53ba40-ead9-4ada-806b-e3c33ea61229",
      "content": {
        "id": "d6e7f8a9-b0c1-2345-6789-abcdef012354",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "The corporate/parent company guarantee should be under same applicable law as the supply agreement which is generally New York law.",
        "plain_text": "Corporate/parent company guarantees should be governed by the same law as the supply agreement, which is typically New York law.",
        "expert_insight": "This mandates legal consistency between the guarantee and the underlying supply agreement, simplifying legal enforcement. Suppliers should expect New York law to apply to guarantees.",
        "confidence": 1.0,
        "conditions": "Using a corporate/parent company guarantee.",
        "justification": "Ensures legal consistency and simplifies enforcement across related agreements.",
        "implication_company": "Streamlines legal processes and reduces jurisdictional complexities.",
        "implication_supplier": "Guarantees must generally be governed by New York law, aligning with the supply agreement.",
        "source_insight": "N/A",
        "text": "The corporate/parent company guarantee should be under same applicable law as the supply agreement which is generally New York law."
      },
      "source_agent": "AGENT_5",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout B",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_5_prompt.txt"
      }
    },
    {
      "id": "e965cb59-4acd-4b00-90c5-9545b0036d4c",
      "content": {
        "id": "e7f8a9b0-c1d2-3456-7890-abcdef012355",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "Other governing law provisions should be cleared with Legal and Compliance or Finance.",
        "plain_text": "Any governing law provisions for guarantees that deviate from the standard must be approved by Zebracorp's Legal and Compliance or Finance departments.",
        "expert_insight": "This establishes a mandatory internal approval process for any non-standard governing law, emphasizing the importance of legal consistency.",
        "confidence": 1.0,
        "conditions": "Governing law provisions other than the standard (e.g., New York law for corporate guarantees).",
        "justification": "Ensures legal review and approval for non-standard legal jurisdictions, mitigating risk.",
        "implication_company": "Maintains control over legal risks associated with governing law provisions.",
        "implication_supplier": "If a different governing law is proposed for a guarantee, it will require specific internal approval from Zebracorp.",
        "source_insight": "N/A",
        "text": "Other governing law provisions should be cleared with Legal and Compliance or Finance."
      },
      "source_agent": "AGENT_5",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout B",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_5_prompt.txt"
      }
    },
    {
      "id": "35850ddb-396d-481a-9a84-3184ae3f5c2e",
      "content": {
        "id": "f8a9b0c1-d2e3-4567-8901-abcdef012356",
        "type": "GUIDELINE",
        "classification": "CRITICAL",
        "verbatim_text": "As for bank guarantees/performance bonds, Zebracorp should only accept so called on-demand guarantees or stand-by Letters of Credit.",
        "plain_text": "For bank guarantees and performance bonds, Zebracorp will only accept on-demand guarantees or stand-by Letters of Credit.",
        "expert_insight": "This is a critical requirement specifying the acceptable types of bank-issued security. These types provide Zebracorp with direct and swift access to funds without needing to prove default, offering maximum security.",
        "confidence": 1.0,
        "conditions": "N/A",
        "justification": "Ensures immediate access to funds upon demand, providing maximum security and reducing the burden of proof for Zebracorp.",
        "implication_company": "Secures Zebracorp's position by ensuring quick and unconditional access to funds in case of default.",
        "implication_supplier": "Suppliers must ensure that any bank guarantees or performance bonds they provide are strictly 'on-demand' or 'stand-by Letters of Credit' to be accepted by Zebracorp.",
        "source_insight": "N/A",
        "text": "As for bank guarantees/performance bonds, Zebracorp should only accept so called on-demand guarantees or stand-by Letters of Credit."
      },
      "source_agent": "AGENT_5",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout B",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_5_prompt.txt"
      }
    },
    {
      "id": "384767c5-dfe4-4a5e-86c6-7be18e5a0b84",
      "content": {
        "id": "a9b0c1d2-e3f4-5678-9012-abcdef012357",
        "type": "OTHER",
        "subtype": "INFO",
        "verbatim_text": "A template for an Advance Payment Guarantee can be found below.",
        "plain_text": "A template for an Advance Payment Guarantee is provided within the document.",
        "expert_insight": "This indicates the availability of a standardized template, which simplifies the process for suppliers and ensures compliance with Zebracorp's requirements.",
        "confidence": 1.0,
        "justification": "Provides information about the availability of a specific template.",
        "implication_company": "Facilitates the use of standardized documentation.",
        "implication_supplier": "Suppliers have access to a pre-approved template for advance payment guarantees.",
        "source_insight": "N/A",
        "text": "A template for an Advance Payment Guarantee can be found below."
      },
      "source_agent": "AGENT_5",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout B",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_5_prompt.txt"
      }
    },
    {
      "id": "8d93256e-de58-478b-9d97-d37dd5d9b26d",
      "content": {
        "id": "b0c1d2e3-f4a5-6789-0123-abcdef012358",
        "type": "OTHER",
        "subtype": "INFO",
        "verbatim_text": "Other guarantee templates are available from Legal & Compliance.",
        "plain_text": "Additional guarantee templates can be obtained from Zebracorp's Legal & Compliance department.",
        "expert_insight": "This points to a central resource for all guarantee-related documentation, ensuring consistency and proper legal review.",
        "confidence": 1.0,
        "justification": "Provides information on where to find additional guarantee templates.",
        "implication_company": "Centralizes access to standardized legal documents.",
        "implication_supplier": "Suppliers seeking other types of guarantees should contact Zebracorp's Legal & Compliance for templates.",
        "source_insight": "N/A",
        "text": "Other guarantee templates are available from Legal & Compliance."
      },
      "source_agent": "AGENT_5",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout B",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_5_prompt.txt"
      }
    },
    {
      "id": "720efcfe-25bc-43cd-87c2-9e8d287ca255",
      "content": {
        "id": "c1d2e3f4-a5b6-7890-1234-abcdef012359",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "Any deviations to these templates would need to be approved by Zebracorp Global Guarantee Center and/or Zebracorp Finance Legal.",
        "plain_text": "Any modifications to Zebracorp's guarantee templates require approval from the Zebracorp Global Guarantee Center and/or Zebracorp Finance Legal.",
        "expert_insight": "This is a strict control measure. Suppliers must understand that any changes to Zebracorp's standard templates are subject to high-level internal approval, making deviations difficult and time-consuming.",
        "confidence": 1.0,
        "conditions": "Deviations from Zebracorp's guarantee templates.",
        "justification": "Ensures legal and financial review of any non-standard guarantee wording, mitigating risk.",
        "implication_company": "Maintains control over the legal and financial implications of guarantee wording.",
        "implication_supplier": "Suppliers proposing changes to Zebracorp's guarantee templates must obtain specific internal approvals from Zebracorp.",
        "source_insight": "N/A",
        "text": "Any deviations to these templates would need to be approved by Zebracorp Global Guarantee Center and/or Zebracorp Finance Legal."
      },
      "source_agent": "AGENT_5",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout B",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_5_prompt.txt"
      }
    },
    {
      "id": "b3a31c12-d16e-48a9-ad5c-73cee9cbe38c",
      "content": {
        "id": "d2e3f4a5-b6c7-8901-2345-abcdef012360",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "Final guarantee documentation should be delivered to Zebracorp Global Guarantee Center which will keep track on existing guarantees and which will store the guarantees.",
        "plain_text": "Final guarantee documentation must be submitted to the Zebracorp Global Guarantee Center for tracking and storage.",
        "expert_insight": "This mandates a centralized repository for all guarantee documents, ensuring proper record-keeping and oversight. Suppliers must ensure correct submission to this center.",
        "confidence": 1.0,
        "conditions": "N/A",
        "justification": "Ensures centralized record-keeping, tracking, and storage of all guarantees.",
        "implication_company": "Facilitates effective management, monitoring, and retrieval of guarantee documentation.",
        "implication_supplier": "Suppliers are responsible for delivering final guarantee documents to the specified Zebracorp Global Guarantee Center.",
        "source_insight": "N/A",
        "text": "Final guarantee documentation should be delivered to Zebracorp Global Guarantee Center which will keep track on existing guarantees and which will store the guarantees."
      },
      "source_agent": "AGENT_5",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout B",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_5_prompt.txt"
      }
    }
  ]
}