{
  "batch_idx": 4,
  "input_sections": [
    {
      "id": "c_13",
      "header": "13.\tPRODUCT LIABILITY",
      "text_length": 657,
      "text": "13.\tPRODUCT LIABILITY\n13.1\tThe Supplier shall indemnify, defend and hold harmless Zebracorp (including its Affiliates) against claims, liabilities, actions, damages costs and expenses (including but not limited to attorney’s fees) incurred by Zebracorp, its Affiliates or their respective Customers or Contractors as a result of personal injury, death, or property damage attributable to the Licensed Products, the SaaS or any the Supplier’s acts or omissions of the Supplier. The Supplier shall not be liable for damages under this Clause Product Liability to the extent arising from the use of the Licensed Products or the SaaS outside the Documentation ."
    },
    {
      "id": "c_14",
      "header": "14.\tQUALITY ASSURANCE; SECURITY REQUIREMENTS",
      "text_length": 7297,
      "text": "14.\tQUALITY ASSURANCE; SECURITY REQUIREMENTS\n14.1\tSupplier shall have, and shall ensure that its sub-suppliers have, a management policy and quality management system (“QMS”) conforming to the latest requirements of ISO9001. The QMS shall ensure effective planning, management and control of performance and quality throughout the life cycle of products or services being provided hereunder.\n14.2\tZebracorp Supplier Requirements (\"Zebracorp specs\") is a set of requirements that Zebracorp sets for its supply chain. Zebracorp uses these requirements as a framework for audits and continuous supplier development and Supplier expressly confirms that it has received a copy of the Zebracorp specs.\n14.3\tSupplier shall use reasonable efforts to maintain its processes and practices consistent with the requirement defined in the Zebracorp specs to the extent applicable to Supplier under this Agreement.\n14.4\tSupplier shall establish and maintain business continuity management practices that comply with the requirements of the latest version of ISO22301.\n14.5\tSupplier shall have a systematic approach to protect itself and Zebracorp from disruptions in its business with Zebracorp. Supplier shall have plans and arrangements covering critical business operations and processes to ensure continuity of Supplier’s performance under the Agreement. Supplier undertakes to periodically test such plans. Zebracorp reserves the right to review Suppliers’ plans, mock test drill reports and the related documentation.\n14.6\tSupplier shall have a supplier base strategy and supplier base management for its sub-suppliers under this Agreement, based on short- and long-term business needs. Supplier shall manage its sub-suppliers according to a documented procedure and the requirements under this Agreement.\nSupplier shall continuously monitor the performance of its sub-suppliers using key performance indicators (e.g. product quality indexes, project metrics, assessment results, ratings, process reviews).\n14.7\tSupplier warrants that in the designing, developing, delivering and through the entire supply chain, all applicable national and international laws, directives, statutes (including but not limited to EU statutes) and regulations are diligently followed.\n14.8\tUpon Zebracorp’s request, Supplier agrees to implement a set of Key Performance Indicators (“KPIs”) to measure quality and delivery performance against targets, mutually defined by both Parties.  The request may be triggered by Zebracorp in case of repeating quality or delivery performance issues impacting Zebracorp’s schedule or end customers.\n14.9\tAUDIT\n14.9.1\tZebracorp, its Customers and their respective Contractors shall have the right, at its cost, following reasonable notice to Supplier and during normal business hours, to audit (at Supplier’s and/or Supplier sub-suppliers’ premises) and inspect the deliverables, facilities and quality control as well as other processes of Supplier in the performance of this Agreement, in order to determine the level of Supplier’s compliance with the Zebracorp specs and other standard industry practices and standards, where applicable, such as ISO 9001 and ISO 14001 (“Audit”).\nSupplier shall grant Zebracorp access to:\nSupplier’s premises (as applicable, Supplier sub-supplier’s premises) and shall make qualified personnel available for the duration of the Audit; and\nrecords pertinent to the audit, such as but not limited to, process documentation and defect logs, and project management risks logs\n14.9.2\tEach Audit will be documented by the Zebracorp Audit team in a report with Audit findings such as action items for improvements, non-conformances and collaboration.  Supplier agrees to initiate corrective actions to address the delayed action items, at a timeline agreed by both Parties, but not later than ninety (90) days from the date of the Audit report.  Zebracorp shall have the right to share the results of such Audit with its Customers.  Zebracorp, its Customers or their respective Contractors performing or otherwise becoming aware of any results of such Audit shall enter into confidentiality agreements providing adequate protection of any Confidential Information of Supplier disclosed during such Audit.  Supplier shall have a risk management policy and processes, defining how Supplier manages various types of risks such as, but not limited to, business risks, security, health and safety risks, fire.  The risk management processes shall promote proactive identification, analysis, control and monitoring of all types of risks.\n14.10\tFAILURE ANALYSIS\n14.10.1\tSupplier shall make a failure analysis for non-conforming Products and Services.\n14.10.2\tWhere Supplier discovers a quality problem in Supplier’s Products or Services which may have influence on reliability, safety, form, fit, and function of the Product, Supplier shall inform Zebracorp thereof in writing without delay.\n14.10.3\tUpon Zebracorp’s request, Supplier shall perform Root Cause Analysis/\nEscaped Defect Analysis (“RCA/EDA”) for any of the non-conforming Products and Services.  Zebracorp requires such analysis to be performed by the applicable subject matter expert (“SME”).  Supplier shall complete the RCA/EDA and share the result, including corrective and preventive action plan, with the Zebracorp representative within ten (10) calendar days unless agreed otherwise.  Zebracorp reserves the right to share the RCA/EDA result/report with its Customers.\n14.10.4\tUpon Zebracorp’s reasonable request, Supplier shall use Zebracorp’s tool to record, monitor and follow up on issues and problem status in Supplier’s performance of a RCA/EDA.  Zebracorp is responsible for providing users access to the tool for the Supplier.\n14.11\tRECORDS\n14.11.1\tSupplier shall keep product related records, including, but not limited to (i) product drawings and specifications (ii) requirement and design change histories (iii) product verification, qualification, validation, and release data (iv) minutes of the reviews/inspections and related data (v) test setup and data (vi) versioning data (vii) incoming material verification data (viii) product and production process setups verification data (ix) process capability report (x) rework performed (xi) process, materials and product failure analysis reports and (xii) production process data as applicable.\n14.11.2\tSupplier shall archive final testing pass records in a format that such records can be delivered without delay on Zebracorp’s request e.g. in order to forward such records to Zebracorp’s customer.\n14.11.3\tSupplier shall allow Zebracorp to inspect the records.\n14.11.4\tSupplier shall provide copies of such records on Zebracorp’s request.\n14.11.5\tSupplier shall retain final testing pass records for a period of ten (10) years from the final test or any legally required record retention period, whichever is longer.\n14.12\tThe Supplier warrants that it shall at all times strictly comply with the IT-security related requirements set out in Appendix “Security Requirements”. Upon Zebracorp’s request, the Supplier shall enter into negotiation on the establishment of further processes to ensure and/or enhance the IT-security of the Licensed Products and/or the participation of Supplier to programs relevant to such IT-security."
    },
    {
      "id": "c_15",
      "header": "15.\tCOMPLIANCE AND ETHICS",
      "text_length": 4146,
      "text": "15.\tCOMPLIANCE AND ETHICS\nFor the purposes of the following Clauses, the term \"Supplier\" shall include Supplier, its employees, officers, subcontractors, sub-suppliers or other representatives.\n15.1\tEach Party shall comply fully with all applicable laws, including international, national, regional and local laws, statutes, directives (EU or otherwise), decrees, orders, treaties and regulations. For the avoidance of doubt, compliance with this sub-section includes, but is not limited to, compliance with the United States Foreign Corrupt Practices Act and any other applicable legislation enacted to enforce or implement any international convention prohibiting bribery and corruption and anti-money laundering laws and regulations. Additionally, Supplier acknowledges that it has read and understands  the Responsible Business Alliance Code of Conduct as updated from time to time (“RBA Code of Conduct”) (available at http://www.responsiblebusiness.org/standards/code-ofconduct/) and undertakes to apply the standards set out in the RBA Code of Conduct as well as the Zebracorp 3rd Party Code of Conduct with respect to the performance of this Agreement.  Supplier acknowledges that Zebracorp has made available Zebracorp-specific sustainability requirements in addition to the RBA Code of Conduct as part of its Supplier Requirements, including access to online training relating to Zebracorp 3rd Party Code of Conduct.\n15.2\tNeither Party shall, directly or indirectly, offer, authorize, solicit, accept or give to any person, company or undertaking whatsoever, including any government official or employee (including Zebracorp employees) anything of value, including by not limited to any gift, entertainment or hospitality, which is intended or could be viewed to improperly influence the other Party’s employee or representative or to obtain or retain any business for or from Zebracorp or to gain any advantage in the conduct of business for Zebracorp.\n15.3\tSupplier agrees to keep accurate and complete records relating to the provision of Products and Services under this Agreement, including records relating to obtaining any government issued permits or authorizations and related correspondence, and to retain all such records for 10 (ten) years following the expiration or earlier termination of this Agreement or for any legally required record retention period, whichever is longer.\n15.4\tSupplier furthermore undertakes to report any perceived or actual conflict of interest it becomes aware of, both on Zebracorp’s and on Supplier’s side.  Supplier also agrees to report any non-routine contact by a government regulatory or law enforcement agency investigating or questioning Supplier’s conduct relating to the performance of this Agreement. Suppliers should in such cases contact Zebracorp Ethics & Compliance at ethics@zebracorp.com or https://zebracorpethics.alertline.com.\n15.5\tFailure by the Supplier to comply with the provisions of this Clause 15 shall be deemed to be a material breach of this Agreement by Supplier entitling Zebracorp to terminate this Agreement without any liability to Zebracorp.\n15.6\tSupplier agrees to permit Zebracorp or its authorized representatives to audit Supplier’s compliance with these clauses.  Supplier shall fully cooperate in any Zebracorp investigation or audit regarding its compliance with this Clause 15.\n15.7\tSupplier shall indemnify and hold Zebracorp, Zebracorp Affiliates, Customers, employees, officers, directors, shareholders, subcontractors or other representatives harmless from and against any claims, losses, damages, liabilities and costs arising out of, related to, or connected with Supplier’s or Supplier’s subcontractors’ failure to comply with any of the obligations set forth in this Agreement.\n15.8\tIn addition to the terms and conditions of this Agreement, the terms and conditions set out in Appendix “US Specific Provisions” shall apply to any purchases made by Zebracorp Affiliates located in the United States of America or, as applicable, to the extent any purchases made under this Agreement are made for the benefit of Zebracorp’s US based customers."
    },
    {
      "id": "c_16",
      "header": "16.\tMAINTENANCE AND SUPPORT",
      "text_length": 601,
      "text": "16.\tMAINTENANCE AND SUPPORT\n16.1\tThe Supplier shall provide Maintenance Services as set forth in this Clause and Appendix “Maintenance and Support Agreement (MSA)”.\n16.2\tThe Supplier warrants that ´the Maintenance Services, including but not limited to Error correction of Licensed Products and software support in general shall be available to Zebracorp (and its Affiliates) subject to and in accordance with the terms and conditions set forth in Appendix “Maintenance and Support Agreement” for a period of ten (10) consecutive years from the last delivery of a Licensed Product under this Agreement"
    },
    {
      "id": "c_17",
      "header": "17.\tCONFIDENTIALITY",
      "text_length": 2243,
      "text": "17.\tCONFIDENTIALITY\n17.1\tEach Party (\"Receiving Party\") shall not disclose to third parties nor use for any purpose other than for the proper fulfilment of this Agreement any technical or commercial information (\"Information\") received from the other Party (\"Disclosing Party\") in whatever form under or in connection with this Agreement without the prior written permission of the Disclosing Party except information which:\n(a)\tis in the public domain at the time of disclosure or later becomes part of the public domain through no fault of the Receiving Party; or\n(b)\twas known to the Receiving Party prior to disclosure by the Disclos¬ing Party as proven by the written records of the Receiving Party; or\n(c)\tis disclosed to the Receiving Party by a third party who did not obtain such Information, directly or indirectly, from the Disclosing Party;\n(d)\tor was independently developed (by personnel having no access to the Information) by the Receiving Party.\n17.2\tAny disclosure of Information to any third party under Clause 17.1 above shall further be subject to that third party having a need to know such Information for the Purpose and subject to that third party being prior to the disclosure of Information bound by written confidentiality undertakings no less stringent than the obligations imposed under this Agreement.\n17.3\tThe Supplier hereby expressly agrees, that the use of Zebracorp as reference, and/or the use of Zebracorp or reference to Zebracorp in the marketing or in any materials or activities of the Supplier in any manner is strictly forbidden. The Supplier shall not make any statements, announcements and/or press release of this Agreement or part thereof, or of the relationship of the Parties, without the express prior written consent of Zebracorp.\n17.4\tThe provisions of this Clause shall be valid for ten(10) years from the date of disclosure. Any Non-Disclosure Agreement(s) entered into between the Parties prior to the Effective Date of this Agreement shall remain to be valid, in accordance with its terms and conditions, in respect of the Information disclosed by either Party before the Effective Date of this Agreement, and in respect of the Information disclosed outside the scope of this Agreement."
    }
  ],
  "lexicon_size": 50,
  "lexicon": [
    {
      "id": "skip_1767371015998_ml5ui",
      "header": "Untagged Content",
      "type": "SKIP"
    },
    {
      "id": "h_1",
      "header": "CONTENTS",
      "type": "INFO"
    },
    {
      "id": "h_2",
      "header": "LIST OF APPENDICES",
      "type": "INFO"
    },
    {
      "id": "c_1",
      "header": "1.\tDEFINITIONS",
      "type": "CLAUSE"
    },
    {
      "id": "c_2",
      "header": "2.\tPURPOSE OF THIS AGREEMENT",
      "type": "CLAUSE"
    },
    {
      "id": "c_3",
      "header": "3.\tSTATEMENTS OF WORK",
      "type": "CLAUSE"
    },
    {
      "id": "c_4",
      "header": "4.\tGRANT OF LICENSES AND OTHER RIGHTS",
      "type": "CLAUSE"
    },
    {
      "id": "c_5",
      "header": "5.\tDELIVERY OF LICENSED PRODUCTS AND PROFESSIONAL SERVICES",
      "type": "CLAUSE"
    },
    {
      "id": "c_6",
      "header": "6.\tORDERING PROCEDURE",
      "type": "CLAUSE"
    },
    {
      "id": "c_7",
      "header": "7.\tINITIAL TESTING AND ACCEPTANCE",
      "type": "CLAUSE"
    },
    {
      "id": "c_8",
      "header": "8.\tDOCUMENTATION",
      "type": "CLAUSE"
    },
    {
      "id": "c_9",
      "header": "9.\tPAYMENTS",
      "type": "CLAUSE"
    },
    {
      "id": "c_10",
      "header": "10.\tWARRANTIES",
      "type": "CLAUSE"
    },
    {
      "id": "c_11",
      "header": "11.\tOPEN SOURCE SOFTWARE",
      "type": "CLAUSE"
    },
    {
      "id": "c_12",
      "header": "12.\tINTELLECTUAL PROPERTY RIGHTS",
      "type": "CLAUSE"
    },
    {
      "id": "c_13",
      "header": "13.\tPRODUCT LIABILITY",
      "type": "CLAUSE"
    },
    {
      "id": "c_14",
      "header": "14.\tQUALITY ASSURANCE; SECURITY REQUIREMENTS",
      "type": "CLAUSE"
    },
    {
      "id": "c_15",
      "header": "15.\tCOMPLIANCE AND ETHICS",
      "type": "CLAUSE"
    },
    {
      "id": "c_16",
      "header": "16.\tMAINTENANCE AND SUPPORT",
      "type": "CLAUSE"
    },
    {
      "id": "c_17",
      "header": "17.\tCONFIDENTIALITY",
      "type": "CLAUSE"
    },
    {
      "id": "c_18",
      "header": "18.\tTERM AND TERMINATION",
      "type": "CLAUSE"
    },
    {
      "id": "c_19",
      "header": "19.\tEFFECT OF TERMINATION",
      "type": "CLAUSE"
    },
    {
      "id": "c_20",
      "header": "20.\tFORCE MAJEURE AND DUTY TO INFORM",
      "type": "CLAUSE"
    },
    {
      "id": "c_21",
      "header": "21.\tEXPORT CONTROL AND CUSTOMS REQUIREMENTS",
      "type": "CLAUSE"
    },
    {
      "id": "c_22",
      "header": "22.\tLIMITATION OF LIABILITY AND INSURANCE",
      "type": "CLAUSE"
    },
    {
      "id": "c_23",
      "header": "23.\tSUBCONTRACTORS",
      "type": "CLAUSE"
    },
    {
      "id": "c_24",
      "header": "24.\tDATA PROTECTION",
      "type": "CLAUSE"
    },
    {
      "id": "c_25",
      "header": "25.\tFINAL PROVISIONS",
      "type": "CLAUSE"
    },
    {
      "id": "h_3",
      "header": "APPENDICES",
      "type": "INFO"
    },
    {
      "id": "a_1",
      "header": "PRODUCT APPENDIX",
      "type": "APPENDIX"
    },
    {
      "id": "a_2",
      "header": "Quality appendix - to be removed",
      "type": "APPENDIX"
    },
    {
      "id": "a_3",
      "header": "MAINTENANCE AND SUPPORT AGREEMENT",
      "type": "APPENDIX"
    },
    {
      "id": "c_26",
      "header": "2.\tPROVISION OF SERVICES",
      "type": "CLAUSE"
    },
    {
      "id": "c_27",
      "header": "3.\tCHANGES",
      "type": "CLAUSE"
    },
    {
      "id": "c_28",
      "header": "4.\tSERVICE-ORDERS",
      "type": "CLAUSE"
    },
    {
      "id": "c_29",
      "header": "5.\tINTENTIONALLY LEFT BLANK",
      "type": "CLAUSE"
    },
    {
      "id": "c_30",
      "header": "6.\tPRICES / INVOICING / PAYMENT",
      "type": "CLAUSE"
    },
    {
      "id": "c_31",
      "header": "7.\tINTELLECTUAL PROPERTY RIGHTS AND INDEMNIFICATION",
      "type": "CLAUSE"
    },
    {
      "id": "c_32",
      "header": "8.\tCONSEQUENCES OF DELAY",
      "type": "CLAUSE"
    },
    {
      "id": "c_33",
      "header": "9.\tWARRANTY FOR SERVICES",
      "type": "CLAUSE"
    },
    {
      "id": "c_34",
      "header": "10.\tSUPPORT OF VERSIONS AND SERVICEABILITY",
      "type": "CLAUSE"
    },
    {
      "id": "c_35",
      "header": "11.\tTOOLS, INTERFACES AND FORMS TO BE USED",
      "type": "CLAUSE"
    },
    {
      "id": "c_36",
      "header": "12.\tREVIEW MEETING",
      "type": "CLAUSE"
    },
    {
      "id": "c_37",
      "header": "13.\tMANAGEMENT ESCALATION",
      "type": "CLAUSE"
    },
    {
      "id": "c_38",
      "header": "14.\tCOMPATIBILITY MATRIX FOR SOFTWARE",
      "type": "CLAUSE"
    },
    {
      "id": "c_39",
      "header": "15.\tQUALITY AND PROTECTION OF ENVIRONMENT",
      "type": "CLAUSE"
    },
    {
      "id": "c_40",
      "header": "16.\tTERM OF MSA",
      "type": "CLAUSE"
    },
    {
      "id": "c_41",
      "header": "17.\tELECTRONIC DATA EXCHANGE",
      "type": "CLAUSE"
    },
    {
      "id": "c_42",
      "header": "18.\tMISCELLANEOUS",
      "type": "CLAUSE"
    },
    {
      "id": "ax_1",
      "header": "ANNEX SWSU – Maintenance and Support Agreement",
      "type": "ANNEX"
    }
  ],
  "llm_response_raw": "```json\n[\n  {\n    \"source_id\": \"c_13\",\n    \"source_header\": \"13.\\tPRODUCT LIABILITY\",\n    \"source_verbatim\": \"The Supplier shall not be liable for damages under this Clause Product Liability to the extent arising from the use of the Licensed Products or the SaaS outside the Documentation .\"\n  },\n  {\n    \"source_id\": \"c_13\",\n    \"source_header\": \"13.\\tPRODUCT LIABILITY\",\n    \"source_verbatim\": \"The Supplier shall not be liable for damages under this Clause Product Liability to the extent arising from the use of the Licensed Products or the SaaS outside the Documentation .\"\n  },\n  {\n    \"source_id\": \"c_14\",\n    \"source_header\": \"14.\\tQUALITY ASSURANCE; SECURITY REQUIREMENTS\",\n    \"source_verbatim\": \"The Supplier warrants that it shall at all times strictly comply with the IT-security related requirements set out in Appendix “Security Requirements”.\"\n  },\n  {\n    \"source_id\": \"c_15\",\n    \"source_header\": \"15.\\tCOMPLIANCE AND ETHICS\",\n    \"source_verbatim\": \"For the purposes of the following Clauses, the term \\\"Supplier\\\" shall include Supplier, its employees, officers, subcontractors, sub-suppliers or other representatives.\"\n  },\n  {\n    \"source_id\": \"c_15\",\n    \"source_header\": \"15.\\tCOMPLIANCE AND ETHICS\",\n    \"source_verbatim\": \"Failure by the Supplier to comply with the provisions of this Clause 15 shall be deemed to be a material breach of this Agreement by Supplier entitling Zebracorp to terminate this Agreement without any liability to Zebracorp.\"\n  },\n  {\n    \"source_id\": \"c_15\",\n    \"source_header\": \"15.\\tCOMPLIANCE AND ETHICS\",\n    \"source_verbatim\": \"Supplier agrees to permit Zebracorp or its authorized representatives to audit Supplier’s compliance with these clauses.\"\n  },\n  {\n    \"source_id\": \"c_15\",\n    \"source_header\": \"15.\\tCOMPLIANCE AND ETHICS\",\n    \"source_verbatim\": \"Supplier shall fully cooperate in any Zebracorp investigation or audit regarding its compliance with this Clause 15.\"\n  },\n  {\n    \"source_id\": \"c_15\",\n    \"source_header\": \"15.\\tCOMPLIANCE AND ETHICS\",\n    \"source_verbatim\": \"In addition to the terms and conditions of this Agreement, the terms and conditions set out in Appendix “US Specific Provisions” shall apply to any purchases made by Zebracorp Affiliates located in the United States of America or, as applicable, to the extent any purchases made under this Agreement are made for the benefit of Zebracorp’s US based customers.\"\n  },\n  {\n    \"source_id\": \"c_16\",\n    \"source_header\": \"16.\\tMAINTENANCE AND SUPPORT\",\n    \"source_verbatim\": \"The Supplier shall provide Maintenance Services as set forth in this Clause and Appendix “Maintenance and Support Agreement (MSA)”.\"\n  },\n  {\n    \"source_id\": \"c_16\",\n    \"source_header\": \"16.\\tMAINTENANCE AND SUPPORT\",\n    \"source_verbatim\": \"The Supplier shall provide Maintenance Services as set forth in this Clause and Appendix “Maintenance and Support Agreement (MSA)”.\"\n  },\n  {\n    \"source_id\": \"c_16\",\n    \"source_header\": \"16.\\tMAINTENANCE AND SUPPORT\",\n    \"source_verbatim\": \"The Supplier warrants that ´the Maintenance Services, including but not limited to Error correction of Licensed Products and software support in general shall be available to Zebracorp (and its Affiliates) subject to and in accordance with the terms and conditions set forth in Appendix “Maintenance and Support Agreement” for a period of ten (10) consecutive years from the last delivery of a Licensed Product under this Agreement\"\n  },\n  {\n    \"source_id\": \"c_17\",\n    \"source_header\": \"17.\\tCONFIDENTIALITY\",\n    \"source_verbatim\": \"Any disclosure of Information to any third party under Clause 17.1 above shall further be subject to that third party having a need to know such Information for the Purpose and subject to that third party being prior to the disclosure of Information bound by written confidentiality undertakings no less stringent than the obligations imposed under this Agreement.\"\n  },\n  {\n    \"source_id\": \"c_17\",\n    \"source_header\": \"17.\\tCONFIDENTIALITY\",\n    \"source_verbatim\": \"The provisions of this Clause shall be valid for ten(10) years from the date of disclosure.\"\n  }\n]\n```",
  "llm_response_length": 4110
}