{
  "batch_idx": 3,
  "input_sections": [
    {
      "id": "c_8",
      "header": "8.\tDOCUMENTATION",
      "text_length": 544,
      "text": "8.\tDOCUMENTATION\n8.1\tThe Supplier shall deliver the agreed number of the Documentation free of charge in an appropriate electronic format or as otherwise agreed between the Parties. The Supplier shall ensure that the Documentation will correspond to the latest technical state of the Licensed Products and the Results of Services, and the Supplier agrees to update such Documentation accordingly. Such updates shall identify any technical changes.\n8.2\tThe Supplier shall provide the Documentation in English, unless agreed otherwise in writing."
    },
    {
      "id": "c_9",
      "header": "9.\tPAYMENTS",
      "text_length": 5390,
      "text": "9.\tPAYMENTS\n9.1\tAny payments to be made for the Licensed Products, the Services and the rights and licenses granted hereunder are exclusively set out in the Products Appendix, and such payments shall be the sole and exclusive payments to be made by Zebracorp for the Licensed Product and the Services.\n9.2\tUnless agreed otherwise in the SOW and subject always to the provisions of this Agreement, the Supplier may invoice the license fees for the Licensed Products from Zebracorp after the customer acceptance and subject always to the receipt of a valid Order. Unless agreed otherwise in the SOW or the Maintenance and Support Agreement and subject always to the provisions of this Agreement, the Supplier may invoice any Services on a monthly basis subject always to the receipt of a valid Order for such Services from Zebracorp.\n9.3\tEach Supplier’s invoice shall contain information prescribed by the applicable statutory law provisions and following information: (i) the Order number specified in the relevant Order, (ii) the name of the Zebracorp requestor/contact person, (iii) payment term in accordance with the Agreement, (iv) description and the line-item split of Licensed Products and Services corresponding to the line-item split set forth in the Order, (v) bill-to and ship-to entity name, code and address set forth in the Order, (vi) correct tax codes and applicable jurisdiction (where applicable), (vii) Supplier’s relevant bank account identification. Unless otherwise instructed by Zebracorp or required by applicable local law regulations, Supplier shall submit the invoice in accordance with the terms of this Agreement and through Zebracorp’s electronic invoicing submission channels described in the Zebracorp P2P Supplier portal https://p2p.supplier.zebracorp.com/.  Supplier acknowledges that non-compliance with the foregoing content/process requirements may cause rejection of the non-compliant invoice by Zebracorp and/or delay in invoice handling / payment and in which case Zebracorp takes no liability for any delay in payment of such invoice.\n9.4\tTo the extent not inconsistent with mandatory provisions of the applicable law Supplier’s invoices shall mature for payment within ninety (90) days of receipt of a correct and undisputed invoice or acceptance of Licensed Products/Services, whichever occurs later and shall be paid according to Zebracorp Payments.\n9.5\tIf Zebracorp is overdue on any payment due under the Agreement and subject to Supplier’s written reminder of such, then the Supplier shall be entitled to claim interest on the overdue amount at an annual rate equal to one (1) percentage point above the Euro Interbank Offered Rate (EURIBOR) for Euro deposits offered for a one-month/one week period or a comparable period as shown at or about 11:00 a.m. (London time) by the applicable the European Securities and Market Authority (“ESMA”) Benchmark Administrator or by any successor for administration of the Euribor on the due date, which interest shall accrue on a monthly  basis from the date payment becomes overdue until the Supplier receives payment of the overdue amount.\n9.6\tAll amounts payable are gross amounts but exclusive only of any value added tax, sales tax or their equivalent. If any such tax is or will be chargeable, Zebracorp shall pay the tax to the Supplier and the Supplier shall provide Zebracorp with a tax invoice that meets all conditions necessary to allow Zebracorp to reclaim such tax. If according to applicable law or regulations Zebracorp is liable for any such tax, Zebracorp will account for or pay the tax to the tax authorities. Each Party agrees to comply with all tax laws applicable to transactions contemplated under this Agreement and each Party is responsible for all taxes (including, but not limited to, taxes based upon its income) or levies imposed on it under applicable laws, regulations and tax treaties as a result of any contract and any payments hereunder. In the event that a withholding tax is payable, Zebracorp shall be entitled to deduct the withholding tax from the payment to the Supplier as required under applicable laws, regulations and tax treaties. Upon request of the Supplier, Zebracorp agrees to furnish evidence of such paid taxes to the Supplier as is sufficient to enable the Supplier to obtain any tax credits available to it.\n9.7\tIf an Order under this Agreement is made by a US based Affiliate of Zebracorp, then notwithstanding the tax obligations as defined in Clause 9.6 above, for sales to US based Affiliate of Zebracorp, Supplier shall provide Zebracorp with a completed tax certification (e.g. Form W-9, applicable Form W-8 series form, or Form 8233, as appropriate) for federal income tax reporting purposes. In the event that the information provided on the submitted tax certification is or becomes incorrect, inaccurate or no longer valid, or if the tax certification expires, Supplier shall promptly notify Zebracorp no more than thirty (30) days from the date Supplier has actual knowledge or suspects such information must be modified and submit a new tax certification.  Failure to meet these requirements could result in a delay in payment.  Zebracorp shall have no liability to Supplier for late payments that result from Supplier’s failure to comply with this Clause.  Zebracorp shall have the right to audit Supplier’s compliance with this Clause."
    },
    {
      "id": "c_10",
      "header": "10.\tWARRANTIES",
      "text_length": 2689,
      "text": "10.\tWARRANTIES\n10.1\tGeneral\nThe Supplier represents and warrants that it has full rights and power to grant Zebracorp the rights set out in this Agreement.\n10.2\tLicensed Products\nThe Supplier warrants that the Licensed Products shall not contain any viruses or other malicious code. The Supplier further warrants that the Licensed Product shall for a period of 12 months from the date of customer acceptance (the “Warranty Period”) be free from Errors and strictly comply with the applicable Specifications and Quality Requirements and perform all functions described in the applicable Documentation.\nIf any Licensed Products fail to comply with the foregoing warranties, the Supplier shall at no cost to Zebracorp and without prejudice to any further rights of Zebracorp, without undue delay and no later than within the time periods agreed in Maintenance and Support Agreement, either deliver an Update, Upgrade or a complete new copy of the Licensed Product, which will not contain or which will remedy the Error or other deficiency. The Supplier warrants that new versions of Licensed Product(s) delivered to Zebracorp under this Agreement shall be compatible with the corresponding prior version(s) of such Licensed Product(s).\n10.3\tResults of Services\nUnless otherwise agreed in the SOW, the Supplier warrants that any Results of Services shall for a period of 12 months from the date of customer acceptance (“Warranty Period”) be free from any Errors and fit for the purpose for which they are intended. The Supplier further warrants that any Results of Services provided to Zebracorp hereunder shall at all times comply with the Legislative Requirements and all other relevant requirements, specifications, standards and other criteria set forth in this Agreement (and the Statement of Work).\nIf any Results of Services fails to comply with any of the foregoing warranties, the Supplier shall at no cost to Zebracorp at Zebracorp’s option and without prejudice to any further rights of Zebracorp rectify or replace any part of the Results of Services to fully satisfy the given warranties at the Supplier’s sole risk and expense within a reasonable time period specified by Zebracorp.\n10.4\tDocumentation\nSupplier warrants that the Documentation provided to Zebracorp hereunder is and always shall be up to date and complete, technically correct and can be used for the purposes set forth in this Agreement and that Supplier is entitled to grant the rights under the Documentation in accordance with the terms of this Agreement. If Documentation supplied by Supplier hereunder fails to conform to the foregoing warranty, Supplier shall correct the Documentation without undue delay."
    },
    {
      "id": "c_11",
      "header": "11.\tOPEN SOURCE SOFTWARE",
      "text_length": 3913,
      "text": "11.\tOPEN SOURCE SOFTWARE\n11.1\tSupplier shall provide to Zebracorp, in electronic format designed by Zebracorp, a list of Open Source Software contained in the Products provided under this Agreement.  Such list shall contain, with respect to each Open Source Software and any dependent components contained as parts of such Open Source Software the following information:\nthe component names of each Open Source Software,\nthe version of each Open Source Software component,\nthe name and version of all Open Source Software licenses governing each Open Source Software component,\nthe license text or link to the license terms and\nthe usage and nature of the Open Source Software\n11.2\tSupplier shall promptly provide an updated list to indicate any changes or additions to the Open Source Software, such as but not limited to updates to version numbers and newly added Open Source Software.  Any such updated list shall be deemed part of this Agreement.  In addition, Supplier shall provide Zebracorp with full and complete copyright and license notices applicable to any part of the Open Source Software included into the Products, in an appropriate format such that Zebracorp can, in turn, furnish the same copyright and license notices when distributing the Products.  Supplier represents and warrants that (a) the list provided pursuant to this Clause is a full and complete list, and (b) Supplier is in full compliance with the applicable license or licenses for the Open Source Software contained in the Products.\n11.3\tSupplier shall license Open Source Software to Zebracorp under the same license grant terms as were applicable to the Open Source Software when obtained by Supplier.  Notwithstanding anything stated in such applicable Open Source Software license terms, Supplier is not relieved from Warranties, Intellectual Property Rights indemnification or any other obligations under this Agreement for the Products and any disclaimers contained in such applicable Open Source Software license terms shall not limit such Warranties, Intellectual Property Rights indemnification or other obligations under this Agreement.  Supplier represents and warrants that the Open Source Software undertakings in this Clause 13 will be and have been met and the distribution of Open Source Software in the Products is in full compliance with the applicable license terms for the Open Source Software.\n11.4\tSupplier represents and warrants that Open Source Software in the Products are not used in a manner which could cause Zebracorp product(s) or any other software linked or communicating with the Products to be subject to any requirements or obligations arising from the Open Source Software licenses.\n11.5\tUpon Zebracorp’s request, Supplier shall provide to Zebracorp, within five (5) business days of such request, all source code including any scripts needed for compilation and/or execution of the Open Source Software included into the Products, including all software that becomes subject to Open Source Software licensing terms through linking or communicating with any other software. Such source code will be provided to Zebracorp in electronic format.\n11.6\tSupplier represents and warrants that:\n(a)\tOpen Source Software in the Products has been analyzed to ensure there are no incompatibilities between different Open Source Software licenses or between Open Source Software licenses and other licenses within the Product(s); and\n(b)\tProducts include no Open Source Software licensed under General Public License version 3 or Lesser General Public License version 3 or Affero GPL v 3 or any derivatives thereof.\n11.7\tSupplier shall indemnify Zebracorp against all damages, losses, penalties, compensation and expenses caused by any failure by Supplier to comply with this Clause 11 and shall defend Zebracorp against all actions, claims, demands and proceedings arising out of such failure to comply."
    },
    {
      "id": "c_12",
      "header": "12.\tINTELLECTUAL PROPERTY RIGHTS",
      "text_length": 6924,
      "text": "12.\tINTELLECTUAL PROPERTY RIGHTS\n12.1\tOwnership in Results of Services\nAll right, title and interest in and to all Intellectual Property Rights in or related to any Results of Services, shall vest in and become the sole and exclusive property of Zebracorp. If and to the extent it is impossible as a matter of law to transfer ownership in Intellectual Property Rights to Zebracorp, the Supplier hereby grants Zebracorp an exclusive, irrevocable, perpetual, transferable, fully paid-up, worldwide and unlimited right to use and exploit in any possible manner (including but not limited to the right to modify, copy, amend, translate, further develop, prepare derivative works of, distribute and sublicense) all Intellectual Property Rights pertaining to the Results of Services and warrants with respect to its representatives and any third party engaged to the performance of the Professional Services, that they will do the same.\n12.2\tZebracorp acknowledges that the copyright and ownership in any Results of Services produced by the Supplier prior to and in no relation to the execution of the Professional Services shall remain vested with the Supplier. The Supplier hereby grants Zebracorp an exclusive, irrevocable (except for uncured material breaches of this Agreement by Zebracorp), perpetual, transferable, fully paid-up, worldwide and unlimited right to use and exploit in any possible manner (including but not limited the right to modify, copy, amend, translate, further develop, prepare derivative works of, distribute and sublicense) all Intellectual Property Rights pertaining to the such pre-existing copyrights if and to the extent such pre-existing copyrights are necessary for Zebracorp for the purpose of exploiting the Results of Services procured pursuant to this Agreement and the Supplier warrants with respect to its representatives and any third party engaged to the performance of the Professional Services on behalf of the Supplier under this Agreement, that they will do the same.\n12.3\tNo Transfer of any Zebracorp Proprietary Rights\nNothing contained in this Agreement shall be deemed by implication or otherwise to transfer any Intellectual Property Rights of Zebracorp to the Supplier and Zebracorp shall continue to own all right, title and interest including, but not limited to, the Intellectual Property Rights in and to any Zebracorp Product. Zebracorp may adapt or have adapted the Licensed Products to operate in or in connection with Zebracorp Products or Customer products by inter alia creating or having created software interfaces and/or other Zebracorp proprietary interfaces or scripts and Zebracorp shall at all times own the Intellectual Property Rights in and to any such adaptations. To the extent and if not otherwise expressly agreed by the Parties, any customisation of any Customer product or Zebracorp Product is needed, all Intellectual Property Rights in and to such customisation shall be owned by Zebracorp. Ownership to any other customisation shall be agreed in the SOW on a case-by-case basis. If the SOW contains no provisions on ownership rights, the ownership of any such customisation shall at all times vest with Zebracorp.\nIn the event Zebracorp provides the Supplier with any designs or other specifications, the Supplier shall have a limited licence to use such designs and specifications only for the performance of its obligations towards Zebracorp under this Agreement and for no other purpose whatsoever.\n12.4\tIntellectual Property Rights Infringement and Indemnities\nThe Supplier represents and warrants that the Licensed Products, the SaaS, or the Results of Services do not infringe any Intellectual Property Right of any third party.\nThe Supplier shall indemnify, defend and hold harmless Zebracorp (and its Affiliates) at its own expense against any liabilities, claims, actions, damages, costs and expenses (including but not limited to attorney's fees and costs) incurred by Zebracorp, its Affiliates or their respective Customers or Contractors as a result  of infringement or alleged infringement of any Intellectual Property Rights of any third parties by the Licensed Products, the SaaS, the Results of Services or the use of or sale of such Licensed Products, the SaaS and/or Results of Services and/or  breach of Clause 11 (Open Source Software). Zebracorp shall (1) notify the Supplier of the allegation in writing and (2) upon Suppliers confirmation to defend, provide Supplier with the sole authority to defend such claim, provided that (a) Zebracorp shall have the right to have access to all necessary information to defend itself against the allegation as well as the right to select its own counsel to participate in any actions at the expense of Zebracorp (b) Supplier at all times takes into account the business interests of Zebracorp, its Affiliates and Customers in defending and settling such claim, and (c) Supplier shall obtain the prior written approval of Zebracorp, which approval shall not be unreasonably withheld, before entering into any settlement of such claim or ceasing to defend against such claim. Subject to Zebracorp defending the claim as set out above, Zebracorp shall cooperate with the Supplier, at the expense of the Supplier, in the defensive actions, as reasonably requested by the Supplier. Provided, however, that if the infringement relates to Results of Service, Supplier is only required to indemnify Zebracorp if the alleged infringement is related to Supplier’s work on the Results of Service.\n12.5\tNotwithstanding the Supplier's primary right to have control over defense, Zebracorp may take all necessary steps, at the expense of the Supplier, to defend itself until the Supplier, to the reasonable satisfaction of Zebracorp, assigns a counsel and initiates defense in a professional manner.\n12.6\tIn addition to what is set forth above in Clause 12.5, if Zebracorp's continued use of the Licensed Product, the SaaS and/or the Results of Services is restricted or threatened to be restricted as a result of any such claim, demand, suit or action alleging infringement, the Supplier shall (without limiting its indemnity obligation above) at its expense and at Zebracorp's request either (1) modify the Licensed Product, the SaaS and/or the Results of Services to avoid the allegation of infringement, while at the same time maintaining compliance of the Licensed Products, the SaaS and/or the Results of Services with the Specifications and other requirements of this Agreement, or (2) obtain for Zebracorp at no cost to Zebracorp a license to continue using and exploiting the Licensed Products, the SaaS and/or the Results of Services in accordance with this Agreement free of any liability or restriction.\n12.7\tIt is expressly agreed and understood that any claim under this Clause shall not become time-barred earlier than the corresponding third party claims giving reason to such claim."
    }
  ],
  "lexicon_size": 50,
  "lexicon": [
    {
      "id": "skip_1767377439218_f55m5",
      "header": "Untagged Content",
      "type": "SKIP"
    },
    {
      "id": "h_1",
      "header": "CONTENTS",
      "type": "INFO"
    },
    {
      "id": "h_2",
      "header": "LIST OF APPENDICES",
      "type": "INFO"
    },
    {
      "id": "c_1",
      "header": "1.\tDEFINITIONS",
      "type": "CLAUSE"
    },
    {
      "id": "c_2",
      "header": "2.\tPURPOSE OF THIS AGREEMENT",
      "type": "CLAUSE"
    },
    {
      "id": "c_3",
      "header": "3.\tSTATEMENTS OF WORK",
      "type": "CLAUSE"
    },
    {
      "id": "c_4",
      "header": "4.\tGRANT OF LICENSES AND OTHER RIGHTS",
      "type": "CLAUSE"
    },
    {
      "id": "c_5",
      "header": "5.\tDELIVERY OF LICENSED PRODUCTS AND PROFESSIONAL SERVICES",
      "type": "CLAUSE"
    },
    {
      "id": "c_6",
      "header": "6.\tORDERING PROCEDURE",
      "type": "CLAUSE"
    },
    {
      "id": "c_7",
      "header": "7.\tINITIAL TESTING AND ACCEPTANCE",
      "type": "CLAUSE"
    },
    {
      "id": "c_8",
      "header": "8.\tDOCUMENTATION",
      "type": "CLAUSE"
    },
    {
      "id": "c_9",
      "header": "9.\tPAYMENTS",
      "type": "CLAUSE"
    },
    {
      "id": "c_10",
      "header": "10.\tWARRANTIES",
      "type": "CLAUSE"
    },
    {
      "id": "c_11",
      "header": "11.\tOPEN SOURCE SOFTWARE",
      "type": "CLAUSE"
    },
    {
      "id": "c_12",
      "header": "12.\tINTELLECTUAL PROPERTY RIGHTS",
      "type": "CLAUSE"
    },
    {
      "id": "c_13",
      "header": "13.\tPRODUCT LIABILITY",
      "type": "CLAUSE"
    },
    {
      "id": "c_14",
      "header": "14.\tQUALITY ASSURANCE; SECURITY REQUIREMENTS",
      "type": "CLAUSE"
    },
    {
      "id": "c_15",
      "header": "15.\tCOMPLIANCE AND ETHICS",
      "type": "CLAUSE"
    },
    {
      "id": "c_16",
      "header": "16.\tMAINTENANCE AND SUPPORT",
      "type": "CLAUSE"
    },
    {
      "id": "c_17",
      "header": "17.\tCONFIDENTIALITY",
      "type": "CLAUSE"
    },
    {
      "id": "c_18",
      "header": "18.\tTERM AND TERMINATION",
      "type": "CLAUSE"
    },
    {
      "id": "c_19",
      "header": "19.\tEFFECT OF TERMINATION",
      "type": "CLAUSE"
    },
    {
      "id": "c_20",
      "header": "20.\tFORCE MAJEURE AND DUTY TO INFORM",
      "type": "CLAUSE"
    },
    {
      "id": "c_21",
      "header": "21.\tEXPORT CONTROL AND CUSTOMS REQUIREMENTS",
      "type": "CLAUSE"
    },
    {
      "id": "c_22",
      "header": "22.\tLIMITATION OF LIABILITY AND INSURANCE",
      "type": "CLAUSE"
    },
    {
      "id": "c_23",
      "header": "23.\tSUBCONTRACTORS",
      "type": "CLAUSE"
    },
    {
      "id": "c_24",
      "header": "24.\tDATA PROTECTION",
      "type": "CLAUSE"
    },
    {
      "id": "c_25",
      "header": "25.\tFINAL PROVISIONS",
      "type": "CLAUSE"
    },
    {
      "id": "h_3",
      "header": "APPENDICES",
      "type": "INFO"
    },
    {
      "id": "a_1",
      "header": "PRODUCT APPENDIX",
      "type": "APPENDIX"
    },
    {
      "id": "a_2",
      "header": "Quality appendix - to be removed",
      "type": "APPENDIX"
    },
    {
      "id": "a_3",
      "header": "MAINTENANCE AND SUPPORT AGREEMENT",
      "type": "APPENDIX"
    },
    {
      "id": "c_26",
      "header": "2.\tPROVISION OF SERVICES",
      "type": "CLAUSE"
    },
    {
      "id": "c_27",
      "header": "3.\tCHANGES",
      "type": "CLAUSE"
    },
    {
      "id": "c_28",
      "header": "4.\tSERVICE-ORDERS",
      "type": "CLAUSE"
    },
    {
      "id": "c_29",
      "header": "5.\tINTENTIONALLY LEFT BLANK",
      "type": "CLAUSE"
    },
    {
      "id": "c_30",
      "header": "6.\tPRICES / INVOICING / PAYMENT",
      "type": "CLAUSE"
    },
    {
      "id": "c_31",
      "header": "7.\tINTELLECTUAL PROPERTY RIGHTS AND INDEMNIFICATION",
      "type": "CLAUSE"
    },
    {
      "id": "c_32",
      "header": "8.\tCONSEQUENCES OF DELAY",
      "type": "CLAUSE"
    },
    {
      "id": "c_33",
      "header": "9.\tWARRANTY FOR SERVICES",
      "type": "CLAUSE"
    },
    {
      "id": "c_34",
      "header": "10.\tSUPPORT OF VERSIONS AND SERVICEABILITY",
      "type": "CLAUSE"
    },
    {
      "id": "c_35",
      "header": "11.\tTOOLS, INTERFACES AND FORMS TO BE USED",
      "type": "CLAUSE"
    },
    {
      "id": "c_36",
      "header": "12.\tREVIEW MEETING",
      "type": "CLAUSE"
    },
    {
      "id": "c_37",
      "header": "13.\tMANAGEMENT ESCALATION",
      "type": "CLAUSE"
    },
    {
      "id": "c_38",
      "header": "14.\tCOMPATIBILITY MATRIX FOR SOFTWARE",
      "type": "CLAUSE"
    },
    {
      "id": "c_39",
      "header": "15.\tQUALITY AND PROTECTION OF ENVIRONMENT",
      "type": "CLAUSE"
    },
    {
      "id": "c_40",
      "header": "16.\tTERM OF MSA",
      "type": "CLAUSE"
    },
    {
      "id": "c_41",
      "header": "17.\tELECTRONIC DATA EXCHANGE",
      "type": "CLAUSE"
    },
    {
      "id": "c_42",
      "header": "18.\tMISCELLANEOUS",
      "type": "CLAUSE"
    },
    {
      "id": "ax_1",
      "header": "ANNEX SWSU – Maintenance and Support Agreement",
      "type": "ANNEX"
    }
  ],
  "llm_response_raw": "```json\n[\n  {\n    \"source_id\": \"c_9\",\n    \"source_header\": \"9.\\tPAYMENTS\",\n    \"source_verbatim\": \"Any payments to be made for the Licensed Products, the Services and the rights and licenses granted hereunder are exclusively set out in the Products Appendix\"\n  },\n  {\n    \"source_id\": \"c_9\",\n    \"source_header\": \"9.\\tPAYMENTS\",\n    \"source_verbatim\": \"Unless agreed otherwise in the SOW and subject always to the provisions of this Agreement, the Supplier may invoice the license fees for the Licensed Products from Zebracorp after the customer acceptance and subject always to the receipt of a valid Order.\"\n  },\n  {\n    \"source_id\": \"c_9\",\n    \"source_header\": \"9.\\tPAYMENTS\",\n    \"source_verbatim\": \"Unless agreed otherwise in the SOW or the Maintenance and Support Agreement and subject always to the provisions of this Agreement, the Supplier may invoice any Services on a monthly basis subject always to the receipt of a valid Order for such Services from Zebracorp.\"\n  },\n  {\n    \"source_id\": \"c_9\",\n    \"source_header\": \"9.\\tPAYMENTS\",\n    \"source_verbatim\": \"Unless agreed otherwise in the SOW or the Maintenance and Support Agreement and subject always to the provisions of this Agreement, the Supplier may invoice any Services on a monthly basis subject always to the receipt of a valid Order for such Services from Zebracorp.\"\n  },\n  {\n    \"source_id\": \"c_9\",\n    \"source_header\": \"9.\\tPAYMENTS\",\n    \"source_verbatim\": \"If an Order under this Agreement is made by a US based Affiliate of Zebracorp, then notwithstanding the tax obligations as defined in Clause 9.6 above, for sales to US based Affiliate of Zebracorp, Supplier shall provide Zebracorp with a completed tax certification (e.g. Form W-9, applicable Form W-8 series form, or Form 8233, as appropriate) for federal income tax reporting purposes.\"\n  },\n  {\n    \"source_id\": \"c_10\",\n    \"source_header\": \"10.\\tWARRANTIES\",\n    \"source_verbatim\": \"If any Licensed Products fail to comply with the foregoing warranties, the Supplier shall at no cost to Zebracorp and without prejudice to any further rights of Zebracorp, without undue delay and no later than within the time periods agreed in Maintenance and Support Agreement, either deliver an Update, Upgrade or a complete new copy of the Licensed Product, which will not contain or which will remedy the Error or other deficiency.\"\n  },\n  {\n    \"source_id\": \"c_10\",\n    \"source_header\": \"10.\\tWARRANTIES\",\n    \"source_verbatim\": \"Unless otherwise agreed in the SOW, the Supplier warrants that any Results of Services shall for a period of 12 months from the date of customer acceptance (\\u201cWarranty Period\\u201d) be free from any Errors and fit for the purpose for which they are intended.\"\n  },\n  {\n    \"source_id\": \"c_10\",\n    \"source_header\": \"10.\\tWARRANTIES\",\n    \"source_verbatim\": \"The Supplier further warrants that any Results of Services provided to Zebracorp hereunder shall at all times comply with the Legislative Requirements and all other relevant requirements, specifications, standards and other criteria set forth in this Agreement (and the Statement of Work).\"\n  },\n  {\n    \"source_id\": \"c_11\",\n    \"source_header\": \"11.\\tOPEN SOURCE SOFTWARE\",\n    \"source_verbatim\": \"Supplier represents and warrants that the Open Source Software undertakings in this Clause 13 will be and have been met and the distribution of Open Source Software in the Products is in full compliance with the applicable license terms for the Open Source Software.\"\n  },\n  {\n    \"source_id\": \"c_11\",\n    \"source_header\": \"11.\\tOPEN SOURCE SOFTWARE\",\n    \"source_verbatim\": \"Supplier shall indemnify Zebracorp against all damages, losses, penalties, compensation and expenses caused by any failure by Supplier to comply with this Clause 11 and shall defend Zebracorp against all actions, claims, demands and proceedings arising out of such failure to comply.\"\n  },\n  {\n    \"source_id\": \"c_12\",\n    \"source_header\": \"12.\\tINTELLECTUAL PROPERTY RIGHTS\",\n    \"source_verbatim\": \"Ownership to any other customisation shall be agreed in the SOW on a case-by-case basis.\"\n  },\n  {\n    \"source_id\": \"c_12\",\n    \"source_header\": \"12.\\tINTELLECTUAL PROPERTY RIGHTS\",\n    \"source_verbatim\": \"If the SOW contains no provisions on ownership rights, the ownership of any such customisation shall at all times vest with Zebracorp.\"\n  },\n  {\n    \"source_id\": \"c_12\",\n    \"source_header\": \"12.\\tINTELLECTUAL PROPERTY RIGHTS\",\n    \"source_verbatim\": \"The Supplier shall indemnify, defend and hold harmless Zebracorp (and its Affiliates) at its own expense against any liabilities, claims, actions, damages, costs and expenses (including but not limited to attorney's fees and costs) incurred by Zebracorp, its Affiliates or their respective Customers or Contractors as a result of infringement or alleged infringement of any Intellectual Property Rights of any third parties by the Licensed Products, the SaaS, the Results of Services or the use of or sale of such Licensed Products, the SaaS and/or Results of Services and/or breach of Clause 11 (Open Source Software).\"\n  },\n  {\n    \"source_id\": \"c_12\",\n    \"source_header\": \"12.\\tINTELLECTUAL PROPERTY RIGHTS\",\n    \"source_verbatim\": \"In addition to what is set forth above in Clause 12.5, if Zebracorp's continued use of the Licensed Product, the SaaS and/or the Results of Services is restricted or threatened to be restricted as a result of any such claim, demand, suit or action alleging infringement, the Supplier shall (without limiting its indemnity obligation above) at its expense and at Zebracorp's request either (1) modify the Licensed Product, the SaaS and/or the Results of Services to avoid the allegation of infringement, while at the same time maintaining compliance of the Licensed Products, the SaaS and/or the Results of Services with the Specifications and other requirements of this Agreement, or (2) obtain for Zebracorp at no cost to Zebracorp a license to continue using and exploiting the Licensed Products, the SaaS and/or the Results of Services in accordance with this Agreement free of any liability or restriction.\"\n  }\n]\n```",
  "llm_response_length": 6110
}