[
  {
    "tag_id": "PROCUREMENT_CONTRACT_PLAYBOOK",
    "display_name": "Procurement Contract Playbook",
    "description": "A guide or manual outlining the processes, procedures, and best practices for procurement contracts within an organization."
  },
  {
    "tag_id": "ARBITRATION",
    "display_name": "Arbitration",
    "description": "A method of dispute resolution involving one or more neutral third parties who render a binding or non-binding decision."
  },
  {
    "tag_id": "DISPUTE_RESOLUTION",
    "display_name": "Dispute Resolution",
    "description": "The process of resolving conflicts or disagreements between parties, which may include negotiation, mediation, arbitration, or litigation."
  },
  {
    "tag_id": "ASSIGNMENT",
    "display_name": "Assignment",
    "description": "The transfer of rights, obligations, or duties under a contract from one party to another."
  },
  {
    "tag_id": "NOVATION",
    "display_name": "Novation",
    "description": "The act of replacing an obligation to perform with a new obligation; requires the consent of all parties."
  },
  {
    "tag_id": "CHANGE_OF_CONTROL",
    "display_name": "Change of Control",
    "description": "A change in the controlling ownership of a company, often triggering specific contractual provisions."
  },
  {
    "tag_id": "CONTRACT_INTERPRETATION",
    "display_name": "Contract Interpretation",
    "description": "The process of determining the meaning and legal effect of the terms of a contract."
  },
  {
    "tag_id": "LIABILITY_MITIGATION",
    "display_name": "Liability Mitigation",
    "description": "Actions taken to reduce or minimize potential legal or financial liabilities."
  },
  {
    "tag_id": "BEST_EFFORTS",
    "display_name": "Best Efforts",
    "description": "A contractual obligation requiring a party to make a diligent and reasonable effort to fulfill a commitment, but not necessarily guaranteeing success."
  },
  {
    "tag_id": "DUE_DILIGENCE",
    "display_name": "Due Diligence",
    "description": "The process of conducting a thorough investigation and analysis of a business or person prior to entering into a contract or agreement."
  },
  {
    "tag_id": "FORECASTING_LIABILITY",
    "display_name": "Forecasting Liability",
    "description": "The process of estimating and reporting potential liabilities based on forecasted demands and orders."
  },
  {
    "tag_id": "COMPONENT_MATERIAL_LIABILITY",
    "display_name": "Component/Material Liability",
    "description": "Liability related to costs incurred for components or materials ordered before a firm order is received or in anticipation of forecasted orders."
  }
]