[
  {
    "tag_id": "PROCUREMENT_CONTRACT",
    "display_name": "Procurement Contract",
    "description": "A contract related to the procurement of goods or services."
  },
  {
    "tag_id": "PLAYBOOK",
    "display_name": "Playbook",
    "description": "A guide or manual providing instructions and best practices."
  },
  {
    "tag_id": "INTERNAL_GUIDANCE",
    "display_name": "Internal Guidance",
    "description": "Document providing internal guidance, best practices, or policies for employees within an organization."
  },
  {
    "tag_id": "ASSIGNMENT_CLAUSE",
    "display_name": "Assignment Clause",
    "description": "A contractual provision that governs the transfer of rights, obligations, and duties under a contract to a third party."
  },
  {
    "tag_id": "NOVATION",
    "display_name": "Novation",
    "description": "The act of replacing an obligation to perform with a new obligation; replacing an old contract with a new one."
  },
  {
    "tag_id": "CHANGE_OF_CONTROL",
    "display_name": "Change of Control",
    "description": "A change in the controlling ownership of a company, often triggering specific contractual provisions."
  },
  {
    "tag_id": "CONTRACT_INTERPRETATION",
    "display_name": "Contract Interpretation",
    "description": "The process of determining the meaning of the terms and provisions of a contract."
  },
  {
    "tag_id": "LIABILITY_MITIGATION",
    "display_name": "Liability Mitigation",
    "description": "Actions taken to reduce or avoid potential legal liability."
  },
  {
    "tag_id": "BEST_EFFORTS_CLAUSE",
    "display_name": "Best Efforts Clause",
    "description": "A contractual provision that requires a party to use their best efforts to fulfill an obligation."
  },
  {
    "tag_id": "COMMERCIALLY_REASONABLE_EFFORTS",
    "display_name": "Commercially Reasonable Efforts",
    "description": "A standard of effort in contracts that requires a party to take actions that are reasonable and prudent in a commercial context to achieve a particular goal."
  },
  {
    "tag_id": "COMPONENT_LIABILITY",
    "display_name": "Component Liability",
    "description": "Liability related to the cost of components or materials purchased by a vendor in anticipation of orders that do not materialize."
  },
  {
    "tag_id": "CONFIDENTIALITY_CLAUSE",
    "display_name": "Confidentiality Clause",
    "description": "A contractual provision that protects sensitive information shared between parties."
  },
  {
    "tag_id": "NDA_MANAGEMENT",
    "display_name": "NDA Management",
    "description": "Practices and considerations for managing Non-Disclosure Agreements, including scope, purpose, and duration."
  },
  {
    "tag_id": "RESIDUAL_CLAUSE",
    "display_name": "Residual Clause",
    "description": "A clause in NDAs that allows the receiving party to use information retained in the unaided memory of its employees."
  },
  {
    "tag_id": "FEEDBACK_CLAUSE",
    "display_name": "Feedback Clause",
    "description": "A clause addressing the use of feedback provided by one party to another, particularly regarding products or services."
  },
  {
    "tag_id": "CONTAMINATION_RISK",
    "display_name": "Contamination Risk",
    "description": "The risk of a party receiving confidential information from a competitor, potentially leading to conflicts or unintentional use of that information."
  },
  {
    "tag_id": "CONSEQUENTIAL_DAMAGES",
    "display_name": "Consequential Damages",
    "description": "Damages claimed and/or awarded in a lawsuit which were caused by the actions of a party which were not the direct result of the act, but a consequence of the initial act."
  },
  {
    "tag_id": "INDIRECT_DAMAGES",
    "display_name": "Indirect Damages",
    "description": "Losses that are not directly caused by a breach of contract or tort, but are a consequence of it."
  },
  {
    "tag_id": "DISPUTE_RESOLUTION",
    "display_name": "Dispute Resolution",
    "description": "The process of resolving conflicts or disagreements between parties, often involving negotiation, mediation, arbitration, or litigation."
  },
  {
    "tag_id": "ARBITRATION",
    "display_name": "Arbitration",
    "description": "A method of dispute resolution involving one or more neutral third parties who render a binding decision."
  },
  {
    "tag_id": "GOVERNING_LAW",
    "display_name": "Governing Law",
    "description": "The jurisdiction whose laws will be applied to interpret and enforce a contract."
  },
  {
    "tag_id": "ENTIRE_AGREEMENT_CLAUSE",
    "display_name": "Entire Agreement Clause",
    "description": "A contractual provision stating that the written contract represents the complete and final agreement between the parties, superseding all prior agreements, understandings, and discussions."
  },
  {
    "tag_id": "ENVIRONMENTAL_COMPLIANCE",
    "display_name": "Environmental Compliance",
    "description": "Adherence to environmental laws, regulations, and standards related to products, materials, and disposal."
  },
  {
    "tag_id": "RECYCLING_OBLIGATIONS",
    "display_name": "Recycling Obligations",
    "description": "Responsibilities related to the collection, treatment, recovery, and environmentally sound disposal of products at the end of their life."
  },
  {
    "tag_id": "PRODUCT_RECALL",
    "display_name": "Product Recall",
    "description": "The process of retrieving defective or unsafe products from consumers or the market."
  },
  {
    "tag_id": "EPIDEMIC_FAILURE_CLAUSE",
    "display_name": "Epidemic Failure Clause",
    "description": "A contractual provision that defines the responsibilities and liabilities of a seller in the event of systematic or widespread defects in a product."
  },
  {
    "tag_id": "LIMITATION_OF_LIABILITY",
    "display_name": "Limitation of Liability",
    "description": "A clause that limits the amount or type of damages that one party can recover from the other in the event of a breach of contract."
  },
  {
    "tag_id": "REMEDIES",
    "display_name": "Remedies",
    "description": "Legal or equitable recourse available to a party for breach of contract or other legal wrong."
  },
  {
    "tag_id": "PUNITIVE_DAMAGES",
    "display_name": "Punitive Damages",
    "description": "Damages awarded to punish a defendant for egregious conduct, beyond compensating for actual losses."
  },
  {
    "tag_id": "EXEMPLARY_DAMAGES",
    "display_name": "Exemplary Damages",
    "description": "Damages awarded to punish a defendant for egregious conduct, beyond compensating for actual losses. (Synonymous with Punitive Damages)"
  },
  {
    "tag_id": "FORCE_MAJEURE",
    "display_name": "Force Majeure",
    "description": "A contract provision that allows a party to suspend or terminate the performance of its obligations when certain circumstances beyond their control arise, making performance impossible, commercially impracticable or, in some extreme cases, illegal."
  },
  {
    "tag_id": "GROSS_NEGLIGENCE",
    "display_name": "Gross Negligence",
    "description": "A heightened degree of negligence, often involving a conscious and voluntary act or omission showing reckless disregard for consequences."
  },
  {
    "tag_id": "GUARANTEE",
    "display_name": "Guarantee",
    "description": "A promise or assurance, especially one given in writing, that something is of a specified quality, content, benefit, or will perform satisfactorily."
  },
  {
    "tag_id": "ADVANCE_PAYMENT_GUARANTEE",
    "display_name": "Advance Payment Guarantee",
    "description": "A security provided by the supplier to the buyer to cover advance payments made by the buyer to the supplier."
  },
  {
    "tag_id": "PERFORMANCE_BOND",
    "display_name": "Performance Bond",
    "description": "A surety bond issued by a bank or other financial institution to guarantee satisfactory completion of a project by a contractor."
  },
  {
    "tag_id": "LETTER_OF_CREDIT",
    "display_name": "Letter of Credit",
    "description": "A document issued by a bank guaranteeing payment to a seller provided that certain terms and conditions have been met."
  },
  {
    "tag_id": "LEGAL_COMPLIANCE",
    "display_name": "Legal & Compliance",
    "description": "Relating to adherence to laws, regulations, guidelines, and specifications relevant to business operations and contracts."
  },
  {
    "tag_id": "INCIDENTAL_DAMAGES",
    "display_name": "Incidental Damages",
    "description": "Losses that are reasonably associated with or related to actual damages, often awarded as compensation for expenses incurred due to a breach of contract."
  },
  {
    "tag_id": "INCOTERMS",
    "display_name": "Incoterms",
    "description": "A set of international trade terms defining the responsibilities of sellers and buyers for the delivery of goods under sales contracts."
  },
  {
    "tag_id": "INDEMNIFICATION",
    "display_name": "Indemnification",
    "description": "A contractual obligation by which one party agrees to protect another party against losses or liabilities resulting from specified events or actions."
  },
  {
    "tag_id": "INTELLECTUAL_PROPERTY_RIGHTS",
    "display_name": "Intellectual Property Rights",
    "description": "Legal rights protecting creations of the mind, including inventions, literary and artistic works, designs, and symbols, names, and images used in commerce."
  },
  {
    "tag_id": "PRODUCT_LIABILITY",
    "display_name": "Product Liability",
    "description": "The legal liability of manufacturers, distributors, suppliers, retailers, and others for damages caused by defective products."
  },
  {
    "tag_id": "WARRANTY",
    "display_name": "Warranty",
    "description": "A guarantee or promise made by a seller concerning the quality, performance, or condition of goods or services."
  },
  {
    "tag_id": "INTELLECTUAL_PROPERTY_OWNERSHIP",
    "display_name": "Intellectual Property Ownership",
    "description": "The legal right to possess, control, and use intellectual property, including the right to exclude others."
  },
  {
    "tag_id": "INTELLECTUAL_PROPERTY_LICENSE",
    "display_name": "Intellectual Property License",
    "description": "A grant of rights from an intellectual property owner to another party, allowing them to use the IP under specific terms and conditions."
  },
  {
    "tag_id": "BACKGROUND_IP",
    "display_name": "Background IP",
    "description": "Pre-existing intellectual property owned by a party that is used in a project or agreement but is not created as part of that project."
  },
  {
    "tag_id": "FOREGROUND_IP",
    "display_name": "Foreground IP",
    "description": "Intellectual property created during a project or agreement, as opposed to pre-existing or background IP."
  },
  {
    "tag_id": "SUBLICENSE",
    "display_name": "Sublicense",
    "description": "A license granted by a licensee to a third party, derived from the original license granted by the licensor."
  },
  {
    "tag_id": "LICENSE_RESTRICTIONS",
    "display_name": "License Restrictions",
    "description": "Limitations or conditions placed on the use of licensed intellectual property, such as software or technology."
  },
  {
    "tag_id": "PERPETUAL_LICENSE",
    "display_name": "Perpetual License",
    "description": "A license that grants the licensee the right to use the software or technology indefinitely, without an expiration date, typically after a one-time payment."
  },
  {
    "tag_id": "TRANSFERABILITY",
    "display_name": "Transferability",
    "description": "The ability to assign or transfer a license from one party to another."
  },
  {
    "tag_id": "EXCLUSIVITY",
    "display_name": "Exclusivity",
    "description": "The condition of a license being exclusive, meaning the licensor cannot grant the same rights to other parties."
  },
  {
    "tag_id": "TERRITORIAL_RESTRICTIONS",
    "display_name": "Territorial Restrictions",
    "description": "Limitations on where a licensed product or technology can be used or distributed."
  },
  {
    "tag_id": "STATUTE_OF_LIMITATIONS",
    "display_name": "Statute of Limitations",
    "description": "A law that sets the maximum time after an event within which legal proceedings may be initiated."
  },
  {
    "tag_id": "INVOICE_SUBMISSION_DEADLINE",
    "display_name": "Invoice Submission Deadline",
    "description": "A contractual term specifying the final date by which an invoice must be submitted for payment."
  },
  {
    "tag_id": "LIQUIDATED_DAMAGES",
    "display_name": "Liquidated Damages",
    "description": "A specific sum of money, agreed upon in a contract, that is payable to an aggrieved party if the other party breaches certain provisions of the contract."
  },
  {
    "tag_id": "DIRECT_DAMAGES",
    "display_name": "Direct Damages",
    "description": "Damages that are a direct result of a breach of contract or tort."
  },
  {
    "tag_id": "BACK_TO_BACK_CONTRACTS",
    "display_name": "Back-to-Back Contracts",
    "description": "Contracts where the terms of a subcontract mirror the terms of the main contract, ensuring consistent obligations and liabilities."
  },
  {
    "tag_id": "SOLE_REMEDY",
    "display_name": "Sole Remedy",
    "description": "A contractual provision specifying that a particular remedy is the only recourse available to a party in the event of a breach."
  },
  {
    "tag_id": "NEGLIGENCE",
    "display_name": "Negligence",
    "description": "Failure to exercise the standard care that a reasonably prudent person would have exercised in a similar situation."
  },
  {
    "tag_id": "NON_COMPETITION",
    "display_name": "Non-Competition Clause",
    "description": "A contractual provision that restricts a party from engaging in competitive activities for a specified period and within a defined geographic area."
  },
  {
    "tag_id": "OPEN_SOURCE_SOFTWARE",
    "display_name": "Open Source Software",
    "description": "Software with source code that is available for modification and redistribution, often under specific license terms."
  },
  {
    "tag_id": "THIRD_PARTY_INFRINGEMENT",
    "display_name": "Third Party Infringement",
    "description": "Violation of intellectual property rights by an unrelated entity."
  },
  {
    "tag_id": "SOURCE_CODE_DISCLOSURE",
    "display_name": "Source Code Disclosure",
    "description": "Requirement to make the source code of software available, often associated with open source licenses."
  },
  {
    "tag_id": "PURCHASE_ORDERS",
    "display_name": "Purchase Orders",
    "description": "A document authorizing a purchase."
  },
  {
    "tag_id": "FINANCIAL_COMMITMENTS",
    "display_name": "Financial Commitments",
    "description": "Obligations to expend funds or resources in the future."
  },
  {
    "tag_id": "FORECAST_ACCURACY",
    "display_name": "Forecast Accuracy",
    "description": "The degree to which predicted future events or results match the actual events or results."
  },
  {
    "tag_id": "LIABILITY_FOR_UNCONSUMED_PRODUCTS",
    "display_name": "Liability for Unconsumed Products",
    "description": "Responsibility for costs associated with products or components that are not used or sold as anticipated."
  },
  {
    "tag_id": "INTERNAL_APPROVAL_PROCESS",
    "display_name": "Internal Approval Process",
    "description": "A defined procedure within an organization for obtaining authorization or consent for specific actions or decisions."
  },
  {
    "tag_id": "PRICING",
    "display_name": "Pricing",
    "description": "The method or strategy a business uses to set the price of its products or services."
  },
  {
    "tag_id": "PAYMENT_TERMS",
    "display_name": "Payment Terms",
    "description": "Conditions of a sale that specify when and how a customer must pay for goods or services."
  },
  {
    "tag_id": "LATE_PAYMENT_INTEREST",
    "display_name": "Late Payment Interest",
    "description": "Interest charged on overdue payments."
  },
  {
    "tag_id": "VALUE_ADDED_TAX",
    "display_name": "Value Added Tax",
    "description": "A consumption tax assessed on the value added to goods and services at each stage of production or distribution."
  },
  {
    "tag_id": "WITHHOLDING_TAX",
    "display_name": "Withholding Tax",
    "description": "A tax that is required to be withheld or deducted by the payer before making a payment to the payee."
  },
  {
    "tag_id": "SUBCONTRACTING",
    "display_name": "Subcontracting",
    "description": "The practice of hiring another company or individual to perform a specific task or project under a larger contract."
  },
  {
    "tag_id": "PRODUCT_SAFETY",
    "display_name": "Product Safety",
    "description": "Measures taken to ensure that products are safe for use and do not cause harm to consumers."
  },
  {
    "tag_id": "STRICT_LIABILITY",
    "display_name": "Strict Liability",
    "description": "Liability without the need to prove negligence; liability for any defect in a product that causes injury, even if the manufacturer was not negligent."
  },
  {
    "tag_id": "ANTITRUST_COMPLIANCE",
    "display_name": "Antitrust Compliance",
    "description": "Adherence to laws and regulations designed to promote fair competition and prevent monopolies or anti-competitive practices."
  },
  {
    "tag_id": "SEVERABILITY_CLAUSE",
    "display_name": "Severability Clause",
    "description": "A contractual provision stating that if one part of the contract is found to be invalid or unenforceable, the remaining parts will still be valid and enforceable."
  },
  {
    "tag_id": "SOFTWARE_LICENSE_AUDIT",
    "display_name": "Software License Audit",
    "description": "A process by which a software vendor verifies that a licensee is using the software in compliance with the terms of the license agreement."
  },
  {
    "tag_id": "TERMINATION",
    "display_name": "Termination",
    "description": "The act of ending a contract or agreement before its natural expiration."
  },
  {
    "tag_id": "WRONGFUL_TERMINATION",
    "display_name": "Wrongful Termination",
    "description": "Termination of a contract in violation of its terms or applicable law, giving the terminated party a right to seek damages."
  },
  {
    "tag_id": "MATERIAL_BREACH",
    "display_name": "Material Breach",
    "description": "A significant violation of a contract that defeats the purpose of the agreement."
  },
  {
    "tag_id": "TERMINATION_FOR_CONVENIENCE",
    "display_name": "Termination for Convenience",
    "description": "A clause allowing a party to terminate a contract without cause, subject to certain conditions."
  },
  {
    "tag_id": "TERMINATION_FOR_BREACH",
    "display_name": "Termination for Breach",
    "description": "The right of a non-breaching party to terminate a contract due to the other party's violation of its terms."
  },
  {
    "tag_id": "TERMINATION_FOR_INSOLVENCY",
    "display_name": "Termination for Insolvency",
    "description": "The right to terminate a contract if the other party becomes bankrupt or insolvent."
  },
  {
    "tag_id": "SURVIVAL_CLAUSE",
    "display_name": "Survival Clause",
    "description": "A contractual provision specifying which terms and conditions remain in effect after the termination or expiration of the agreement."
  },
  {
    "tag_id": "SOFTWARE_LICENSE_AGREEMENT",
    "display_name": "Software License Agreement",
    "description": "A contract that grants a user the right to use software under specific terms and conditions."
  },
  {
    "tag_id": "RAMP_DOWN_PERIOD",
    "display_name": "Ramp-Down Period",
    "description": "A period after termination during which certain activities or obligations continue, allowing for a gradual transition."
  },
  {
    "tag_id": "THIRD_PARTY_BENEFICIARIES",
    "display_name": "Third Party Beneficiaries",
    "description": "A clause that determines whether non-parties to a contract have rights to enforce contract terms."
  },
  {
    "tag_id": "WARRANTY_DISCLAIMER",
    "display_name": "Warranty Disclaimer",
    "description": "A statement that limits or excludes the seller's liability for the quality or performance of goods or services."
  }
]