{
  "section_id": "line_1766085084910_0c3pdppj2",
  "decisions": [
    {
      "id": "2691d46c-52f8-401c-baa4-635fbd5a6720",
      "is_valid": true,
      "decision_content": {
        "type": "GUIDELINE",
        "id": "zebracorp-guarantees-policy-001",
        "verbatim_text": "the main rule is that Zebracorp does not give guarantees to our suppliers to guarantee Zebracorp´s payments. This applies to bank guarantees, Letters of Credit and other such external guarantees as well as parent company guarantees.",
        "plain_text": "Zebracorp's primary policy is not to provide any form of guarantee (including bank guarantees, Letters of Credit, or parent company guarantees) to its suppliers for Zebracorp's payments.",
        "expert_insight": "This is a fundamental financial policy to limit Zebracorp's contingent liabilities and maintain a strong balance sheet. It also represents a core strategic negotiation stance. Deviations are highly scrutinized and require specific approvals.",
        "confidence": 1.0,
        "classification": "CRITICAL",
        "conditions": "None, this is the default rule.",
        "justification": "The rule is established because issuing guarantees would increase Zebracorp's financial liabilities and need to be recorded in financial accounts. It is explicitly stated as 'the main rule' and represents a core strategic position to avoid financial liabilities.",
        "implication_company": "Protects Zebracorp from increasing its financial liabilities and contingent obligations, simplifying negotiations and reducing financial risk.",
        "implication_supplier": "Suppliers cannot expect payment guarantees from Zebracorp and must conduct their own credit risk assessments; requests for such guarantees will likely be rejected.",
        "source_insight": "The text clearly outlines this as 'the main rule' and specifies the broad range of guarantee types covered by this policy."
      },
      "rationale": "Consensus Check: Agents were split between 'GUIDELINE' (Agent 1) and 'OTHER' (Agents 2, 3, 4). Tie-breaker: The phrase 'the main rule is that Zebracorp does not give guarantees' clearly establishes a directive for Zebracorp's conduct, creating a specific restriction/obligation. This aligns best with the 'GUIDELINE' type, as it dictates a core policy rather than merely providing information or a tactic without a binding element. Value Assessment: The text is clear, self-sufficient, and outlines a critical financial policy. The 'plain_text' is concise and accurate. Type-Specific Criteria: As a GUIDELINE, it is actionable ('Zebracorp does not give guarantees') and complete, specifying the types of guarantees covered. It is a fundamental policy, warranting a 'CRITICAL' classification. Utility Check: This finding is highly specific, helps in negotiation by setting clear expectations for suppliers, and protects the company by limiting financial liabilities. Therefore, it is a valid and important finding.",
      "decision_confidence": 1.0,
      "source_cluster_id": "4f4c15ff-4ab2-4251-9f99-98c09ea1117d",
      "supporting_evidence": [
        "b54cba37-bb17-45c2-9fb5-2f1060c78c01",
        "dcfe2f71-9afd-4b9b-86c3-517d72fabad9",
        "db00fbb4-0516-4062-ab87-8e54811821bd",
        "186b3844-c6a6-48af-a3ee-d111644f5031"
      ]
    },
    {
      "id": "bdfa1ece-d6d8-4193-b676-dfc30435a51e",
      "is_valid": true,
      "decision_content": {
        "type": "GUIDELINE",
        "id": "b2c3d4e5-f6a7-8901-2345-67890abcdef0",
        "verbatim_text": "Any exceptions to this will need to be handled as per Zebracorp Group Guarantee SOP and must be agreed with Zebracorp Global Guarantee Center.",
        "plain_text": "Any exceptions to Zebracorp's policy of not providing guarantees must be handled according to the Zebracorp Group Guarantee SOP and require agreement from the Zebracorp Global Guarantee Center.",
        "expert_insight": "This establishes a strict, centralized internal control mechanism for any deviation from Zebracorp's core 'no guarantee' policy, ensuring high-level approval, adherence to internal procedures, and mitigation of financial risk. It signals that exceptions are rare and subject to rigorous scrutiny.",
        "confidence": 1.0,
        "classification": "CRITICAL",
        "conditions": "Applies when an exception to Zebracorp's policy of not providing guarantees is being considered.",
        "justification": "Ensures rigorous internal control and consistency in managing financial liabilities for any exceptions to the no-guarantee policy, thereby mitigating financial risk.",
        "implication_company": "Zebracorp must adhere to a strict, centralized approval process and SOP for any guarantee issuance, mitigating unauthorized risk and ensuring robust internal governance.",
        "implication_supplier": "Suppliers seeking guarantees from Zebracorp will face a stringent internal approval process, indicating that exceptions are rare and difficult to obtain.",
        "source_insight": "Highlights the importance of internal governance and risk management for financial commitments, especially for deviations from standard policy, by mandating specific procedures and approvals."
      },
      "rationale": "Consensus Check: Three agents classified this as a GUIDELINE (Critical/High), while one classified it as OTHER (Instruction). The text uses mandatory language ('will need to be handled', 'must be agreed') to describe a specific internal process for managing exceptions to a core financial policy. This constitutes a binding rule for Zebracorp's internal operations regarding financial commitments, making 'GUIDELINE' the most appropriate classification over 'OTHER' (Instruction), which can sometimes imply less formal advice. Value Assessment: The plain_text correctly contextualizes 'this' to refer to 'Zebracorp's no-guarantee policy', making the finding self-sufficient. Type-Specific Criteria: As a GUIDELINE, it is actionable, creating a clear obligation for Zebracorp's internal departments. It is complete, specifying the SOP and the approving entity. It is a specific rule, not generic advice, and is critical for financial risk management. Utility Check: This is a highly specific and useful finding that clarifies internal governance for financial liabilities, protecting the company and informing potential suppliers about the strictness of obtaining guarantees. Therefore, it is accepted as a Critical Guideline.",
      "decision_confidence": 0.98,
      "source_cluster_id": "fc8949f8-267d-4eca-981c-6e8a869cf2e6",
      "supporting_evidence": [
        "ff1cbcce-0f17-49ac-803d-09e27c235d2d",
        "3d4f3962-15f1-4379-926a-8eb0d33b690c",
        "584ac1f5-0323-4c22-b564-0eee2e7116e0",
        "abf0c365-749b-4361-aeb2-060c042a4ba0"
      ]
    },
    {
      "id": "ea66deaf-209e-4971-a177-89dd9b8b8b1b",
      "is_valid": true,
      "decision_content": {
        "type": "GUIDELINE",
        "id": "a1b2c3d4-e5f6-7890-1234-567890abcdef",
        "verbatim_text": "In the event Zebracorp makes any advance payment or other prepayments to the supplier, Zebracorp may require a so called advance payment guarantee as a security from the supplier. The need for such advance payment guarantee depends on the value of the prepayment as well as other factors, and is ultimately decided by Procurement with F&C consultation.",
        "plain_text": "Zebracorp reserves the right to require an advance payment guarantee from a supplier when making advance payments or prepayments. The decision to require such a guarantee is made by Procurement in consultation with F&C, based on prepayment value and other factors.",
        "expert_insight": "This is a crucial risk mitigation tool for Zebracorp, protecting against supplier non-performance or insolvency after receiving advance payments. It outlines a standard strategy for Zebracorp to secure its upfront payments.",
        "confidence": 1.0,
        "classification": "HIGH",
        "conditions": "Applies when Zebracorp makes advance payments or prepayments to a supplier.",
        "justification": "The text establishes Zebracorp's right to demand security for advance payments and details the internal process for making this decision, making it a clear and actionable guideline for risk management.",
        "implication_company": "Zebracorp gains a mechanism to secure its advance payments, significantly mitigating financial risk associated with supplier non-performance or default.",
        "implication_supplier": "Suppliers receiving advance payments or prepayments from Zebracorp should be prepared to provide an advance payment guarantee, which may involve additional administrative effort or costs.",
        "source_insight": "The decision to require an advance payment guarantee is discretionary ('may require') and subject to an internal assessment by Procurement with F&C consultation, considering prepayment value and other factors."
      },
      "rationale": "Consensus Check: Three agents classified this as a GUIDELINE, while one classified it as OTHER (INFO). The text describes a specific action Zebracorp 'may require' and details the internal decision-making process ('ultimately decided by Procurement with F&C consultation'), which clearly establishes a right and an internal procedure, thus qualifying it as a GUIDELINE.\nValue Assessment: The verbatim text is self-sufficient, clearly stating the conditions, the potential action, its purpose, and the internal decision process. The plain text accurately summarizes this.\nType-Specific Criteria (GUIDELINE): It is actionable, creating a specific right for Zebracorp to demand security and outlining the internal steps. It is complete, capturing all relevant details from the source. It is a specific rule for financial risk mitigation, not generic advice, warranting a 'HIGH' classification.\nUtility Check: This item is highly specific and useful, providing clear guidance on Zebracorp's policy for securing advance payments, which is critical for financial risk management and helps both internal stakeholders and suppliers understand expectations.",
      "decision_confidence": 1.0,
      "source_cluster_id": "60d2d030-62bf-48b5-9b18-839b953445b6",
      "supporting_evidence": [
        "982100f8-9465-47b9-bd08-6fc7af9eed6f",
        "81c06487-d32f-4396-bfed-7f3227857e03",
        "57da390b-364f-4547-8cd6-9ee6ee2944a6",
        "4fcd0ba7-cb3e-4a81-acee-883e849a8456"
      ]
    },
    {
      "id": "82786a85-3af7-41dd-b87e-ca2b6a708e79",
      "is_valid": true,
      "decision_content": {
        "type": "GUIDELINE",
        "id": "d4e5f6a7-b8c9-0123-4567-890abcdef012",
        "verbatim_text": "Zebracorp may also from time to time require performance bonds or guarantees from certain of its subcontractors in particular for key customer projects where the customer of Zebracorp is requesting such guarantees, or where such guarantee is otherwise found to be necessary in order to secure the performance of subcontractor’s obligations.",
        "plain_text": "Zebracorp may require performance bonds or guarantees from subcontractors, especially for key customer projects where the customer requests them, or when deemed necessary to secure subcontractor performance.",
        "expert_insight": "This establishes Zebracorp's right to demand performance security from subcontractors, particularly when customer demands or project criticality necessitate it. This is crucial for managing project risk, fulfilling contractual obligations to end-customers, and protecting Zebracorp's interests in critical projects.",
        "confidence": 1.0,
        "classification": "HIGH",
        "conditions": "Applies to subcontractors, particularly for key customer projects where the customer of Zebracorp is requesting such guarantees, or when such guarantee is otherwise found to be necessary to secure the performance of subcontractor’s obligations.",
        "justification": "To secure subcontractor performance, meet customer requirements, and mitigate risks associated with subcontractor non-performance.",
        "implication_company": "Enables Zebracorp to secure subcontractor performance, manage project risks, and meet customer demands more effectively, especially for critical projects.",
        "implication_supplier": "Subcontractors working with Zebracorp, especially on key customer projects, should anticipate requests for performance bonds or guarantees, which may add to their obligations and costs.",
        "source_insight": "The text indicates a conditional right for Zebracorp to demand security, driven by both external customer demands and internal risk assessment for subcontractor performance."
      },
      "rationale": "Consensus: Mixed. Three agents classified it as 'GUIDELINE' and one as 'OTHER' (INFO). Evaluation: The phrase 'Zebracorp may also from time to time require...' indicates a specific discretionary right or policy for Zebracorp to demand certain securities under defined conditions. This constitutes an actionable rule or guideline rather than mere information. The text is clear, self-sufficient, and creates a specific right for Zebracorp, making it a valid GUIDELINE. The classification is HIGH due to its importance in securing performance for critical projects and meeting customer requirements. Passed all value and utility checks.",
      "decision_confidence": 0.95,
      "source_cluster_id": "507cd4c3-ef7c-49b0-b233-341b82a0a1bc",
      "supporting_evidence": [
        "66b34b48-adcb-4be3-8171-af2bc059280d",
        "5f391b63-3323-4ed4-b06f-8474ca04889d",
        "3a7721ba-65d3-4fe3-9009-577fc475c12a",
        "f11ef0f9-6e0a-4f9c-9275-3aa6c7cd73ba"
      ]
    },
    {
      "id": "b5531804-b0d9-4b68-962e-31e54127c37c",
      "is_valid": true,
      "decision_content": {
        "type": "GUIDELINE",
        "id": "e5f6a7b8-c9d0-1234-5678-90abcdef0123",
        "verbatim_text": "Any guarantee to be issued in favor of Zebracorp must be from an international bank acceptable to Zebracorp. Bank rating should be investment grade (BBB-) at minimum.",
        "plain_text": "Any guarantee provided to Zebracorp must originate from an international bank acceptable to Zebracorp, with a minimum investment grade rating of BBB-.",
        "expert_insight": "This guideline ensures the financial strength, reliability, and international standing of the guarantor, making the guarantee a credible and enforceable security instrument for Zebracorp. It sets a clear quality standard for financial institutions providing guarantees.",
        "confidence": 1.0,
        "classification": "CRITICAL",
        "conditions": "Applies to all guarantees issued in favor of Zebracorp.",
        "justification": "The text uses 'must be' and 'should be investment grade (BBB-) at minimum', establishing clear, mandatory standards for acceptable guarantors and their financial rating.",
        "implication_company": "Zebracorp ensures the quality, enforceability, and financial strength of guarantees received, thereby protecting its interests and mitigating financial risk.",
        "implication_supplier": "Suppliers are obligated to source guarantees from highly-rated, internationally recognized banks that are acceptable to Zebracorp, meeting the specified minimum investment grade rating.",
        "source_insight": "The phrase 'should be investment grade (BBB-) at minimum' functions as a mandatory requirement, not merely a suggestion, due to the explicit 'at minimum' qualifier."
      },
      "rationale": "Consensus: Mixed between GUIDELINE (3 agents) and OTHER (1 agent). The text clearly establishes a specific, mandatory requirement for the source and quality of guarantees issued in favor of Zebracorp, which aligns with the definition of a GUIDELINE. Value Assessment: The verbatim text is self-sufficient and provides clear, actionable criteria. Type-Specific Criteria: As a GUIDELINE, it is highly actionable, complete, and critical for ensuring the financial security and reliability of guarantees received by Zebracorp. Utility Check: This is a specific, protective rule that helps Zebracorp manage financial risk. Therefore, it is accepted as a Critical Guideline.",
      "decision_confidence": 1.0,
      "source_cluster_id": "e72d3da5-ca47-4891-8fcc-6fe688bb29ef",
      "supporting_evidence": [
        "ae1e4aef-16a2-493d-bdd9-e85fe97fd559",
        "0de18fe3-e0e7-42fe-b38a-470cc20396eb",
        "2a552f9f-cc37-4364-8522-fb6844064792",
        "86275e2e-44d7-45ae-993a-1515666a4d9c"
      ]
    },
    {
      "id": "3bb946fa-644c-4995-ab4a-1ac5ffa86ede",
      "is_valid": true,
      "decision_content": {
        "type": "GUIDELINE",
        "id": "f6a7b8c9-d0e1-2345-6789-0abcdef01234",
        "verbatim_text": "When using a corporate/parent company guarantees, it should however be noted that these are acceptable only if the credit rating of the issuing parent entity is BBB- at minimum.",
        "plain_text": "Corporate or parent company guarantees are only acceptable if the issuing parent entity has a credit rating of at least BBB-.",
        "expert_insight": "This is a critical financial safeguard. It ensures that if Zebracorp accepts a parent company guarantee, the parent entity itself is financially sound enough (BBB- minimum credit rating) to honor the guarantee, mitigating the risk of a worthless guarantee. This mirrors the financial standards applied to bank-issued guarantees.",
        "confidence": 1.0,
        "classification": "CRITICAL",
        "conditions": "Applies when Zebracorp considers accepting a corporate/parent company guarantee.",
        "justification": "To ensure the financial stability and reliability of the issuing parent company, thereby protecting Zebracorp from potential losses due to a non-performing guarantee.",
        "implication_company": "Zebracorp is protected by ensuring that parent company guarantees are backed by financially sound entities, reducing credit risk.",
        "implication_supplier": "A supplier's parent company must meet the minimum BBB- credit rating for its guarantee to be accepted by Zebracorp.",
        "source_insight": "The phrase 'acceptable only if' clearly defines a strict, mandatory condition for the acceptance of such guarantees."
      },
      "rationale": "Consensus: Mixed (GUIDELINE vs. OTHER). Evaluation: The verbatim text establishes a mandatory condition ('acceptable only if') for Zebracorp to accept corporate/parent company guarantees. This creates a specific obligation/restriction for Zebracorp and a clear requirement for the supplier, making it an actionable rule rather than generic advice. It passed the Clarity, Value, and Utility tests. Classified as a Critical Guideline due to its direct impact on financial risk and the validity of guarantees.",
      "decision_confidence": 1.0,
      "source_cluster_id": "d9ba0428-6a02-44e9-9dcf-ba0a1ece0a8c",
      "supporting_evidence": [
        "707aa8b3-2529-4361-87a0-300ebd63c4a3",
        "ba035692-7b44-4888-96e9-63095dd46777",
        "f5efa68f-7c3b-470e-8652-e20dadf7620c",
        "2e3ef269-393a-4e20-9ba8-b69893512bc1"
      ]
    },
    {
      "id": "b7bbed17-4b34-4d9b-8327-f9ada100abc6",
      "is_valid": true,
      "decision_content": {
        "type": "GUIDELINE",
        "id": "a7b8c9d0-e1f2-3456-7890-abcdef012345",
        "verbatim_text": "Also, for corporate/parent company guarantees Zebracorp´s model guarantee wordings should be used. The corporate/parent company guarantee should be under same applicable law as the supply agreement which is generally New York law. Other governing law provisions should be cleared with Legal and Compliance or Finance.",
        "plain_text": "For corporate/parent company guarantees, Zebracorp's model guarantee wordings should be used. The governing law for these guarantees should align with the supply agreement (generally New York law), and any deviations must be cleared with Legal and Compliance or Finance.",
        "expert_insight": "Standardized wording and governing law are crucial for legal certainty and enforceability, minimizing legal risks and ensuring consistency across agreements. Deviations require formal approval to maintain control.",
        "confidence": 1.0,
        "classification": "HIGH",
        "conditions": "Applies to corporate/parent company guarantees.",
        "justification": "Uses 'should be used' and 'should be under', indicating strong preference for standardization, with a mandatory clearance process for deviations ('should be cleared'). This ensures legal consistency and protects Zebracorp's interests.",
        "implication_company": "Ensures legal consistency and enforceability of guarantees, with internal review for any deviations, thereby mitigating legal and financial risks.",
        "implication_supplier": "Suppliers providing parent company guarantees must use Zebracorp's templates and generally accept New York law, or seek approval for alternatives from Zebracorp's Legal and Compliance or Finance departments.",
        "source_insight": "The 'should' implies a strong recommendation that becomes mandatory for deviations, highlighting Zebracorp's control over the terms of guarantees it accepts."
      },
      "rationale": "Consensus: Split between GUIDELINE (3 agents) and OTHER (1 agent). Evaluation: The text outlines specific obligations regarding the use of Zebracorp's model wordings, applicable law, and the process for clearing deviations for corporate/parent company guarantees. This clearly defines an actionable requirement, classifying it as a GUIDELINE. Candidate 1 provides the most complete and accurate verbatim text, covering all aspects of the rule. It passes the Clarity, Value, Necessity, and Utility checks, providing critical instructions for legal consistency and risk management. The classification is HIGH due to its direct impact on legal enforceability.",
      "decision_confidence": 1.0,
      "source_cluster_id": "47397d27-9eb1-49f5-9223-b41cd1db5f9d",
      "supporting_evidence": [
        "899f2f1a-a44e-4625-899d-24e234251864",
        "ec53a531-5d51-479b-af91-7221500211f6",
        "8a77e0fd-a9d1-45a1-a995-851a7f20d985",
        "dd148d3d-b3b4-4357-a722-45a730419a05"
      ]
    },
    {
      "id": "c8c0b667-253d-4f30-90c3-7ef4f49108c2",
      "is_valid": true,
      "decision_content": {
        "type": "GUIDELINE",
        "id": "a1b2c3d4-e5f6-7890-1234-567890abcdef",
        "verbatim_text": "As for bank guarantees/performance bonds, Zebracorp should only accept so called on-demand guarantees or stand-by Letters of Credit.",
        "plain_text": "For bank guarantees and performance bonds, Zebracorp will only accept on-demand guarantees or stand-by Letters of Credit.",
        "expert_insight": "This is a critical requirement ensuring that Zebracorp receives easily enforceable security. 'On-demand' guarantees and 'stand-by Letters of Credit' allow Zebracorp to claim against the guarantee immediately upon presentation of a demand, without needing to prove an underlying breach of contract, thereby significantly reducing risk and simplifying the enforcement process.",
        "confidence": 1.0,
        "classification": "CRITICAL",
        "conditions": "Applies when Zebracorp receives bank guarantees or performance bonds.",
        "justification": "The requirement ensures swift and unconditional enforceability of the guarantee, minimizing legal hurdles and providing immediate security without needing to prove default.",
        "implication_company": "Zebracorp benefits from stronger, more readily accessible, and easily enforceable security, reducing financial risk and legal complexities in case of a claim.",
        "implication_supplier": "Suppliers must ensure that any bank guarantees or performance bonds provided to Zebracorp are structured specifically as on-demand guarantees or stand-by Letters of Credit to meet Zebracorp's strict requirements.",
        "source_insight": "The phrase 'should only accept' indicates a strict, non-negotiable standard for the type of guarantee Zebracorp will receive, functioning as a mandatory requirement."
      },
      "rationale": "Consensus Check: Agents 1, 3, and 4 classified this as a GUIDELINE, while Agent 2 classified it as OTHER (Instruction). The phrase 'should only accept' indicates a specific, mandatory requirement for Zebracorp's actions regarding the type of guarantees it receives, which aligns perfectly with a GUIDELINE. Therefore, the type is GUIDELINE.\nValue Assessment: The verbatim text is clear and self-sufficient, requiring no additional context. It directly states a specific type of financial instrument Zebracorp will accept.\nType-Specific Criteria (GUIDELINE): This finding is highly actionable, creating a specific obligation for Zebracorp to only accept certain types of guarantees. It is not generic advice. The expert insights consistently highlight the critical importance of 'on-demand' guarantees for enforceability and risk mitigation, justifying a 'CRITICAL' classification.\nUtility Check: This is a specific, non-vague rule that directly helps Zebracorp protect its interests by ensuring easily enforceable security. It is highly valuable for negotiation and risk management.",
      "decision_confidence": 1.0,
      "source_cluster_id": "009795db-484b-446b-88e2-9164fd417a77",
      "supporting_evidence": [
        "d79a8ad1-d157-4a24-83dd-41d88ba6ba2c",
        "7e388c86-4bbb-4670-87d2-1105caf70b05",
        "5eee3692-62d6-46fe-ad60-4015b81c3fbc",
        "8780c02e-013d-4002-9407-8e7a63e29122"
      ]
    },
    {
      "id": "ab980bfc-c582-4f7b-962f-9a43c0440fa3",
      "is_valid": true,
      "decision_content": {
        "type": "GUIDELINE",
        "id": "c9d0e1f2-a3b4-5678-9012-abcdef012347",
        "verbatim_text": "Any deviations to these templates would need to be approved by Zebracorp Global Guarantee Center and/or Zebracorp Finance Legal.",
        "plain_text": "Any deviations from Zebracorp's standard guarantee templates must be approved by the Zebracorp Global Guarantee Center and/or Zebracorp Finance Legal.",
        "expert_insight": "This is a critical control measure to prevent unauthorized changes to legal documents. Deviations could introduce unforeseen risks or weaken the guarantee's enforceability. Centralized approval ensures legal and financial scrutiny, maintaining consistency and mitigating risks for Zebracorp.",
        "confidence": 1.0,
        "classification": "CRITICAL",
        "conditions": "Applies when any deviations from Zebracorp's standard guarantee templates are proposed.",
        "justification": "The requirement for approval ensures legal consistency, mitigates risks, and provides proper review of any changes to standard guarantee terms, as indicated by the mandatory phrase 'would need to be approved'.",
        "implication_company": "Zebracorp maintains strict control over the legal wording and terms of guarantees, ensuring consistency, risk mitigation, and proper vetting of non-standard terms through a centralized approval process.",
        "implication_supplier": "Suppliers proposing non-standard guarantee wordings or deviations from Zebracorp's templates must be aware of and account for the rigorous internal approval process required by Zebracorp, which may impact timelines.",
        "source_insight": "The phrase 'would need to be approved' clearly indicates a mandatory internal approval process for any non-standard guarantee documentation, reinforcing the importance of using standard templates."
      },
      "rationale": "Consensus: Split between GUIDELINE (3 agents) and OTHER (1 agent). Evaluation: The text 'would need to be approved' clearly establishes a mandatory obligation and a specific process for handling deviations from standard templates. This is an actionable rule that dictates a specific course of action and control, making it a GUIDELINE rather than just a general instruction. It passes the Value and Utility tests as it is clear, self-sufficient, specific, and critical for risk mitigation and legal consistency. Therefore, it is classified as a GUIDELINE.",
      "decision_confidence": 1.0,
      "source_cluster_id": "1e3fc87d-5e4c-47d4-b1e3-375d00adc5fa",
      "supporting_evidence": [
        "6ff47b95-b153-4288-95e1-a306cc2dbb77",
        "c3795a80-f2f2-4417-a24f-722dcffffce3",
        "d06fb1fb-0d0c-44b4-b6b3-febb57220d2f",
        "6c17f61e-aa75-41fd-9bd5-3f0358cd79b8"
      ]
    },
    {
      "id": "44da73db-a065-48bb-9d83-eab24903a511",
      "is_valid": true,
      "decision_content": {
        "type": "GUIDELINE",
        "id": "d0e1f2a3-b4c5-6789-0123-abcdef012348",
        "verbatim_text": "Final guarantee documentation should be delivered to Zebracorp Global Guarantee Center which will keep track on existing guarantees and which will store the guarantees.",
        "plain_text": "Final guarantee documentation must be delivered to the Zebracorp Global Guarantee Center for tracking and storage.",
        "expert_insight": "Centralized management of guarantees is essential for proper record-keeping, monitoring expiry dates, and ensuring easy access for enforcement and audit purposes, thereby mitigating operational and financial risk.",
        "confidence": 1.0,
        "classification": "HIGH",
        "conditions": "Applies to all final guarantee documentation.",
        "justification": "To ensure proper record-keeping, tracking, and central management of guarantees for audit and enforcement.",
        "implication_company": "Ensures centralized tracking and secure storage of all guarantees, improving risk management and compliance.",
        "implication_supplier": "Suppliers must ensure final guarantee documentation is correctly submitted to Zebracorp's Global Guarantee Center.",
        "source_insight": "While 'should' is used, the context of 'keep track' and 'store' makes this a critical operational requirement for proper governance of financial instruments."
      },
      "rationale": "Consensus Check: Agents were split between 'GUIDELINE' (3 agents) and 'OTHER' (1 agent). Tie-breaker decision: The verbatim text 'should be delivered' describes a specific, mandatory procedural action for handling critical financial documentation (guarantees), with clear operational implications (tracking and storage). This constitutes a specific obligation or rule for proper governance, making 'GUIDELINE' the most appropriate classification. Value Assessment: The plain text is clear and self-sufficient, capturing the action and its purpose. Type-Specific Criteria: The guideline is actionable, complete, and crucial for Zebracorp's risk management and compliance, thus warranting a 'HIGH' classification. Utility Check: This finding is highly specific and essential for protecting the company by ensuring proper record-keeping and oversight of financial instruments.",
      "decision_confidence": 1.0,
      "source_cluster_id": "f0914069-9b7c-417f-9821-a5e50b8dcc29",
      "supporting_evidence": [
        "4089322c-f5d5-4532-8080-cd0678573b87",
        "07346f6a-f4e4-4fea-a9db-0c888c126aae",
        "1a17e1c6-3ea9-4677-b2f0-b50a06afd964",
        "47883e81-b8f7-4980-ab18-a42629bb3920"
      ]
    },
    {
      "id": "4619d08c-e1bf-4583-bfeb-3c087f424182",
      "is_valid": true,
      "decision_content": {
        "type": "OTHER",
        "id": "2d9e0f3c-5a7b-4e1f-8c2d-9e0f3c5a7b4e",
        "verbatim_text": "Zebracorp is generally relying on its suppliers having conducted necessary credit risk assessments on Zebracorp contracting entity and having satisfied itself as to the creditworthiness of Zebracorp.",
        "plain_text": "Zebracorp expects its suppliers to conduct their own credit risk assessments on Zebracorp contracting entities and satisfy themselves as to Zebracorp's creditworthiness.",
        "expert_insight": "This statement sets a foundational expectation, shifting the burden of due diligence regarding Zebracorp's financial standing onto the supplier, and explains why Zebracorp generally does not provide guarantees.",
        "confidence": 1.0,
        "subtype": "INFO",
        "justification": "This provides Zebracorp's general stance and expectation regarding supplier due diligence, explaining its policy on not issuing guarantees.",
        "implication_company": "Zebracorp implicitly states it will not provide guarantees and expects suppliers to have done their homework, thereby reducing its financial liability and administrative burden.",
        "implication_supplier": "Suppliers must perform their own credit checks on Zebracorp and should not expect Zebracorp to provide guarantees.",
        "source_insight": "This is a passive but firm statement of policy, not a direct instruction or tactic, but informs the overall strategy regarding guarantees."
      },
      "rationale": "Consensus: All agents agreed on the type (OTHER) and subtype (INFO). Evaluation: The verbatim text is clear, self-sufficient, and provides essential context for Zebracorp's policy on guarantees. It explains Zebracorp's foundational expectation regarding supplier due diligence. It is not a guideline or definition, but rather a statement of principle that informs subsequent rules. The plain text accurately summarizes the intent. Passed Utility Check as it helps understand the rationale behind Zebracorp's guarantee policy. Classified as a critical piece of information.",
      "decision_confidence": 1.0,
      "source_cluster_id": "cee8ce9e-2706-49cb-904e-07c76a98685c",
      "supporting_evidence": [
        "ada400f5-d85a-433b-ad6d-e75dabbb4ed3",
        "c5cb00e8-3009-40d5-b9e0-7f072866e196",
        "409cb1ea-2c4f-4047-9773-75c3997192fc"
      ]
    },
    {
      "id": "fa3bfb6f-6ca5-41ca-940d-0ea5d5b6b788",
      "is_valid": true,
      "decision_content": {
        "type": "OTHER",
        "id": "golden_record_guarantees_financial_impact",
        "verbatim_text": "Any guarantee issued by Zebracorp would need to recorded in our financial accounts and would increase our financial liabilities.",
        "plain_text": "Issuing guarantees increases Zebracorp's financial liabilities and requires recording in its financial accounts.",
        "expert_insight": "This highlights the financial impact and accounting implications of Zebracorp issuing guarantees, providing a core rationale for its restrictive policy on providing guarantees to suppliers.",
        "confidence": 1.0,
        "subtype": "INFO",
        "justification": "Explains the financial burden and accounting requirements associated with Zebracorp issuing guarantees, which underpins its policy.",
        "implication_company": "Zebracorp incurs increased financial liabilities and administrative overhead when issuing guarantees, necessitating strict control over such commitments.",
        "implication_supplier": "Suppliers should understand the significant financial reasons that make Zebracorp reluctant to issue guarantees.",
        "source_insight": "This is a factual statement about financial consequences, directly informing Zebracorp's strategic decision-making regarding guarantees."
      },
      "rationale": "Consensus: All agents agree on 'OTHER' type with 'INFO' subtype. The verbatim text is identical across all candidates. Evaluation: The text clearly explains the financial implications (increased liabilities, accounting requirements) for Zebracorp when issuing guarantees. This serves as a crucial justification for Zebracorp's policy of generally not providing guarantees. It is self-sufficient and provides valuable context, passing the clarity and utility checks. The plain text accurately summarizes the verbatim content. Therefore, it is classified as a valid 'OTHER' (INFO) finding.",
      "decision_confidence": 1.0,
      "source_cluster_id": "6f86eaeb-f37f-476e-b9f2-4c686eb65696",
      "supporting_evidence": [
        "b0203fc3-7d91-4e81-a0f4-ff38fec6c718",
        "3b10e2f9-96bb-43cb-be0e-cecced5ca46b",
        "28c8b7f7-c465-436a-bd41-0b0a64062a2d"
      ]
    },
    {
      "id": "ba3043bc-e00f-45f8-bca5-1012ac0d6eaf",
      "is_valid": true,
      "decision_content": {
        "type": "OTHER",
        "id": "a7b8c9d0-e1f2-3456-7890-abcdef012345",
        "verbatim_text": "The need for such advance payment guarantee depends on the value of the prepayment as well as other factors, and is ultimately decided by Procurement with F&C consultation.",
        "plain_text": "The decision to require an advance payment guarantee is made by Procurement, in consultation with Finance & Control (F&C), based on the value of the prepayment and other factors.",
        "expert_insight": "This clarifies Zebracorp's internal decision-making process for requiring advance payment guarantees, indicating a structured, collaborative assessment by Procurement and Finance & Control based on specific factors.",
        "confidence": 0.98,
        "subtype": "INSTRUCTION",
        "justification": "Outlines the internal process and stakeholders involved in deciding whether to request an advance payment guarantee, emphasizing a risk-based assessment.",
        "implication_company": "Zebracorp has a defined, collaborative internal process for assessing and deciding on advance payment guarantees, ensuring risk mitigation is based on a joint assessment by Procurement and F&C.",
        "implication_supplier": "The requirement for an advance payment guarantee is not automatic and is subject to Zebracorp's internal assessment, which may be influenced by the prepayment value and other factors, potentially allowing for negotiation.",
        "source_insight": "Directly specifies the decision-makers and the factors influencing the requirement for an advance payment guarantee, detailing an internal operational instruction."
      },
      "rationale": "Consensus: All agents agreed on the verbatim text and classified it as 'OTHER'. There was a minor split on subtype (INSTRUCTION vs. INFO). Evaluation: The text describes an internal process and who is responsible for making a decision, making it an actionable internal 'INSTRUCTION' rather than just passive 'INFO'. It passes the Clarity & Context test as it is self-sufficient. It also passes the Utility Check by providing specific guidance on internal decision-making for advance payment guarantees. Therefore, it is classified as a valid 'OTHER' type with 'INSTRUCTION' subtype.",
      "decision_confidence": 0.98,
      "source_cluster_id": "020a6f36-d3b5-4e11-8c54-4c60bbd1ae41",
      "supporting_evidence": [
        "cdf1c5c1-e9f3-4c68-9903-12835706859a",
        "3895d7b4-b530-4fa6-869b-b8ecca770c25",
        "89aa8799-8b91-44ef-b82e-fd949d97faeb"
      ]
    },
    {
      "id": "27943bc1-119f-4f36-8502-ef2fefbb3ebb",
      "is_valid": true,
      "decision_content": {
        "type": "OTHER",
        "id": "f5a6b7c8-d9e0-1f2a-3b4c-5d6e7f8a9b0c",
        "verbatim_text": "A parent company guarantee may be preferred over a bank issued guarantee or bond due to the fact that guarantees/bonds issued by financial institutions carry a charge. This charge is often directly or indirectly passed on the prices paid by Zebracorp.",
        "plain_text": "Zebracorp may prefer parent company guarantees over bank-issued guarantees or bonds because financial institutions charge fees for their guarantees, which are often directly or indirectly passed on to the prices paid by Zebracorp.",
        "expert_insight": "This reveals a cost-saving tactic and strategic preference. Zebracorp favors parent company guarantees to avoid additional charges associated with bank-issued instruments, as these costs are typically passed on and would increase Zebracorp's expenses.",
        "confidence": 1.0,
        "subtype": "TACTIC",
        "justification": "Financial institutions charge fees for issuing guarantees/bonds, and these charges are often passed on to Zebracorp, increasing costs.",
        "implication_company": "Zebracorp aims to reduce costs by strategically favoring parent company guarantees over bank guarantees due to the associated charges.",
        "implication_supplier": "Suppliers should be aware that Zebracorp will likely encourage or prefer a parent company guarantee to avoid bank charges, which could influence the type of guarantee requested and potentially impact pricing.",
        "source_insight": "The text explicitly states a preference ('may be preferred') and provides a clear rationale ('due to the fact that guarantees/bonds issued by financial institutions carry a charge. This charge is often directly or indirectly passed on the prices paid by Zebracorp.')."
      },
      "rationale": "Consensus: All agents identified this as 'OTHER', with a split between 'TACTIC' and 'INFO'. The content describes a strategic preference driven by cost considerations, making 'TACTIC' the most appropriate subtype. Value Assessment: The verbatim text is clear, self-sufficient, and provides a valuable insight into Zebracorp's strategic preference for parent company guarantees due to cost implications. It passes the clarity and context checks. Type-Specific Criteria: As an 'OTHER' (Tactic), the plain text and expert insight clearly explain the 'what' (preference for parent company guarantees) and the 'why' (cost savings from avoiding bank charges). Utility Check: This finding is highly useful for understanding Zebracorp's negotiation strategy and cost-saving objectives regarding guarantees, making it a valid and important record.",
      "decision_confidence": 1.0,
      "source_cluster_id": "8b207187-b169-4b01-9735-6a2b04f3f3b7",
      "supporting_evidence": [
        "3db2265a-d6a7-4066-a671-0baafa8d828e",
        "0aba239c-ee2a-44c4-af4b-29a14c30b2d6",
        "64ae9da4-a4e9-478e-b1ec-b61fd80fb448"
      ]
    },
    {
      "id": "e33f2704-567a-44b8-b809-e0d302f3fb51",
      "is_valid": true,
      "decision_content": {
        "type": "GUIDELINE",
        "id": "f2a3b4c5-d6e7-8901-2345-67890abcdef0",
        "verbatim_text": "For this reason, the benefits of requesting supplier guarantees must be carefully assessed.",
        "plain_text": "Due to potential indirect costs often passed on by suppliers, Zebracorp must carefully assess the benefits of requesting supplier guarantees.",
        "expert_insight": "This is an internal instruction for Zebracorp personnel to perform a cost-benefit analysis before requiring guarantees. It acknowledges that such requirements can have hidden costs (often passed on by suppliers), ensuring that the security gained outweighs the potential indirect costs.",
        "confidence": 0.99,
        "classification": "MEDIUM",
        "conditions": "When considering requesting supplier guarantees.",
        "justification": "To ensure cost-effectiveness and avoid unnecessary charges, balancing risk mitigation with potential indirect costs.",
        "implication_company": "Zebracorp is obligated to conduct a thorough internal review and cost-benefit analysis before deciding to request a guarantee from a supplier.",
        "implication_supplier": "The request for a guarantee from Zebracorp is not automatic and is subject to an internal cost-benefit analysis, which may influence whether a guarantee is ultimately requested.",
        "source_insight": "The phrase 'For this reason' refers to the preceding sentence about charges being passed on to Zebracorp. The imperative 'must be carefully assessed' indicates a mandatory internal step."
      },
      "rationale": "Consensus: Split between 'OTHER' (Instruction) and 'GUIDELINE'. Decision: Classified as 'GUIDELINE' because it establishes a specific, mandatory internal rule or obligation for Zebracorp's conduct when considering supplier guarantees, which directly impacts contractual decisions. It is not merely generic advice. Value Assessment: The plain_text is contextualized by incorporating the 'reason' (potential indirect costs passed on by suppliers) from the source text, making it self-sufficient. Type-Specific Criteria: It is actionable, creating an obligation for Zebracorp to perform an assessment. The 'MEDIUM' classification is appropriate for an internal process impacting cost efficiency. Utility Check: The finding is specific and helps protect the company by ensuring cost-effectiveness.",
      "decision_confidence": 0.99,
      "source_cluster_id": "ecc7d57f-47bf-4fa9-b509-59a0745e3929",
      "supporting_evidence": [
        "bb002d79-b1f1-43c7-b15d-d3965e589054",
        "a739722a-04b9-44b5-ba8f-94e9dd61ce1f",
        "76be9ca6-2139-4351-a573-e046c6dd283e"
      ]
    },
    {
      "id": "a1fea070-0ac3-46fa-b4cf-63302004ddf6",
      "is_valid": true,
      "decision_content": {
        "type": "OTHER",
        "id": "n3o4p5q6-r7s8-t9u0-v1w2-x3y4z5a6b7c8",
        "verbatim_text": "The corporate/parent company guarantee should be under same applicable law as the supply agreement which is generally New York law. Other governing law provisions should be cleared with Legal and Compliance or Finance.",
        "plain_text": "Corporate/parent company guarantees should generally be governed by New York law, consistent with the supply agreement. Any deviations require clearance from Legal and Compliance or Finance.",
        "expert_insight": "This ensures legal consistency across related agreements and centralizes the review process for any deviations, maintaining legal control and mitigating risks associated with conflicting jurisdictions.",
        "confidence": 1.0,
        "subtype": "INSTRUCTION",
        "justification": "Specifies the preferred governing law for guarantees and outlines the internal approval process for any deviations, ensuring legal consistency and controlled risk.",
        "implication_company": "Zebracorp ensures legal consistency across agreements and maintains a clear, centralized process for reviewing and approving exceptions to governing law, mitigating legal risks.",
        "implication_supplier": "Suppliers providing corporate/parent company guarantees should expect New York law to govern, aligning with the supply agreement. Any proposal for a different governing law will require Zebracorp's internal approval process.",
        "source_insight": "The text combines a general rule ('generally New York law') with a mandatory internal process for exceptions ('should be cleared'), making it an instruction on how to manage governing law for these guarantees."
      },
      "rationale": "Consensus: Split between GUIDELINE (2 agents) and OTHER (1 agent). Evaluation: The verbatim text from Candidate 1 is the most complete, encompassing both a specific requirement for the governing law of corporate/parent company guarantees ('should be under same applicable law as the supply agreement which is generally New York law') and a mandatory internal process for handling deviations ('Other governing law provisions should be cleared with Legal and Compliance or Finance'). This combination describes a procedural instruction for managing the governing law aspect of these guarantees, making 'OTHER' with 'INSTRUCTION' the most appropriate classification for the entire statement. The finding is clear, actionable, self-sufficient, and provides critical guidance on legal consistency and internal approval processes. Passed all value and utility checks.",
      "decision_confidence": 0.95,
      "source_cluster_id": "7be3184a-13cd-486b-8838-0c432560b393",
      "supporting_evidence": [
        "4c83ba72-aa4a-4a3f-b894-3eaf166f47b8",
        "7ca5f36d-efb4-4fb0-94ae-04c70a5fba22",
        "807940dc-5098-4276-b5e4-bc060daf1771"
      ]
    },
    {
      "id": "5d207271-ec9c-4481-86f3-2a3cdb094fcd",
      "is_valid": true,
      "decision_content": {
        "type": "OTHER",
        "id": "consolidated-guarantee-templates-info",
        "verbatim_text": "A template for an Advance Payment Guarantee can be found below. Other guarantee templates are available from Legal & Compliance.",
        "plain_text": "Templates for Advance Payment Guarantees and other guarantee templates are available from Zebracorp's Legal & Compliance department.",
        "expert_insight": "This informs internal teams and relevant stakeholders about the availability of standardized templates for various guarantees, promoting consistency and efficiency in documentation and ensuring adherence to Zebracorp's preferred wording and formats.",
        "confidence": 1.0,
        "subtype": "INFO",
        "justification": "Provides information on the availability of standard templates for guarantees, which is crucial for consistent documentation.",
        "implication_company": "Zebracorp has standardized templates available to streamline the process of obtaining guarantees, ensuring consistency and compliance with internal standards.",
        "implication_supplier": "Suppliers may be provided with Zebracorp's standard templates for guarantees, or directed to Zebracorp's Legal & Compliance department for other required templates.",
        "source_insight": "This statement directly indicates where to find official guarantee templates, serving as a practical resource for users of the document."
      },
      "rationale": "Consensus: All agents agreed on the 'OTHER' type with 'INFO' subtype. Value Assessment: The verbatim text provides clear, self-sufficient information about the availability of standardized guarantee templates. It passes the 'So What?' test by offering practical guidance for internal teams and suppliers. Type-Specific Criteria: As 'INFO', it effectively contextualizes the availability of resources. Utility Check: This information is highly useful for ensuring consistency in documentation and adherence to Zebracorp's standards, aiding in negotiation and compliance. The 'plain_text' has been refined for conciseness and clarity.",
      "decision_confidence": 0.98,
      "source_cluster_id": "891ee1b1-6913-47e2-87af-23ac00704c8b",
      "supporting_evidence": [
        "336940b9-e4cb-4ea1-b1c3-64d455b5bd62",
        "a9a2ab5f-954e-46bd-9389-d89881beae60",
        "3c22d4b7-3c2c-4c49-b360-dad6b42389a8"
      ]
    },
    {
      "id": "9d781e81-bdca-44b2-b55f-140deaccbf20",
      "is_valid": true,
      "decision_content": {
        "type": "GUIDELINE",
        "id": "c3d4e5f6-a7b8-9012-3456-7890abcdef01",
        "verbatim_text": "For these reasons, the main rule is that Zebracorp does not give guarantees to our suppliers to guarantee Zebracorp´s payments.",
        "plain_text": "Zebracorp's primary policy is not to provide guarantees to suppliers for Zebracorp's payments.",
        "expert_insight": "This is a fundamental policy statement. Companies should strictly adhere to this to avoid increasing financial liabilities and to maintain financial discipline. It sets a strong precedent and is crucial for managing supplier expectations and contract negotiations.",
        "confidence": 1.0,
        "classification": "CRITICAL",
        "conditions": "N/A",
        "justification": "Based on the need for suppliers to conduct credit assessments on Zebracorp and the financial implications of issuing guarantees, which would increase Zebracorp's financial liabilities.",
        "implication_company": "Minimizes financial liabilities, reduces financial risk, and administrative overhead for Zebracorp.",
        "implication_supplier": "Suppliers cannot rely on Zebracorp guarantees for payment security and must rely on their own credit assessments.",
        "source_insight": "Explicitly stated as 'the main rule' in the source text."
      },
      "rationale": "Consensus: Both agents agree on the type (GUIDELINE) and classification (CRITICAL). Evaluation: The finding is a clear, actionable policy statement from Zebracorp regarding not issuing guarantees for its own payments. The 'plain_text' is self-sufficient in stating the rule, and the 'justification' adequately explains the context ('For these reasons') by referencing the need for supplier credit assessments and financial implications. It passes the Value and Utility checks as it defines a critical company policy that impacts financial liability and supplier relations. Therefore, classified as a Critical Guideline.",
      "decision_confidence": 1.0,
      "source_cluster_id": "c0cf0d12-9d58-4e77-9b16-577133675124",
      "supporting_evidence": [
        "427803e1-a625-4016-aa4a-1da02b22d4ab",
        "5b7b9867-5999-45a6-8ee0-3792a2a4f376"
      ]
    },
    {
      "id": "f8827975-594e-44d7-b3f4-09becd319d41",
      "is_valid": true,
      "decision_content": {
        "type": "GUIDELINE",
        "id": "d0e1f2a3-b4c5-6789-0123-4567890abcde",
        "verbatim_text": "Bank rating should be investment grade (BBB-) at minimum.",
        "plain_text": "The issuing bank for a guarantee must have a minimum investment grade rating of BBB-.",
        "expert_insight": "This sets a clear, objective standard for the financial strength of banks issuing guarantees to Zebracorp, requiring a minimum investment grade rating of BBB-. It is a critical risk control measure, ensuring the financial stability and reliability of the guarantor.",
        "confidence": 1.0,
        "classification": "HIGH",
        "conditions": "When a bank issues a guarantee in favor of Zebracorp.",
        "justification": "To ensure the financial stability and credibility of the bank issuing the guarantee, thereby minimizing the risk of the guarantee issuer defaulting.",
        "implication_company": "Zebracorp ensures that guarantees are backed by financially sound institutions, enhancing the security of the guarantee.",
        "implication_supplier": "Suppliers must ensure their chosen bank for issuing guarantees meets Zebracorp's minimum credit rating requirement of BBB-.",
        "source_insight": "The text uses 'should be' in a prescriptive manner, indicating a mandatory requirement for bank ratings for guarantees issued in favor of Zebracorp, following the statement that the bank 'must be acceptable'."
      },
      "rationale": "Consensus: Both agents agreed on the type (GUIDELINE) and classification (HIGH), and provided identical verbatim and plain text. Evaluation: The finding is actionable, establishing a specific, quantifiable minimum credit rating for banks issuing guarantees to Zebracorp. The plain text is self-sufficient and accurately reflects the requirement. Passed Value and Utility tests. Classified as a Critical Guideline.",
      "decision_confidence": 1.0,
      "source_cluster_id": "1729929a-9c91-4291-92fb-56dae06b291f",
      "supporting_evidence": [
        "a8183cab-77d3-4fc6-8c7b-8056d7ceebc0",
        "74491ddd-3ec5-41f6-b0b6-5e8a27a0edd5"
      ]
    },
    {
      "id": "9915e4e1-3de7-4fe5-b2fb-bfb880b11986",
      "is_valid": true,
      "decision_content": {
        "type": "GUIDELINE",
        "id": "a1b2c3d4-e5f6-7890-1234-567890abcdef",
        "verbatim_text": "Other governing law provisions should be cleared with Legal and Compliance or Finance.",
        "plain_text": "Any governing law provisions other than New York law for guarantees must be approved by Zebracorp's Legal and Compliance or Finance departments.",
        "expert_insight": "This acts as a control point for any deviations from the preferred governing law, ensuring that legal and financial experts assess the implications of different jurisdictions.",
        "confidence": 1.0,
        "classification": "HIGH",
        "conditions": "A governing law other than New York law is proposed for a guarantee.",
        "justification": "To ensure proper legal and financial assessment of alternative governing law provisions.",
        "implication_company": "Maintains control over legal risks associated with governing law variations.",
        "implication_supplier": "Suppliers proposing alternative governing laws will face an internal approval process within Zebracorp.",
        "source_insight": "Uses 'should be cleared with' as a mandatory step, referring to the preceding sentence which states 'generally New York law'."
      },
      "rationale": "Consensus: Both agents agreed on `GUIDELINE` and `HIGH` classification. Evaluation: The finding is actionable, establishing a clear process for deviations from the standard governing law. The `plain_text` from Candidate 2 provides excellent contextualization by explicitly mentioning 'New York law' from the preceding sentence in the source, making the guideline self-sufficient. Passed all value and utility checks.",
      "decision_confidence": 1.0,
      "source_cluster_id": "dbe47ad3-dc3d-4743-8ae1-53ad14552397",
      "supporting_evidence": [
        "52e9d386-bde1-4e8a-a6fc-8b140a477648",
        "9b83018c-2df6-4b23-b1f8-ab928e2cbbab"
      ]
    },
    {
      "id": "e5285a45-e53a-44a0-8305-c827aae13bad",
      "is_valid": true,
      "decision_content": {
        "type": "OTHER",
        "id": "f2a3b4c5-d6e7-8901-2345-abcdef012350",
        "verbatim_text": "This charge is often directly or indirectly passed on the prices paid by Zebracorp.",
        "plain_text": "The fees for bank-issued guarantees are often passed on to Zebracorp through higher prices.",
        "expert_insight": "This clarifies why Zebracorp prefers parent company guarantees – to avoid these passed-on costs, which ultimately impact Zebracorp's bottom line.",
        "confidence": 1.0,
        "subtype": "INFO",
        "justification": "Explains the financial impact of bank guarantee charges on Zebracorp.",
        "implication_company": "Directly impacts Zebracorp's procurement costs.",
        "implication_supplier": "N/A",
        "source_insight": "Directly stated as a consequence."
      },
      "rationale": "Consensus: Single candidate, type 'OTHER' (INFO) is appropriate. Evaluation: The verbatim text 'This charge' was successfully contextualized in the 'plain_text' to 'The fees for bank-issued guarantees are often passed on to Zebracorp through higher prices,' making it self-sufficient and clear. The finding provides a valuable justification for Zebracorp's preference for parent company guarantees, directly impacting procurement costs. It passes all clarity, value, and utility checks.",
      "decision_confidence": 1.0,
      "source_cluster_id": "bafc6025-f8ec-498c-83b5-9f26eb025953",
      "supporting_evidence": [
        "268af23a-defb-4f2c-9033-3ece19d43e48"
      ]
    }
  ],
  "clusters": [
    {
      "id": "4f4c15ff-4ab2-4251-9f99-98c09ea1117d",
      "recommendation_ids": [
        "b54cba37-bb17-45c2-9fb5-2f1060c78c01",
        "dcfe2f71-9afd-4b9b-86c3-517d72fabad9",
        "db00fbb4-0516-4062-ab87-8e54811821bd",
        "186b3844-c6a6-48af-a3ee-d111644f5031"
      ]
    },
    {
      "id": "fc8949f8-267d-4eca-981c-6e8a869cf2e6",
      "recommendation_ids": [
        "ff1cbcce-0f17-49ac-803d-09e27c235d2d",
        "3d4f3962-15f1-4379-926a-8eb0d33b690c",
        "584ac1f5-0323-4c22-b564-0eee2e7116e0",
        "abf0c365-749b-4361-aeb2-060c042a4ba0"
      ]
    },
    {
      "id": "60d2d030-62bf-48b5-9b18-839b953445b6",
      "recommendation_ids": [
        "982100f8-9465-47b9-bd08-6fc7af9eed6f",
        "81c06487-d32f-4396-bfed-7f3227857e03",
        "57da390b-364f-4547-8cd6-9ee6ee2944a6",
        "4fcd0ba7-cb3e-4a81-acee-883e849a8456"
      ]
    },
    {
      "id": "507cd4c3-ef7c-49b0-b233-341b82a0a1bc",
      "recommendation_ids": [
        "66b34b48-adcb-4be3-8171-af2bc059280d",
        "5f391b63-3323-4ed4-b06f-8474ca04889d",
        "3a7721ba-65d3-4fe3-9009-577fc475c12a",
        "f11ef0f9-6e0a-4f9c-9275-3aa6c7cd73ba"
      ]
    },
    {
      "id": "e72d3da5-ca47-4891-8fcc-6fe688bb29ef",
      "recommendation_ids": [
        "ae1e4aef-16a2-493d-bdd9-e85fe97fd559",
        "0de18fe3-e0e7-42fe-b38a-470cc20396eb",
        "2a552f9f-cc37-4364-8522-fb6844064792",
        "86275e2e-44d7-45ae-993a-1515666a4d9c"
      ]
    },
    {
      "id": "d9ba0428-6a02-44e9-9dcf-ba0a1ece0a8c",
      "recommendation_ids": [
        "707aa8b3-2529-4361-87a0-300ebd63c4a3",
        "ba035692-7b44-4888-96e9-63095dd46777",
        "f5efa68f-7c3b-470e-8652-e20dadf7620c",
        "2e3ef269-393a-4e20-9ba8-b69893512bc1"
      ]
    },
    {
      "id": "47397d27-9eb1-49f5-9223-b41cd1db5f9d",
      "recommendation_ids": [
        "899f2f1a-a44e-4625-899d-24e234251864",
        "ec53a531-5d51-479b-af91-7221500211f6",
        "8a77e0fd-a9d1-45a1-a995-851a7f20d985",
        "dd148d3d-b3b4-4357-a722-45a730419a05"
      ]
    },
    {
      "id": "009795db-484b-446b-88e2-9164fd417a77",
      "recommendation_ids": [
        "d79a8ad1-d157-4a24-83dd-41d88ba6ba2c",
        "7e388c86-4bbb-4670-87d2-1105caf70b05",
        "5eee3692-62d6-46fe-ad60-4015b81c3fbc",
        "8780c02e-013d-4002-9407-8e7a63e29122"
      ]
    },
    {
      "id": "1e3fc87d-5e4c-47d4-b1e3-375d00adc5fa",
      "recommendation_ids": [
        "6ff47b95-b153-4288-95e1-a306cc2dbb77",
        "c3795a80-f2f2-4417-a24f-722dcffffce3",
        "d06fb1fb-0d0c-44b4-b6b3-febb57220d2f",
        "6c17f61e-aa75-41fd-9bd5-3f0358cd79b8"
      ]
    },
    {
      "id": "f0914069-9b7c-417f-9821-a5e50b8dcc29",
      "recommendation_ids": [
        "4089322c-f5d5-4532-8080-cd0678573b87",
        "07346f6a-f4e4-4fea-a9db-0c888c126aae",
        "1a17e1c6-3ea9-4677-b2f0-b50a06afd964",
        "47883e81-b8f7-4980-ab18-a42629bb3920"
      ]
    },
    {
      "id": "cee8ce9e-2706-49cb-904e-07c76a98685c",
      "recommendation_ids": [
        "ada400f5-d85a-433b-ad6d-e75dabbb4ed3",
        "c5cb00e8-3009-40d5-b9e0-7f072866e196",
        "409cb1ea-2c4f-4047-9773-75c3997192fc"
      ]
    },
    {
      "id": "6f86eaeb-f37f-476e-b9f2-4c686eb65696",
      "recommendation_ids": [
        "b0203fc3-7d91-4e81-a0f4-ff38fec6c718",
        "3b10e2f9-96bb-43cb-be0e-cecced5ca46b",
        "28c8b7f7-c465-436a-bd41-0b0a64062a2d"
      ]
    },
    {
      "id": "020a6f36-d3b5-4e11-8c54-4c60bbd1ae41",
      "recommendation_ids": [
        "cdf1c5c1-e9f3-4c68-9903-12835706859a",
        "3895d7b4-b530-4fa6-869b-b8ecca770c25",
        "89aa8799-8b91-44ef-b82e-fd949d97faeb"
      ]
    },
    {
      "id": "8b207187-b169-4b01-9735-6a2b04f3f3b7",
      "recommendation_ids": [
        "3db2265a-d6a7-4066-a671-0baafa8d828e",
        "0aba239c-ee2a-44c4-af4b-29a14c30b2d6",
        "64ae9da4-a4e9-478e-b1ec-b61fd80fb448"
      ]
    },
    {
      "id": "ecc7d57f-47bf-4fa9-b509-59a0745e3929",
      "recommendation_ids": [
        "bb002d79-b1f1-43c7-b15d-d3965e589054",
        "a739722a-04b9-44b5-ba8f-94e9dd61ce1f",
        "76be9ca6-2139-4351-a573-e046c6dd283e"
      ]
    },
    {
      "id": "7be3184a-13cd-486b-8838-0c432560b393",
      "recommendation_ids": [
        "4c83ba72-aa4a-4a3f-b894-3eaf166f47b8",
        "7ca5f36d-efb4-4fb0-94ae-04c70a5fba22",
        "807940dc-5098-4276-b5e4-bc060daf1771"
      ]
    },
    {
      "id": "891ee1b1-6913-47e2-87af-23ac00704c8b",
      "recommendation_ids": [
        "336940b9-e4cb-4ea1-b1c3-64d455b5bd62",
        "a9a2ab5f-954e-46bd-9389-d89881beae60",
        "3c22d4b7-3c2c-4c49-b360-dad6b42389a8"
      ]
    },
    {
      "id": "c0cf0d12-9d58-4e77-9b16-577133675124",
      "recommendation_ids": [
        "427803e1-a625-4016-aa4a-1da02b22d4ab",
        "5b7b9867-5999-45a6-8ee0-3792a2a4f376"
      ]
    },
    {
      "id": "1729929a-9c91-4291-92fb-56dae06b291f",
      "recommendation_ids": [
        "a8183cab-77d3-4fc6-8c7b-8056d7ceebc0",
        "74491ddd-3ec5-41f6-b0b6-5e8a27a0edd5"
      ]
    },
    {
      "id": "dbe47ad3-dc3d-4743-8ae1-53ad14552397",
      "recommendation_ids": [
        "52e9d386-bde1-4e8a-a6fc-8b140a477648",
        "9b83018c-2df6-4b23-b1f8-ab928e2cbbab"
      ]
    },
    {
      "id": "bafc6025-f8ec-498c-83b5-9f26eb025953",
      "recommendation_ids": [
        "268af23a-defb-4f2c-9033-3ece19d43e48"
      ]
    }
  ],
  "recommendations": [
    {
      "id": "b54cba37-bb17-45c2-9fb5-2f1060c78c01",
      "content": {
        "id": "a1b2c3d4-e5f6-7890-1234-567890abcdef",
        "type": "GUIDELINE",
        "classification": "CRITICAL",
        "verbatim_text": "the main rule is that Zebracorp does not give guarantees to our suppliers to guarantee Zebracorp´s payments. This applies to bank guarantees, Letters of Credit and other such external guarantees as well as parent company guarantees.",
        "plain_text": "Zebracorp's primary policy is not to provide guarantees (including bank guarantees, Letters of Credit, or parent company guarantees) to its suppliers for Zebracorp's payments.",
        "expert_insight": "This is a fundamental financial policy to limit Zebracorp's contingent liabilities and maintain a strong balance sheet. Deviations are highly scrutinized.",
        "confidence": 1.0,
        "conditions": "None, this is the default rule.",
        "justification": "Explicitly stated as 'the main rule' and impacts financial liabilities significantly.",
        "implication_company": "Protects Zebracorp from increasing its financial liabilities and contingent obligations.",
        "implication_supplier": "Suppliers cannot expect payment guarantees from Zebracorp and must conduct their own credit risk assessments.",
        "source_insight": "The text clearly outlines the types of guarantees covered by this rule.",
        "text": "the main rule is that Zebracorp does not give guarantees to our suppliers to guarantee Zebracorp´s payments. This applies to bank guarantees, Letters of Credit and other such external guarantees as well as parent company guarantees."
      },
      "source_agent": "AGENT_1",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "Senior Legal Counsel (Guidelines)",
        "model": "gemini-2.5-flash",
        "temperature": 0.0,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_1_prompt.txt"
      }
    },
    {
      "id": "ff1cbcce-0f17-49ac-803d-09e27c235d2d",
      "content": {
        "id": "b2c3d4e5-f6a7-8901-2345-67890abcdef0",
        "type": "GUIDELINE",
        "classification": "CRITICAL",
        "verbatim_text": "Any exceptions to this will need to be handled as per Zebracorp Group Guarantee SOP and must be agreed with Zebracorp Global Guarantee Center.",
        "plain_text": "Any exceptions to Zebracorp's policy of not providing guarantees must follow the Zebracorp Group Guarantee SOP and require agreement from the Zebracorp Global Guarantee Center.",
        "expert_insight": "This establishes a strict internal control mechanism for any deviation from the core policy, ensuring high-level approval and adherence to internal procedures.",
        "confidence": 1.0,
        "conditions": "Applies only if an exception to the 'no guarantee' rule is considered.",
        "justification": "Uses 'will need to be' and 'must be agreed', indicating mandatory compliance with internal procedures for exceptions.",
        "implication_company": "Ensures a rigorous, centralized approval process for any guarantee issuance, mitigating financial risk.",
        "implication_supplier": "Suppliers seeking guarantees from Zebracorp will face a stringent internal approval process within Zebracorp.",
        "source_insight": "Highlights the importance of internal governance for financial commitments.",
        "text": "Any exceptions to this will need to be handled as per Zebracorp Group Guarantee SOP and must be agreed with Zebracorp Global Guarantee Center."
      },
      "source_agent": "AGENT_1",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "Senior Legal Counsel (Guidelines)",
        "model": "gemini-2.5-flash",
        "temperature": 0.0,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_1_prompt.txt"
      }
    },
    {
      "id": "982100f8-9465-47b9-bd08-6fc7af9eed6f",
      "content": {
        "id": "c3d4e5f6-a7b8-9012-3456-7890abcdef01",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "In the event Zebracorp makes any advance payment or other prepayments to the supplier, Zebracorp may require a so called advance payment guarantee as a security from the supplier. The need for such advance payment guarantee depends on the value of the prepayment as well as other factors, and is ultimately decided by Procurement with F&C consultation.",
        "plain_text": "Zebracorp reserves the right to require an advance payment guarantee from a supplier when making advance payments or prepayments. The decision to require such a guarantee is made by Procurement in consultation with F&C, based on prepayment value and other factors.",
        "expert_insight": "This is a crucial risk mitigation tool for Zebracorp, protecting against supplier non-performance or insolvency after receiving advance payments.",
        "confidence": 1.0,
        "conditions": "Applies when Zebracorp makes advance payments or prepayments to a supplier.",
        "justification": "States 'may require' indicating a right, and details the internal decision-making process, making it a clear guideline for Zebracorp's actions.",
        "implication_company": "Provides Zebracorp with a mechanism to secure its advance payments.",
        "implication_supplier": "Suppliers receiving advance payments may be obligated to provide an advance payment guarantee.",
        "source_insight": "The decision is not automatic but subject to internal assessment.",
        "text": "In the event Zebracorp makes any advance payment or other prepayments to the supplier, Zebracorp may require a so called advance payment guarantee as a security from the supplier. The need for such advance payment guarantee depends on the value of the prepayment as well as other factors, and is ultimately decided by Procurement with F&C consultation."
      },
      "source_agent": "AGENT_1",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "Senior Legal Counsel (Guidelines)",
        "model": "gemini-2.5-flash",
        "temperature": 0.0,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_1_prompt.txt"
      }
    },
    {
      "id": "66b34b48-adcb-4be3-8171-af2bc059280d",
      "content": {
        "id": "d4e5f6a7-b8c9-0123-4567-890abcdef012",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "Zebracorp may also from time to time require performance bonds or guarantees from certain of its subcontractors in particular for key customer projects where the customer of Zebracorp is requesting such guarantees, or where such guarantee is otherwise found to be necessary in order to secure the performance of subcontractor’s obligations.",
        "plain_text": "Zebracorp may require performance bonds or guarantees from subcontractors, especially for key customer projects where the customer requests them, or when deemed necessary to secure subcontractor performance.",
        "expert_insight": "This protects Zebracorp's interests in critical projects, especially when its own customers demand such assurances, or when there's a perceived risk of subcontractor non-performance.",
        "confidence": 1.0,
        "conditions": "Applies to subcontractors, particularly for key customer projects or when necessary to secure performance.",
        "justification": "States 'may require', indicating a right for Zebracorp to demand such security under specific conditions.",
        "implication_company": "Enables Zebracorp to secure subcontractor performance and meet customer requirements.",
        "implication_supplier": "Subcontractors may be required to provide performance bonds or guarantees.",
        "source_insight": "The need for such guarantees is driven by both external customer demands and internal risk assessment.",
        "text": "Zebracorp may also from time to time require performance bonds or guarantees from certain of its subcontractors in particular for key customer projects where the customer of Zebracorp is requesting such guarantees, or where such guarantee is otherwise found to be necessary in order to secure the performance of subcontractor’s obligations."
      },
      "source_agent": "AGENT_1",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "Senior Legal Counsel (Guidelines)",
        "model": "gemini-2.5-flash",
        "temperature": 0.0,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_1_prompt.txt"
      }
    },
    {
      "id": "ae1e4aef-16a2-493d-bdd9-e85fe97fd559",
      "content": {
        "id": "e5f6a7b8-c9d0-1234-5678-90abcdef0123",
        "type": "GUIDELINE",
        "classification": "CRITICAL",
        "verbatim_text": "Any guarantee to be issued in favor of Zebracorp must be from an international bank acceptable to Zebracorp. Bank rating should be investment grade (BBB-) at minimum.",
        "plain_text": "Any guarantee provided to Zebracorp must originate from an international bank acceptable to Zebracorp, with a minimum investment grade rating of BBB-.",
        "expert_insight": "This ensures the financial strength and reliability of the guarantor, making the guarantee a credible security instrument for Zebracorp.",
        "confidence": 1.0,
        "conditions": "Applies to all guarantees issued in favor of Zebracorp.",
        "justification": "Uses 'must be' and 'should be investment grade (BBB-) at minimum', setting clear, mandatory standards for acceptable guarantors.",
        "implication_company": "Ensures the quality and enforceability of guarantees received.",
        "implication_supplier": "Suppliers must source guarantees from highly-rated, internationally recognized banks acceptable to Zebracorp.",
        "source_insight": "The 'should be' for bank rating is effectively a 'must' given the 'at minimum' qualifier.",
        "text": "Any guarantee to be issued in favor of Zebracorp must be from an international bank acceptable to Zebracorp. Bank rating should be investment grade (BBB-) at minimum."
      },
      "source_agent": "AGENT_1",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "Senior Legal Counsel (Guidelines)",
        "model": "gemini-2.5-flash",
        "temperature": 0.0,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_1_prompt.txt"
      }
    },
    {
      "id": "707aa8b3-2529-4361-87a0-300ebd63c4a3",
      "content": {
        "id": "f6a7b8c9-d0e1-2345-6789-0abcdef01234",
        "type": "GUIDELINE",
        "classification": "CRITICAL",
        "verbatim_text": "When using a corporate/parent company guarantees, it should however be noted that these are acceptable only if the credit rating of the issuing parent entity is BBB- at minimum.",
        "plain_text": "Corporate or parent company guarantees are only acceptable if the issuing parent entity has a credit rating of at least BBB-.",
        "expert_insight": "This is a critical financial safeguard, ensuring that if Zebracorp accepts a parent company guarantee, the parent entity itself is financially sound enough to honor the guarantee.",
        "confidence": 1.0,
        "conditions": "Applies when a corporate/parent company guarantee is considered.",
        "justification": "Uses 'acceptable only if', establishing a strict, mandatory condition for accepting parent company guarantees.",
        "implication_company": "Protects Zebracorp by ensuring the financial viability of parent company guarantors.",
        "implication_supplier": "A supplier's parent company must meet the minimum BBB- credit rating for its guarantee to be accepted.",
        "source_insight": "This condition applies even if a parent company guarantee is preferred over a bank guarantee due to cost.",
        "text": "When using a corporate/parent company guarantees, it should however be noted that these are acceptable only if the credit rating of the issuing parent entity is BBB- at minimum."
      },
      "source_agent": "AGENT_1",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "Senior Legal Counsel (Guidelines)",
        "model": "gemini-2.5-flash",
        "temperature": 0.0,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_1_prompt.txt"
      }
    },
    {
      "id": "899f2f1a-a44e-4625-899d-24e234251864",
      "content": {
        "id": "a7b8c9d0-e1f2-3456-7890-abcdef012345",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "Also, for corporate/parent company guarantees Zebracorp´s model guarantee wordings should be used. The corporate/parent company guarantee should be under same applicable law as the supply agreement which is generally New York law. Other governing law provisions should be cleared with Legal and Compliance or Finance.",
        "plain_text": "For corporate/parent company guarantees, Zebracorp's model guarantee wordings should be used. The governing law for these guarantees should align with the supply agreement (generally New York law), and any deviations must be cleared with Legal and Compliance or Finance.",
        "expert_insight": "Standardized wording and governing law are crucial for legal certainty and enforceability, minimizing legal risks and ensuring consistency across agreements.",
        "confidence": 1.0,
        "conditions": "Applies to corporate/parent company guarantees.",
        "justification": "Uses 'should be used' and 'should be under', indicating strong preference for standardization, with a mandatory clearance process for deviations ('should be cleared').",
        "implication_company": "Ensures legal consistency and enforceability of guarantees, with internal review for any deviations.",
        "implication_supplier": "Suppliers providing parent company guarantees must use Zebracorp's templates and generally accept New York law, or seek approval for alternatives.",
        "source_insight": "The 'should' implies a strong recommendation that becomes mandatory for deviations.",
        "text": "Also, for corporate/parent company guarantees Zebracorp´s model guarantee wordings should be used. The corporate/parent company guarantee should be under same applicable law as the supply agreement which is generally New York law. Other governing law provisions should be cleared with Legal and Compliance or Finance."
      },
      "source_agent": "AGENT_1",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "Senior Legal Counsel (Guidelines)",
        "model": "gemini-2.5-flash",
        "temperature": 0.0,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_1_prompt.txt"
      }
    },
    {
      "id": "d79a8ad1-d157-4a24-83dd-41d88ba6ba2c",
      "content": {
        "id": "b8c9d0e1-f2a3-4567-8901-abcdef012346",
        "type": "GUIDELINE",
        "classification": "CRITICAL",
        "verbatim_text": "As for bank guarantees/performance bonds, Zebracorp should only accept so called on-demand guarantees or stand-by Letters of Credit.",
        "plain_text": "For bank guarantees and performance bonds, Zebracorp will only accept 'on-demand' guarantees or 'stand-by Letters of Credit'.",
        "expert_insight": "This is critical for ensuring the immediate enforceability of the guarantee without needing to prove a breach of contract, significantly reducing the risk and complexity of calling on the guarantee.",
        "confidence": 1.0,
        "conditions": "Applies to bank guarantees and performance bonds.",
        "justification": "Uses 'should only accept', indicating a strict preference that functions as a mandatory requirement for the type of guarantee accepted.",
        "implication_company": "Ensures that guarantees received are easily enforceable and provide immediate security.",
        "implication_supplier": "Suppliers must provide specific types of bank guarantees (on-demand or stand-by L/C) that meet Zebracorp's requirements.",
        "source_insight": "The phrasing 'should only accept' implies a non-negotiable standard for the type of instrument.",
        "text": "As for bank guarantees/performance bonds, Zebracorp should only accept so called on-demand guarantees or stand-by Letters of Credit."
      },
      "source_agent": "AGENT_1",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "Senior Legal Counsel (Guidelines)",
        "model": "gemini-2.5-flash",
        "temperature": 0.0,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_1_prompt.txt"
      }
    },
    {
      "id": "6ff47b95-b153-4288-95e1-a306cc2dbb77",
      "content": {
        "id": "c9d0e1f2-a3b4-5678-9012-abcdef012347",
        "type": "GUIDELINE",
        "classification": "CRITICAL",
        "verbatim_text": "Any deviations to these templates would need to be approved by Zebracorp Global Guarantee Center and/or Zebracorp Finance Legal.",
        "plain_text": "Any deviations from Zebracorp's guarantee templates must be approved by the Zebracorp Global Guarantee Center and/or Zebracorp Finance Legal.",
        "expert_insight": "This ensures that any changes to standard legal documents are reviewed by expert legal and financial teams, protecting Zebracorp from unintended legal or financial exposures.",
        "confidence": 1.0,
        "conditions": "Applies when there are deviations from Zebracorp's standard guarantee templates.",
        "justification": "Uses 'would need to be approved', indicating a mandatory internal approval process for any non-standard guarantee documentation.",
        "implication_company": "Maintains control over legal wording and terms of guarantees, ensuring consistency and risk mitigation.",
        "implication_supplier": "Suppliers proposing non-standard guarantee wordings will require Zebracorp's internal approval.",
        "source_insight": "Reinforces the importance of using standard templates and the strict process for exceptions.",
        "text": "Any deviations to these templates would need to be approved by Zebracorp Global Guarantee Center and/or Zebracorp Finance Legal."
      },
      "source_agent": "AGENT_1",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "Senior Legal Counsel (Guidelines)",
        "model": "gemini-2.5-flash",
        "temperature": 0.0,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_1_prompt.txt"
      }
    },
    {
      "id": "4089322c-f5d5-4532-8080-cd0678573b87",
      "content": {
        "id": "d0e1f2a3-b4c5-6789-0123-abcdef012348",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "Final guarantee documentation should be delivered to Zebracorp Global Guarantee Center which will keep track on existing guarantees and which will store the guarantees.",
        "plain_text": "Final guarantee documentation must be delivered to the Zebracorp Global Guarantee Center for tracking and storage.",
        "expert_insight": "Centralized management of guarantees is essential for proper record-keeping, monitoring expiry dates, and ensuring easy access for enforcement, thereby mitigating operational risk.",
        "confidence": 1.0,
        "conditions": "Applies to all final guarantee documentation.",
        "justification": "Uses 'should be delivered' for an essential operational process, implying a strong obligation for proper record-keeping.",
        "implication_company": "Ensures centralized tracking and secure storage of all guarantees, improving risk management.",
        "implication_supplier": "Suppliers must ensure final guarantee documentation is correctly submitted to Zebracorp's Global Guarantee Center.",
        "source_insight": "While 'should' is used, the context of 'keep track' and 'store' makes this a critical operational requirement.",
        "text": "Final guarantee documentation should be delivered to Zebracorp Global Guarantee Center which will keep track on existing guarantees and which will store the guarantees."
      },
      "source_agent": "AGENT_1",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "Senior Legal Counsel (Guidelines)",
        "model": "gemini-2.5-flash",
        "temperature": 0.0,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_1_prompt.txt"
      }
    },
    {
      "id": "ada400f5-d85a-433b-ad6d-e75dabbb4ed3",
      "content": {
        "id": "2d9e0f3c-5a7b-4e1f-8c2d-9e0f3c5a7b4e",
        "type": "OTHER",
        "verbatim_text": "Zebracorp is generally relying on its suppliers having conducted necessary credit risk assessments on Zebracorp contracting entity and having satisfied itself as to the creditworthiness of Zebracorp.",
        "plain_text": "Zebracorp expects suppliers to conduct their own credit risk assessments on Zebracorp and be satisfied with its creditworthiness.",
        "expert_insight": "This statement sets a foundational expectation, shifting the burden of due diligence regarding Zebracorp's financial standing onto the supplier.",
        "confidence": 0.95,
        "subtype": "INFO",
        "justification": "Provides background information on Zebracorp's general stance and expectation regarding supplier due diligence.",
        "implication_company": "Zebracorp implicitly states it will not provide guarantees and expects suppliers to have done their homework.",
        "implication_supplier": "Suppliers should perform their own credit checks on Zebracorp and not expect Zebracorp to provide guarantees.",
        "source_insight": "This is a passive but firm statement of policy, not a direct instruction or tactic, but informs the overall strategy.",
        "text": "Zebracorp is generally relying on its suppliers having conducted necessary credit risk assessments on Zebracorp contracting entity and having satisfied itself as to the creditworthiness of Zebracorp."
      },
      "source_agent": "AGENT_2",
      "confidence": 0.95,
      "config_snapshot": {
        "name": "Strategic Advisor (Context)",
        "model": "gemini-2.5-flash",
        "temperature": 0.2,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_2_prompt.txt"
      }
    },
    {
      "id": "b0203fc3-7d91-4e81-a0f4-ff38fec6c718",
      "content": {
        "id": "1a2b3c4d-5e6f-7a8b-9c0d-1e2f3a4b5c6d",
        "type": "OTHER",
        "verbatim_text": "Any guarantee issued by Zebracorp would need to recorded in our financial accounts and would increase our financial liabilities.",
        "plain_text": "Issuing guarantees has financial accounting implications for Zebracorp, increasing its liabilities.",
        "expert_insight": "This provides the underlying financial rationale for Zebracorp's reluctance to issue guarantees, which can be a strong internal argument against doing so.",
        "confidence": 0.98,
        "subtype": "INFO",
        "justification": "Explains the financial impact and internal reasoning behind Zebracorp's policy on guarantees.",
        "implication_company": "Zebracorp understands the financial burden and accounting requirements associated with issuing guarantees.",
        "implication_supplier": "Suppliers should understand that Zebracorp has strong financial reasons to avoid issuing guarantees.",
        "source_insight": "This is a factual statement about financial consequences, informing the strategic decision.",
        "text": "Any guarantee issued by Zebracorp would need to recorded in our financial accounts and would increase our financial liabilities."
      },
      "source_agent": "AGENT_2",
      "confidence": 0.98,
      "config_snapshot": {
        "name": "Strategic Advisor (Context)",
        "model": "gemini-2.5-flash",
        "temperature": 0.2,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_2_prompt.txt"
      }
    },
    {
      "id": "dcfe2f71-9afd-4b9b-86c3-517d72fabad9",
      "content": {
        "id": "3e4f5a6b-7c8d-9e0f-1a2b-3c4d5e6f7a8b",
        "type": "OTHER",
        "verbatim_text": "For these reasons, the main rule is that Zebracorp does not give guarantees to our suppliers to guarantee Zebracorp´s payments. This applies to bank guarantees, Letters of Credit and other such external guarantees as well as parent company guarantees.",
        "plain_text": "Zebracorp's primary policy is not to provide any form of guarantee (bank, L/C, parent company) to its suppliers for Zebracorp's payments.",
        "expert_insight": "This is a core strategic position. Zebracorp is clearly stating its default negotiation stance, which is to refuse all forms of guarantees to suppliers.",
        "confidence": 1.0,
        "subtype": "TACTIC",
        "justification": "This is a direct statement of Zebracorp's primary negotiation position and a strategic stance to avoid financial liabilities.",
        "implication_company": "Zebracorp has a firm 'no guarantees' policy for its own payments, simplifying negotiations and reducing financial risk.",
        "implication_supplier": "Suppliers should not expect Zebracorp to provide guarantees for its payments; requests will likely be rejected.",
        "source_insight": "The phrase 'the main rule is that Zebracorp does not give guarantees' clearly indicates a strategic policy.",
        "text": "For these reasons, the main rule is that Zebracorp does not give guarantees to our suppliers to guarantee Zebracorp´s payments. This applies to bank guarantees, Letters of Credit and other such external guarantees as well as parent company guarantees."
      },
      "source_agent": "AGENT_2",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "Strategic Advisor (Context)",
        "model": "gemini-2.5-flash",
        "temperature": 0.2,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_2_prompt.txt"
      }
    },
    {
      "id": "3d4f3962-15f1-4379-926a-8eb0d33b690c",
      "content": {
        "id": "5f6a7b8c-9d0e-1f2a-3b4c-5d6e7f8a9b0c",
        "type": "OTHER",
        "verbatim_text": "Any exceptions to this will need to be handled as per Zebracorp Group Guarantee SOP and must be agreed with Zebracorp Global Guarantee Center.",
        "plain_text": "Any exceptions to Zebracorp's no-guarantee policy require adherence to the Group Guarantee SOP and approval from the Global Guarantee Center.",
        "expert_insight": "This outlines a strict internal process for any deviation from the default 'no guarantee' policy, indicating that exceptions are rare and require high-level scrutiny.",
        "confidence": 0.99,
        "subtype": "INSTRUCTION",
        "justification": "Details the internal procedural steps required for any exceptions to the stated policy.",
        "implication_company": "Zebracorp must follow a rigorous internal process for any guarantee exceptions, ensuring control and oversight.",
        "implication_supplier": "Suppliers requesting guarantees will face a lengthy and difficult internal approval process within Zebracorp, making exceptions highly unlikely.",
        "source_insight": "The use of 'will need to be handled' and 'must be agreed' signifies a mandatory internal instruction.",
        "text": "Any exceptions to this will need to be handled as per Zebracorp Group Guarantee SOP and must be agreed with Zebracorp Global Guarantee Center."
      },
      "source_agent": "AGENT_2",
      "confidence": 0.99,
      "config_snapshot": {
        "name": "Strategic Advisor (Context)",
        "model": "gemini-2.5-flash",
        "temperature": 0.2,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_2_prompt.txt"
      }
    },
    {
      "id": "81c06487-d32f-4396-bfed-7f3227857e03",
      "content": {
        "id": "7h8i9j0k-1l2m-3n4o-5p6q-7r8s9t0u1v2w",
        "type": "OTHER",
        "verbatim_text": "In the event Zebracorp makes any advance payment or other prepayments to the supplier, Zebracorp may require a so called advance payment guarantee as a security from the supplier.",
        "plain_text": "Zebracorp may require an advance payment guarantee from suppliers when making prepayments.",
        "expert_insight": "This highlights a specific scenario where Zebracorp will seek security from its suppliers, balancing its own risk when providing upfront funds.",
        "confidence": 0.95,
        "subtype": "INFO",
        "justification": "Describes a specific condition under which Zebracorp might request a guarantee from a supplier.",
        "implication_company": "Zebracorp has a mechanism to mitigate risk when making advance payments to suppliers.",
        "implication_supplier": "Suppliers should be prepared to provide advance payment guarantees if they receive prepayments from Zebracorp.",
        "source_insight": "The phrase 'may require' indicates a potential action rather than a strict rule, making it informative about Zebracorp's options.",
        "text": "In the event Zebracorp makes any advance payment or other prepayments to the supplier, Zebracorp may require a so called advance payment guarantee as a security from the supplier."
      },
      "source_agent": "AGENT_2",
      "confidence": 0.95,
      "config_snapshot": {
        "name": "Strategic Advisor (Context)",
        "model": "gemini-2.5-flash",
        "temperature": 0.2,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_2_prompt.txt"
      }
    },
    {
      "id": "cdf1c5c1-e9f3-4c68-9903-12835706859a",
      "content": {
        "id": "9x0y1z2a-3b4c-5d6e-7f8g-9h0i1j2k3l4m",
        "type": "OTHER",
        "verbatim_text": "The need for such advance payment guarantee depends on the value of the prepayment as well as other factors, and is ultimately decided by Procurement with F&C consultation.",
        "plain_text": "The decision to require an advance payment guarantee is made by Procurement, in consultation with Finance & Control (F&C), based on prepayment value and other factors.",
        "expert_insight": "This clarifies the internal decision-making process, indicating that the requirement for an advance payment guarantee is not automatic but subject to internal assessment and cross-functional input.",
        "confidence": 0.98,
        "subtype": "INSTRUCTION",
        "justification": "Outlines the internal process and stakeholders involved in deciding whether to request an advance payment guarantee.",
        "implication_company": "Zebracorp has a defined internal process for assessing and deciding on advance payment guarantees, involving Procurement and F&C.",
        "implication_supplier": "The requirement for an advance payment guarantee is not fixed and depends on Zebracorp's internal assessment, which may be negotiable based on other factors.",
        "source_insight": "Specifies who makes the decision and what factors influence it, making it an internal instruction.",
        "text": "The need for such advance payment guarantee depends on the value of the prepayment as well as other factors, and is ultimately decided by Procurement with F&C consultation."
      },
      "source_agent": "AGENT_2",
      "confidence": 0.98,
      "config_snapshot": {
        "name": "Strategic Advisor (Context)",
        "model": "gemini-2.5-flash",
        "temperature": 0.2,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_2_prompt.txt"
      }
    },
    {
      "id": "5f391b63-3323-4ed4-b06f-8474ca04889d",
      "content": {
        "id": "b1c2d3e4-f5a6-7b8c-9d0e-1f2a3b4c5d6e",
        "type": "OTHER",
        "verbatim_text": "Zebracorp may also from time to time require performance bonds or guarantees from certain of its subcontractors in particular for key customer projects where the customer of Zebracorp is requesting such guarantees, or where such guarantee is otherwise found to be necessary in order to secure the performance of subcontractor’s obligations.",
        "plain_text": "Zebracorp may require performance bonds or guarantees from subcontractors, especially for key customer projects or when necessary to secure subcontractor performance.",
        "expert_insight": "This indicates Zebracorp's proactive risk management strategy for critical projects and subcontractor performance, often driven by its own customer requirements.",
        "confidence": 0.95,
        "subtype": "INFO",
        "justification": "Describes conditions under which Zebracorp might require performance guarantees from subcontractors.",
        "implication_company": "Zebracorp has a strategy to secure subcontractor performance, particularly for high-stakes projects or when mandated by its customers.",
        "implication_supplier": "Subcontractors working with Zebracorp, especially on key customer projects, should anticipate requests for performance guarantees.",
        "source_insight": "The use of 'may also from time to time require' indicates a conditional policy rather than a strict rule, providing context.",
        "text": "Zebracorp may also from time to time require performance bonds or guarantees from certain of its subcontractors in particular for key customer projects where the customer of Zebracorp is requesting such guarantees, or where such guarantee is otherwise found to be necessary in order to secure the performance of subcontractor’s obligations."
      },
      "source_agent": "AGENT_2",
      "confidence": 0.95,
      "config_snapshot": {
        "name": "Strategic Advisor (Context)",
        "model": "gemini-2.5-flash",
        "temperature": 0.2,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_2_prompt.txt"
      }
    },
    {
      "id": "0de18fe3-e0e7-42fe-b38a-470cc20396eb",
      "content": {
        "id": "d3e4f5a6-b7c8-9d0e-1f2a-3b4c5d6e7f8a",
        "type": "OTHER",
        "verbatim_text": "Any guarantee to be issued in favor of Zebracorp must be from an international bank acceptable to Zebracorp. Bank rating should be investment grade (BBB-) at minimum.",
        "plain_text": "Guarantees issued to Zebracorp must come from an international bank acceptable to Zebracorp, with a minimum investment grade (BBB-) rating.",
        "expert_insight": "This sets a clear quality standard for financial institutions providing guarantees to Zebracorp, ensuring the reliability and enforceability of such instruments.",
        "confidence": 1.0,
        "subtype": "INSTRUCTION",
        "justification": "Specifies mandatory criteria for the issuing bank of any guarantee in favor of Zebracorp.",
        "implication_company": "Zebracorp ensures the financial strength and international standing of institutions providing guarantees to it.",
        "implication_supplier": "Suppliers must source guarantees from highly-rated international banks that are acceptable to Zebracorp.",
        "source_insight": "The use of 'must be' and 'should be' (in this context, 'should' implies a strong requirement for investment grade) indicates a clear instruction.",
        "text": "Any guarantee to be issued in favor of Zebracorp must be from an international bank acceptable to Zebracorp. Bank rating should be investment grade (BBB-) at minimum."
      },
      "source_agent": "AGENT_2",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "Strategic Advisor (Context)",
        "model": "gemini-2.5-flash",
        "temperature": 0.2,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_2_prompt.txt"
      }
    },
    {
      "id": "3db2265a-d6a7-4066-a671-0baafa8d828e",
      "content": {
        "id": "f5a6b7c8-d9e0-1f2a-3b4c-5d6e7f8a9b0c",
        "type": "OTHER",
        "verbatim_text": "A parent company guarantee may be preferred over a bank issued guarantee or bond due to the fact that guarantees/bonds issued by financial institutions carry a charge. This charge is often directly or indirectly passed on the prices paid by Zebracorp.",
        "plain_text": "Zebracorp prefers parent company guarantees over bank-issued ones because bank guarantees incur charges that are often passed on to Zebracorp's prices.",
        "expert_insight": "This reveals a cost-saving tactic. Zebracorp strategically prefers parent company guarantees to avoid additional costs associated with bank-issued instruments, which would ultimately increase its own expenses.",
        "confidence": 0.99,
        "subtype": "TACTIC",
        "justification": "Explains Zebracorp's strategic preference for a certain type of guarantee based on cost implications.",
        "implication_company": "Zebracorp aims to reduce costs by favoring parent company guarantees over bank guarantees.",
        "implication_supplier": "Suppliers should be aware that Zebracorp will likely push for a parent company guarantee to avoid bank charges, which could impact their pricing.",
        "source_insight": "The phrase 'may be preferred' and the explanation of cost implications clearly indicate a strategic preference and rationale.",
        "text": "A parent company guarantee may be preferred over a bank issued guarantee or bond due to the fact that guarantees/bonds issued by financial institutions carry a charge. This charge is often directly or indirectly passed on the prices paid by Zebracorp."
      },
      "source_agent": "AGENT_2",
      "confidence": 0.99,
      "config_snapshot": {
        "name": "Strategic Advisor (Context)",
        "model": "gemini-2.5-flash",
        "temperature": 0.2,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_2_prompt.txt"
      }
    },
    {
      "id": "bb002d79-b1f1-43c7-b15d-d3965e589054",
      "content": {
        "id": "h7i8j9k0-l1m2-n3o4-p5q6-r7s8t9u0v1w2",
        "type": "OTHER",
        "verbatim_text": "For this reason, the benefits of requesting supplier guarantees must be carefully assessed.",
        "plain_text": "Zebracorp must carefully assess the benefits of requesting supplier guarantees due to potential cost implications.",
        "expert_insight": "This is an internal instruction to perform a cost-benefit analysis before requesting guarantees, ensuring that the security gained outweighs the potential indirect costs.",
        "confidence": 0.98,
        "subtype": "INSTRUCTION",
        "justification": "Mandates an internal assessment process for requesting guarantees, linking back to the cost implications mentioned previously.",
        "implication_company": "Zebracorp will conduct a thorough internal review before deciding to request a guarantee, considering all associated costs and benefits.",
        "implication_supplier": "The request for a guarantee from Zebracorp is not automatic and is subject to an internal cost-benefit analysis.",
        "source_insight": "The use of 'must be carefully assessed' indicates a mandatory internal step.",
        "text": "For this reason, the benefits of requesting supplier guarantees must be carefully assessed."
      },
      "source_agent": "AGENT_2",
      "confidence": 0.98,
      "config_snapshot": {
        "name": "Strategic Advisor (Context)",
        "model": "gemini-2.5-flash",
        "temperature": 0.2,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_2_prompt.txt"
      }
    },
    {
      "id": "ba035692-7b44-4888-96e9-63095dd46777",
      "content": {
        "id": "j9k0l1m2-n3o4-p5q6-r7s8-t9u0v1w2x3y4",
        "type": "OTHER",
        "verbatim_text": "When using a corporate/parent company guarantees, it should however be noted that these are acceptable only if the credit rating of the issuing parent entity is BBB- at minimum.",
        "plain_text": "Corporate/parent company guarantees are only acceptable if the issuing parent entity has a minimum credit rating of BBB-.",
        "expert_insight": "While preferring parent company guarantees for cost reasons, Zebracorp maintains a strict financial standard for the guarantor, ensuring the guarantee's reliability.",
        "confidence": 1.0,
        "subtype": "INSTRUCTION",
        "justification": "Sets a mandatory credit rating requirement for parent company guarantees.",
        "implication_company": "Zebracorp ensures the financial stability of parent companies providing guarantees.",
        "implication_supplier": "If providing a parent company guarantee, the parent entity must meet Zebracorp's minimum BBB- credit rating requirement.",
        "source_insight": "The phrase 'acceptable only if' clearly defines a mandatory condition.",
        "text": "When using a corporate/parent company guarantees, it should however be noted that these are acceptable only if the credit rating of the issuing parent entity is BBB- at minimum."
      },
      "source_agent": "AGENT_2",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "Strategic Advisor (Context)",
        "model": "gemini-2.5-flash",
        "temperature": 0.2,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_2_prompt.txt"
      }
    },
    {
      "id": "ec53a531-5d51-479b-af91-7221500211f6",
      "content": {
        "id": "l1m2n3o4-p5q6-r7s8-t9u0-v1w2x3y4z5a6",
        "type": "OTHER",
        "verbatim_text": "Also, for corporate/parent company guarantees Zebracorp´s model guarantee wordings should be used.",
        "plain_text": "Zebracorp's standard model wordings should be used for corporate/parent company guarantees.",
        "expert_insight": "This is a standardization instruction to ensure legal consistency and protect Zebracorp's interests by using pre-approved language for guarantees.",
        "confidence": 0.99,
        "subtype": "INSTRUCTION",
        "justification": "Mandates the use of Zebracorp's standard templates for legal consistency and risk management.",
        "implication_company": "Zebracorp maintains control over the legal wording of guarantees it receives, minimizing legal risk.",
        "implication_supplier": "Suppliers providing parent company guarantees must use Zebracorp's specified model wordings.",
        "source_insight": "The use of 'should be used' indicates a strong preference and internal directive for standardization.",
        "text": "Also, for corporate/parent company guarantees Zebracorp´s model guarantee wordings should be used."
      },
      "source_agent": "AGENT_2",
      "confidence": 0.99,
      "config_snapshot": {
        "name": "Strategic Advisor (Context)",
        "model": "gemini-2.5-flash",
        "temperature": 0.2,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_2_prompt.txt"
      }
    },
    {
      "id": "4c83ba72-aa4a-4a3f-b894-3eaf166f47b8",
      "content": {
        "id": "n3o4p5q6-r7s8-t9u0-v1w2-x3y4z5a6b7c8",
        "type": "OTHER",
        "verbatim_text": "The corporate/parent company guarantee should be under same applicable law as the supply agreement which is generally New York law. Other governing law provisions should be cleared with Legal and Compliance or Finance.",
        "plain_text": "Corporate/parent company guarantees should generally be governed by New York law, consistent with the supply agreement. Any deviations require clearance from Legal and Compliance or Finance.",
        "expert_insight": "This ensures legal consistency across related agreements and centralizes the review process for any deviations, maintaining legal control.",
        "confidence": 0.99,
        "subtype": "INSTRUCTION",
        "justification": "Specifies the preferred governing law for guarantees and the internal approval process for any deviations.",
        "implication_company": "Zebracorp aims for legal consistency and has a clear process for reviewing exceptions to governing law.",
        "implication_supplier": "Suppliers should expect New York law to govern parent company guarantees; any other governing law will require Zebracorp's internal approval.",
        "source_insight": "The combination of a general rule ('generally New York law') and a process for exceptions ('should be cleared') makes this an instruction.",
        "text": "The corporate/parent company guarantee should be under same applicable law as the supply agreement which is generally New York law. Other governing law provisions should be cleared with Legal and Compliance or Finance."
      },
      "source_agent": "AGENT_2",
      "confidence": 0.99,
      "config_snapshot": {
        "name": "Strategic Advisor (Context)",
        "model": "gemini-2.5-flash",
        "temperature": 0.2,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_2_prompt.txt"
      }
    },
    {
      "id": "7e388c86-4bbb-4670-87d2-1105caf70b05",
      "content": {
        "id": "p5q6r7s8-t9u0-v1w2-x3y4-z5a6b7c8d9e0",
        "type": "OTHER",
        "verbatim_text": "As for bank guarantees/performance bonds, Zebracorp should only accept so called on-demand guarantees or stand-by Letters of Credit.",
        "plain_text": "Zebracorp will only accept on-demand guarantees or stand-by Letters of Credit for bank guarantees/performance bonds.",
        "expert_insight": "This is a critical instruction for risk mitigation, ensuring that Zebracorp can claim against the guarantee without needing to prove default, simplifying the enforcement process.",
        "confidence": 1.0,
        "subtype": "INSTRUCTION",
        "justification": "Specifies the mandatory types of bank guarantees Zebracorp will accept to ensure ease of claim.",
        "implication_company": "Zebracorp ensures it receives easily enforceable guarantees, minimizing legal hurdles in case of a claim.",
        "implication_supplier": "Suppliers must provide specific types of bank guarantees (on-demand or stand-by L/C) that are favorable to Zebracorp.",
        "source_insight": "The phrase 'should only accept' indicates a strict requirement for the type of guarantee.",
        "text": "As for bank guarantees/performance bonds, Zebracorp should only accept so called on-demand guarantees or stand-by Letters of Credit."
      },
      "source_agent": "AGENT_2",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "Strategic Advisor (Context)",
        "model": "gemini-2.5-flash",
        "temperature": 0.2,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_2_prompt.txt"
      }
    },
    {
      "id": "336940b9-e4cb-4ea1-b1c3-64d455b5bd62",
      "content": {
        "id": "r7s8t9u0-v1w2-x3y4-z5a6-b7c8d9e0f1g2",
        "type": "OTHER",
        "verbatim_text": "A template for an Advance Payment Guarantee can be found below. Other guarantee templates are available from Legal & Compliance.",
        "plain_text": "Templates for Advance Payment Guarantees are provided, and other guarantee templates are available from Zebracorp's Legal & Compliance department.",
        "expert_insight": "This provides practical guidance and resources for internal teams, ensuring consistency and efficiency in drafting guarantees.",
        "confidence": 0.95,
        "subtype": "INFO",
        "justification": "Informs about the availability of standard templates for guarantees.",
        "implication_company": "Zebracorp has standardized templates to streamline the process of obtaining guarantees.",
        "implication_supplier": "Suppliers can expect Zebracorp to provide standard templates for guarantees.",
        "source_insight": "This is an informational statement about available resources.",
        "text": "A template for an Advance Payment Guarantee can be found below. Other guarantee templates are available from Legal & Compliance."
      },
      "source_agent": "AGENT_2",
      "confidence": 0.95,
      "config_snapshot": {
        "name": "Strategic Advisor (Context)",
        "model": "gemini-2.5-flash",
        "temperature": 0.2,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_2_prompt.txt"
      }
    },
    {
      "id": "c3795a80-f2f2-4417-a24f-722dcffffce3",
      "content": {
        "id": "t9u0v1w2-x3y4-z5a6-b7c8-d9e0f1g2h3i4",
        "type": "OTHER",
        "verbatim_text": "Any deviations to these templates would need to be approved by Zebracorp Global Guarantee Center and/or Zebracorp Finance Legal.",
        "plain_text": "Any changes to Zebracorp's standard guarantee templates require approval from the Global Guarantee Center and/or Finance Legal.",
        "expert_insight": "This reinforces Zebracorp's control over legal wording, indicating that any non-standard terms will undergo rigorous internal review by specialized departments.",
        "confidence": 0.99,
        "subtype": "INSTRUCTION",
        "justification": "Outlines the mandatory internal approval process for any deviations from standard guarantee templates.",
        "implication_company": "Zebracorp maintains strict control over guarantee wording through a centralized approval process for deviations.",
        "implication_supplier": "Suppliers proposing changes to Zebracorp's guarantee templates will face a complex internal approval process within Zebracorp.",
        "source_insight": "The phrase 'would need to be approved' clearly indicates a mandatory internal instruction.",
        "text": "Any deviations to these templates would need to be approved by Zebracorp Global Guarantee Center and/or Zebracorp Finance Legal."
      },
      "source_agent": "AGENT_2",
      "confidence": 0.99,
      "config_snapshot": {
        "name": "Strategic Advisor (Context)",
        "model": "gemini-2.5-flash",
        "temperature": 0.2,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_2_prompt.txt"
      }
    },
    {
      "id": "07346f6a-f4e4-4fea-a9db-0c888c126aae",
      "content": {
        "id": "v1w2x3y4-z5a6-b7c8-d9e0-f1g2h3i4j5k6",
        "type": "OTHER",
        "verbatim_text": "Final guarantee documentation should be delivered to Zebracorp Global Guarantee Center which will keep track on existing guarantees and which will store the guarantees.",
        "plain_text": "Final guarantee documentation must be delivered to the Zebracorp Global Guarantee Center for tracking and storage.",
        "expert_insight": "This establishes a centralized repository and management system for all guarantees, ensuring proper record-keeping and oversight.",
        "confidence": 0.98,
        "subtype": "INSTRUCTION",
        "justification": "Specifies the internal process for final delivery, tracking, and storage of guarantee documentation.",
        "implication_company": "Zebracorp has a centralized system for managing and monitoring all received guarantees.",
        "implication_supplier": "Suppliers should be aware of Zebracorp's internal process for handling final guarantee documents.",
        "source_insight": "The use of 'should be delivered' in this context implies a mandatory internal procedure for document management.",
        "text": "Final guarantee documentation should be delivered to Zebracorp Global Guarantee Center which will keep track on existing guarantees and which will store the guarantees."
      },
      "source_agent": "AGENT_2",
      "confidence": 0.98,
      "config_snapshot": {
        "name": "Strategic Advisor (Context)",
        "model": "gemini-2.5-flash",
        "temperature": 0.2,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_2_prompt.txt"
      }
    },
    {
      "id": "c5cb00e8-3009-40d5-b9e0-7f072866e196",
      "content": {
        "id": "a1b2c3d4-e5f6-7890-1234-567890abcdef",
        "type": "OTHER",
        "subtype": "INFO",
        "verbatim_text": "Zebracorp is generally relying on its suppliers having conducted necessary credit risk assessments on Zebracorp contracting entity and having satisfied itself as to the creditworthiness of Zebracorp.",
        "plain_text": "Zebracorp expects its suppliers to perform their own credit risk assessments on Zebracorp entities and confirm Zebracorp's creditworthiness.",
        "expert_insight": "This statement sets the baseline expectation for supplier due diligence, indicating Zebracorp's preference for suppliers to manage their own risk assessment regarding Zebracorp's credit.",
        "confidence": 1.0,
        "justification": "This explains Zebracorp's general stance on credit risk.",
        "implication_company": "Reduces the need for Zebracorp to provide guarantees.",
        "implication_supplier": "Suppliers must conduct their own credit risk assessments on Zebracorp.",
        "source_insight": "N/A",
        "text": "Zebracorp is generally relying on its suppliers having conducted necessary credit risk assessments on Zebracorp contracting entity and having satisfied itself as to the creditworthiness of Zebracorp."
      },
      "source_agent": "AGENT_4",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout A",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_4_prompt.txt"
      }
    },
    {
      "id": "3b10e2f9-96bb-43cb-be0e-cecced5ca46b",
      "content": {
        "id": "b2c3d4e5-f6a7-8901-2345-67890abcdef0",
        "type": "OTHER",
        "subtype": "INFO",
        "verbatim_text": "Any guarantee issued by Zebracorp would need to recorded in our financial accounts and would increase our financial liabilities.",
        "plain_text": "Issuing guarantees increases Zebracorp's financial liabilities and requires recording in financial accounts.",
        "expert_insight": "This highlights the financial impact and accounting implications of Zebracorp issuing guarantees, serving as a justification for its restrictive policy.",
        "confidence": 1.0,
        "justification": "Explains the financial burden of issuing guarantees.",
        "implication_company": "Increased financial liabilities and administrative burden.",
        "implication_supplier": "N/A",
        "source_insight": "N/A",
        "text": "Any guarantee issued by Zebracorp would need to recorded in our financial accounts and would increase our financial liabilities."
      },
      "source_agent": "AGENT_4",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout A",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_4_prompt.txt"
      }
    },
    {
      "id": "427803e1-a625-4016-aa4a-1da02b22d4ab",
      "content": {
        "id": "c3d4e5f6-a7b8-9012-3456-7890abcdef01",
        "type": "GUIDELINE",
        "classification": "CRITICAL",
        "verbatim_text": "For these reasons, the main rule is that Zebracorp does not give guarantees to our suppliers to guarantee Zebracorp´s payments.",
        "plain_text": "Zebracorp's primary policy is not to provide guarantees to suppliers for its own payments.",
        "expert_insight": "This is a fundamental policy statement. Suppliers should not expect Zebracorp to guarantee its payments, which is crucial for managing supplier expectations and contract negotiations.",
        "confidence": 1.0,
        "conditions": "N/A",
        "justification": "Based on the financial implications and the expectation that suppliers conduct their own credit assessments.",
        "implication_company": "Minimizes financial liabilities and administrative overhead related to guarantees.",
        "implication_supplier": "Suppliers cannot rely on Zebracorp guarantees for payment security.",
        "source_insight": "N/A",
        "text": "For these reasons, the main rule is that Zebracorp does not give guarantees to our suppliers to guarantee Zebracorp´s payments."
      },
      "source_agent": "AGENT_4",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout A",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_4_prompt.txt"
      }
    },
    {
      "id": "db00fbb4-0516-4062-ab87-8e54811821bd",
      "content": {
        "id": "d4e5f6a7-b8c9-0123-4567-890abcdef012",
        "type": "OTHER",
        "subtype": "INFO",
        "verbatim_text": "This applies to bank guarantees, Letters of Credit and other such external guarantees as well as parent company guarantees.",
        "plain_text": "The policy of not providing guarantees covers all types, including bank guarantees, Letters of Credit, and parent company guarantees.",
        "expert_insight": "This clarifies the broad scope of Zebracorp's 'no guarantee' policy, ensuring no specific type of guarantee is an unstated exception.",
        "confidence": 1.0,
        "justification": "Defines the scope of the main rule.",
        "implication_company": "Ensures consistency across all guarantee types.",
        "implication_supplier": "Suppliers should understand this policy applies broadly.",
        "source_insight": "N/A",
        "text": "This applies to bank guarantees, Letters of Credit and other such external guarantees as well as parent company guarantees."
      },
      "source_agent": "AGENT_4",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout A",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_4_prompt.txt"
      }
    },
    {
      "id": "584ac1f5-0323-4c22-b564-0eee2e7116e0",
      "content": {
        "id": "e5f6a7b8-c9d0-1234-5678-90abcdef0123",
        "type": "GUIDELINE",
        "classification": "CRITICAL",
        "verbatim_text": "Any exceptions to this will need to be handled as per Zebracorp Group Guarantee SOP and must be agreed with Zebracorp Global Guarantee Center.",
        "plain_text": "Any exceptions to Zebracorp's no-guarantee policy must follow the Zebracorp Group Guarantee SOP and require approval from the Zebracorp Global Guarantee Center.",
        "expert_insight": "This establishes a strict, centralized process for any deviation from the standard policy, indicating that exceptions are rare and require high-level authorization.",
        "confidence": 1.0,
        "conditions": "An exception to Zebracorp's no-guarantee policy is being considered.",
        "justification": "Ensures control and consistency in managing financial liabilities.",
        "implication_company": "Centralized control over guarantee exceptions; strict adherence to SOP.",
        "implication_supplier": "Exceptions are difficult to obtain and require specific internal Zebracorp processes.",
        "source_insight": "N/A",
        "text": "Any exceptions to this will need to be handled as per Zebracorp Group Guarantee SOP and must be agreed with Zebracorp Global Guarantee Center."
      },
      "source_agent": "AGENT_4",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout A",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_4_prompt.txt"
      }
    },
    {
      "id": "57da390b-364f-4547-8cd6-9ee6ee2944a6",
      "content": {
        "id": "f6a7b8c9-d0e1-2345-6789-0abcdef01234",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "In the event Zebracorp makes any advance payment or other prepayments to the supplier, Zebracorp may require a so called advance payment guarantee as a security from the supplier.",
        "plain_text": "If Zebracorp makes advance payments or prepayments to a supplier, it may request an advance payment guarantee from the supplier as security.",
        "expert_insight": "This outlines a potential requirement from Zebracorp to mitigate its own risk when making upfront payments, shifting the security burden to the supplier.",
        "confidence": 1.0,
        "conditions": "Zebracorp makes advance payments or other prepayments to the supplier.",
        "justification": "To secure Zebracorp's prepayments.",
        "implication_company": "Ability to secure advance payments.",
        "implication_supplier": "May be required to provide an advance payment guarantee for prepayments.",
        "source_insight": "N/A",
        "text": "In the event Zebracorp makes any advance payment or other prepayments to the supplier, Zebracorp may require a so called advance payment guarantee as a security from the supplier."
      },
      "source_agent": "AGENT_4",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout A",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_4_prompt.txt"
      }
    },
    {
      "id": "3895d7b4-b530-4fa6-869b-b8ecca770c25",
      "content": {
        "id": "a7b8c9d0-e1f2-3456-7890-abcdef012345",
        "type": "OTHER",
        "subtype": "INSTRUCTION",
        "verbatim_text": "The need for such advance payment guarantee depends on the value of the prepayment as well as other factors, and is ultimately decided by Procurement with F&C consultation.",
        "plain_text": "The decision to require an advance payment guarantee is based on prepayment value and other factors, and is made by Procurement in consultation with F&C.",
        "expert_insight": "This clarifies the internal decision-making process for requiring advance payment guarantees, indicating a joint assessment by Procurement and Finance & Control.",
        "confidence": 1.0,
        "justification": "Provides clarity on the decision-making process for requiring guarantees.",
        "implication_company": "Ensures a structured, collaborative decision process for guarantee requirements.",
        "implication_supplier": "The requirement for a guarantee is not automatic and is subject to internal Zebracorp assessment.",
        "source_insight": "N/A",
        "text": "The need for such advance payment guarantee depends on the value of the prepayment as well as other factors, and is ultimately decided by Procurement with F&C consultation."
      },
      "source_agent": "AGENT_4",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout A",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_4_prompt.txt"
      }
    },
    {
      "id": "3a7721ba-65d3-4fe3-9009-577fc475c12a",
      "content": {
        "id": "b8c9d0e1-f2a3-4567-8901-234567890abc",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "Zebracorp may also from time to time require performance bonds or guarantees from certain of its subcontractors in particular for key customer projects where the customer of Zebracorp is requesting such guarantees, or where such guarantee is otherwise found to be necessary in order to secure the performance of subcontractor’s obligations.",
        "plain_text": "Zebracorp may require performance bonds or guarantees from subcontractors, especially for key customer projects where the customer requests them, or if deemed necessary to ensure subcontractor performance.",
        "expert_insight": "This establishes Zebracorp's right to demand performance security from subcontractors, particularly when customer demands or project criticality necessitate it.",
        "confidence": 1.0,
        "conditions": "Key customer projects where the customer requests guarantees, or when necessary to secure subcontractor performance.",
        "justification": "To secure subcontractor performance and meet customer requirements.",
        "implication_company": "Ability to secure performance from subcontractors, especially for critical projects.",
        "implication_supplier": "Subcontractors may be required to provide performance bonds or guarantees.",
        "source_insight": "N/A",
        "text": "Zebracorp may also from time to time require performance bonds or guarantees from certain of its subcontractors in particular for key customer projects where the customer of Zebracorp is requesting such guarantees, or where such guarantee is otherwise found to be necessary in order to secure the performance of subcontractor’s obligations."
      },
      "source_agent": "AGENT_4",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout A",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_4_prompt.txt"
      }
    },
    {
      "id": "2a552f9f-cc37-4364-8522-fb6844064792",
      "content": {
        "id": "c9d0e1f2-a3b4-5678-9012-34567890abcd",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "Any guarantee to be issued in favor of Zebracorp must be from an international bank acceptable to Zebracorp.",
        "plain_text": "Guarantees provided to Zebracorp must originate from an international bank that Zebracorp deems acceptable.",
        "expert_insight": "This sets a standard for the source of bank guarantees, ensuring reliability and international recognition of the issuing institution.",
        "confidence": 1.0,
        "conditions": "A guarantee is issued in favor of Zebracorp.",
        "justification": "To ensure the reliability and enforceability of the guarantee.",
        "implication_company": "Ensures high quality and reliable guarantees.",
        "implication_supplier": "Must source guarantees from Zebracorp-approved international banks.",
        "source_insight": "N/A",
        "text": "Any guarantee to be issued in favor of Zebracorp must be from an international bank acceptable to Zebracorp."
      },
      "source_agent": "AGENT_4",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout A",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_4_prompt.txt"
      }
    },
    {
      "id": "a8183cab-77d3-4fc6-8c7b-8056d7ceebc0",
      "content": {
        "id": "d0e1f2a3-b4c5-6789-0123-4567890abcde",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "Bank rating should be investment grade (BBB-) at minimum.",
        "plain_text": "The issuing bank for a guarantee must have a minimum investment grade rating of BBB-.",
        "expert_insight": "This provides a specific, quantifiable creditworthiness requirement for banks issuing guarantees to Zebracorp, ensuring financial stability of the guarantor.",
        "confidence": 1.0,
        "conditions": "A bank is issuing a guarantee in favor of Zebracorp.",
        "justification": "To ensure the financial stability and reliability of the issuing bank.",
        "implication_company": "Ensures guarantees are backed by financially sound institutions.",
        "implication_supplier": "Must ensure their chosen bank meets this minimum rating.",
        "source_insight": "N/A",
        "text": "Bank rating should be investment grade (BBB-) at minimum."
      },
      "source_agent": "AGENT_4",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout A",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_4_prompt.txt"
      }
    },
    {
      "id": "0aba239c-ee2a-44c4-af4b-29a14c30b2d6",
      "content": {
        "id": "e1f2a3b4-c5d6-7890-1234-567890abcdef",
        "type": "OTHER",
        "subtype": "INFO",
        "verbatim_text": "A parent company guarantee may be preferred over a bank issued guarantee or bond due to the fact that guarantees/bonds issued by financial institutions carry a charge. This charge is often directly or indirectly passed on the prices paid by Zebracorp.",
        "plain_text": "Parent company guarantees might be preferred over bank guarantees because bank-issued instruments incur charges that can increase costs for Zebracorp.",
        "expert_insight": "This explains Zebracorp's preference for parent company guarantees, highlighting a cost-saving consideration that influences its choice of security.",
        "confidence": 1.0,
        "justification": "Cost efficiency.",
        "implication_company": "Potential cost savings by opting for parent company guarantees.",
        "implication_supplier": "May be asked to provide a parent company guarantee instead of a bank guarantee.",
        "source_insight": "N/A",
        "text": "A parent company guarantee may be preferred over a bank issued guarantee or bond due to the fact that guarantees/bonds issued by financial institutions carry a charge. This charge is often directly or indirectly passed on the prices paid by Zebracorp."
      },
      "source_agent": "AGENT_4",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout A",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_4_prompt.txt"
      }
    },
    {
      "id": "a739722a-04b9-44b5-ba8f-94e9dd61ce1f",
      "content": {
        "id": "f2a3b4c5-d6e7-8901-2345-67890abcdef0",
        "type": "GUIDELINE",
        "classification": "MEDIUM",
        "verbatim_text": "For this reason, the benefits of requesting supplier guarantees must be carefully assessed.",
        "plain_text": "The advantages of requiring supplier guarantees should be thoroughly evaluated, considering potential indirect costs.",
        "expert_insight": "This is an internal instruction to Zebracorp personnel to perform a cost-benefit analysis before requiring guarantees, acknowledging that such requirements can have hidden costs.",
        "confidence": 1.0,
        "conditions": "Considering requesting supplier guarantees.",
        "justification": "To ensure cost-effectiveness and avoid unnecessary charges.",
        "implication_company": "Requires internal assessment process for requesting guarantees.",
        "implication_supplier": "N/A",
        "source_insight": "N/A",
        "text": "For this reason, the benefits of requesting supplier guarantees must be carefully assessed."
      },
      "source_agent": "AGENT_4",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout A",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_4_prompt.txt"
      }
    },
    {
      "id": "f5efa68f-7c3b-470e-8652-e20dadf7620c",
      "content": {
        "id": "a3b4c5d6-e7f8-9012-3456-7890abcdef01",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "When using a corporate/parent company guarantees, it should however be noted that these are acceptable only if the credit rating of the issuing parent entity is BBB- at minimum.",
        "plain_text": "Corporate or parent company guarantees are only acceptable if the issuing parent entity has a minimum credit rating of BBB-.",
        "expert_insight": "This sets a specific creditworthiness threshold for parent companies providing guarantees, similar to banks, ensuring the financial strength of the guarantor.",
        "confidence": 1.0,
        "conditions": "A corporate/parent company guarantee is being provided.",
        "justification": "To ensure the financial stability and reliability of the issuing parent company.",
        "implication_company": "Ensures parent company guarantees are backed by financially sound entities.",
        "implication_supplier": "Parent companies must meet this minimum credit rating for their guarantees to be accepted.",
        "source_insight": "N/A",
        "text": "When using a corporate/parent company guarantees, it should however be noted that these are acceptable only if the credit rating of the issuing parent entity is BBB- at minimum."
      },
      "source_agent": "AGENT_4",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout A",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_4_prompt.txt"
      }
    },
    {
      "id": "8a77e0fd-a9d1-45a1-a995-851a7f20d985",
      "content": {
        "id": "b4c5d6e7-f8a9-0123-4567-890abcdef012",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "Also, for corporate/parent company guarantees Zebracorp´s model guarantee wordings should be used.",
        "plain_text": "Zebracorp's standard model wordings must be used for corporate or parent company guarantees.",
        "expert_insight": "This ensures legal consistency and protection by mandating the use of pre-approved legal language for parent company guarantees.",
        "confidence": 1.0,
        "conditions": "A corporate/parent company guarantee is being provided.",
        "justification": "To ensure legal consistency and protect Zebracorp's interests.",
        "implication_company": "Standardizes legal terms for guarantees, reducing legal risk.",
        "implication_supplier": "Must use Zebracorp's specified model wordings for parent company guarantees.",
        "source_insight": "N/A",
        "text": "Also, for corporate/parent company guarantees Zebracorp´s model guarantee wordings should be used."
      },
      "source_agent": "AGENT_4",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout A",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_4_prompt.txt"
      }
    },
    {
      "id": "7ca5f36d-efb4-4fb0-94ae-04c70a5fba22",
      "content": {
        "id": "c5d6e7f8-a9b0-1234-5678-90abcdef0123",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "The corporate/parent company guarantee should be under same applicable law as the supply agreement which is generally New York law.",
        "plain_text": "Corporate/parent company guarantees should be governed by the same law as the supply agreement, typically New York law.",
        "expert_insight": "This ensures legal coherence between the main supply agreement and the guarantee, simplifying legal enforcement and interpretation.",
        "confidence": 1.0,
        "conditions": "A corporate/parent company guarantee is being provided.",
        "justification": "To ensure legal consistency and simplify dispute resolution.",
        "implication_company": "Streamlines legal enforcement and interpretation.",
        "implication_supplier": "Guarantees must align with the governing law of the supply agreement (usually New York law).",
        "source_insight": "N/A",
        "text": "The corporate/parent company guarantee should be under same applicable law as the supply agreement which is generally New York law."
      },
      "source_agent": "AGENT_4",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout A",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_4_prompt.txt"
      }
    },
    {
      "id": "52e9d386-bde1-4e8a-a6fc-8b140a477648",
      "content": {
        "id": "d6e7f8a9-b0c1-2345-6789-0abcdef01234",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "Other governing law provisions should be cleared with Legal and Compliance or Finance.",
        "plain_text": "Any deviations from the standard governing law provisions for guarantees must be approved by Legal and Compliance or Finance.",
        "expert_insight": "This establishes a control mechanism for legal deviations, ensuring that any changes to governing law are vetted by relevant internal departments.",
        "confidence": 1.0,
        "conditions": "Governing law provisions for a guarantee differ from the standard.",
        "justification": "To manage legal risk and ensure proper vetting of non-standard legal terms.",
        "implication_company": "Ensures legal and financial oversight for non-standard governing laws.",
        "implication_supplier": "Non-standard governing law requests will require internal Zebracorp approval.",
        "source_insight": "N/A",
        "text": "Other governing law provisions should be cleared with Legal and Compliance or Finance."
      },
      "source_agent": "AGENT_4",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout A",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_4_prompt.txt"
      }
    },
    {
      "id": "5eee3692-62d6-46fe-ad60-4015b81c3fbc",
      "content": {
        "id": "e7f8a9b0-c1d2-3456-7890-abcdef012345",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "As for bank guarantees/performance bonds, Zebracorp should only accept so called on-demand guarantees or stand-by Letters of Credit.",
        "plain_text": "Zebracorp will only accept on-demand bank guarantees or stand-by Letters of Credit.",
        "expert_insight": "This specifies the preferred types of bank instruments, indicating a preference for instruments that are easily callable without requiring extensive proof of default, thus offering stronger security.",
        "confidence": 1.0,
        "conditions": "A bank guarantee or performance bond is being provided.",
        "justification": "To ensure guarantees are easily callable and provide strong security.",
        "implication_company": "Ensures quick and efficient access to funds/security when needed.",
        "implication_supplier": "Must provide specific types of bank guarantees (on-demand or stand-by L/C).",
        "source_insight": "N/A",
        "text": "As for bank guarantees/performance bonds, Zebracorp should only accept so called on-demand guarantees or stand-by Letters of Credit."
      },
      "source_agent": "AGENT_4",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout A",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_4_prompt.txt"
      }
    },
    {
      "id": "a9a2ab5f-954e-46bd-9389-d89881beae60",
      "content": {
        "id": "f8a9b0c1-d2e3-4567-8901-234567890abc",
        "type": "OTHER",
        "subtype": "INFO",
        "verbatim_text": "A template for an Advance Payment Guarantee can be found below. Other guarantee templates are available from Legal & Compliance.",
        "plain_text": "Templates for Advance Payment Guarantees are provided, and other guarantee templates are available from Legal & Compliance.",
        "expert_insight": "This informs users about the availability of standardized templates, promoting consistency and efficiency in guarantee documentation.",
        "confidence": 1.0,
        "justification": "Provides resources for drafting guarantees.",
        "implication_company": "Facilitates standardized documentation.",
        "implication_supplier": "Can obtain required templates from Zebracorp.",
        "source_insight": "N/A",
        "text": "A template for an Advance Payment Guarantee can be found below. Other guarantee templates are available from Legal & Compliance."
      },
      "source_agent": "AGENT_4",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout A",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_4_prompt.txt"
      }
    },
    {
      "id": "d06fb1fb-0d0c-44b4-b6b3-febb57220d2f",
      "content": {
        "id": "a9b0c1d2-e3f4-5678-9012-34567890abcd",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "Any deviations to these templates would need to be approved by Zebracorp Global Guarantee Center and/or Zebracorp Finance Legal.",
        "plain_text": "Any changes to Zebracorp's standard guarantee templates require approval from the Zebracorp Global Guarantee Center and/or Zebracorp Finance Legal.",
        "expert_insight": "This reinforces the importance of using standard templates and establishes a strict approval process for any modifications, maintaining control over legal terms.",
        "confidence": 1.0,
        "conditions": "Deviations from standard guarantee templates are proposed.",
        "justification": "To maintain legal consistency and control over guarantee terms.",
        "implication_company": "Ensures central control and legal review of non-standard guarantee wordings.",
        "implication_supplier": "Any proposed changes to templates will require Zebracorp's internal approval.",
        "source_insight": "N/A",
        "text": "Any deviations to these templates would need to be approved by Zebracorp Global Guarantee Center and/or Zebracorp Finance Legal."
      },
      "source_agent": "AGENT_4",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout A",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_4_prompt.txt"
      }
    },
    {
      "id": "1a17e1c6-3ea9-4677-b2f0-b50a06afd964",
      "content": {
        "id": "b0c1d2e3-f4a5-6789-0123-4567890abcde",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "Final guarantee documentation should be delivered to Zebracorp Global Guarantee Center which will keep track on existing guarantees and which will store the guarantees.",
        "plain_text": "All final guarantee documentation must be submitted to the Zebracorp Global Guarantee Center for tracking and storage.",
        "expert_insight": "This outlines the final procedural step for guarantee management, centralizing documentation for oversight and record-keeping.",
        "confidence": 1.0,
        "conditions": "Final guarantee documentation is ready.",
        "justification": "To ensure proper record-keeping, tracking, and central management of guarantees.",
        "implication_company": "Centralized management and oversight of all guarantees.",
        "implication_supplier": "Must submit final guarantee documentation to the specified Zebracorp center.",
        "source_insight": "N/A",
        "text": "Final guarantee documentation should be delivered to Zebracorp Global Guarantee Center which will keep track on existing guarantees and which will store the guarantees."
      },
      "source_agent": "AGENT_4",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout A",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_4_prompt.txt"
      }
    },
    {
      "id": "409cb1ea-2c4f-4047-9773-75c3997192fc",
      "content": {
        "id": "a1b2c3d4-e5f6-7890-1234-567890abcdef",
        "type": "OTHER",
        "subtype": "INFO",
        "verbatim_text": "Zebracorp is generally relying on its suppliers having conducted necessary credit risk assessments on Zebracorp contracting entity and having satisfied itself as to the creditworthiness of Zebracorp.",
        "plain_text": "Zebracorp expects suppliers to perform their own credit risk assessments on Zebracorp.",
        "expert_insight": "This statement sets the baseline expectation that suppliers are responsible for their due diligence regarding Zebracorp's creditworthiness, reducing Zebracorp's perceived obligation to provide guarantees.",
        "confidence": 1.0,
        "justification": "This explains Zebracorp's general stance on credit risk and why it typically doesn't issue guarantees.",
        "implication_company": "Reduces the need for Zebracorp to issue guarantees, minimizing financial liability and administrative burden.",
        "implication_supplier": "Suppliers must conduct their own credit risk assessments on Zebracorp.",
        "source_insight": "Directly stated in the text.",
        "text": "Zebracorp is generally relying on its suppliers having conducted necessary credit risk assessments on Zebracorp contracting entity and having satisfied itself as to the creditworthiness of Zebracorp."
      },
      "source_agent": "AGENT_5",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout B",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_5_prompt.txt"
      }
    },
    {
      "id": "28c8b7f7-c465-436a-bd41-0b0a64062a2d",
      "content": {
        "id": "b2c3d4e5-f6a7-8901-2345-67890abcdef0",
        "type": "OTHER",
        "subtype": "INFO",
        "verbatim_text": "Any guarantee issued by Zebracorp would need to recorded in our financial accounts and would increase our financial liabilities.",
        "plain_text": "Issuing guarantees increases Zebracorp's financial liabilities and requires financial accounting.",
        "expert_insight": "This highlights the financial impact and administrative overhead associated with issuing guarantees, providing a rationale for Zebracorp's restrictive policy.",
        "confidence": 1.0,
        "justification": "Explains the financial consequences of issuing guarantees.",
        "implication_company": "Guarantees impact financial statements and increase liabilities, necessitating strict control.",
        "implication_supplier": "N/A",
        "source_insight": "Directly stated in the text.",
        "text": "Any guarantee issued by Zebracorp would need to recorded in our financial accounts and would increase our financial liabilities."
      },
      "source_agent": "AGENT_5",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout B",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_5_prompt.txt"
      }
    },
    {
      "id": "5b7b9867-5999-45a6-8ee0-3792a2a4f376",
      "content": {
        "id": "c3d4e5f6-a7b8-9012-3456-7890abcdef01",
        "type": "GUIDELINE",
        "classification": "CRITICAL",
        "verbatim_text": "For these reasons, the main rule is that Zebracorp does not give guarantees to our suppliers to guarantee Zebracorp´s payments.",
        "plain_text": "Zebracorp's primary policy is not to provide guarantees to suppliers for Zebracorp's payments.",
        "expert_insight": "This is a core policy statement. Companies should strictly adhere to this to avoid increasing financial liabilities and to maintain financial discipline. It sets a strong precedent.",
        "confidence": 1.0,
        "conditions": "N/A - this is the general rule.",
        "justification": "Based on the need for suppliers to conduct credit assessments and the financial implications of issuing guarantees.",
        "implication_company": "Reduces financial risk and liability exposure for Zebracorp.",
        "implication_supplier": "Suppliers cannot expect payment guarantees from Zebracorp and must rely on their own credit assessments.",
        "source_insight": "Explicitly stated as 'the main rule'.",
        "text": "For these reasons, the main rule is that Zebracorp does not give guarantees to our suppliers to guarantee Zebracorp´s payments."
      },
      "source_agent": "AGENT_5",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout B",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_5_prompt.txt"
      }
    },
    {
      "id": "186b3844-c6a6-48af-a3ee-d111644f5031",
      "content": {
        "id": "d4e5f6a7-b8c9-0123-4567-890abcdef012",
        "type": "OTHER",
        "subtype": "INFO",
        "verbatim_text": "This applies to bank guarantees, Letters of Credit and other such external guarantees as well as parent company guarantees.",
        "plain_text": "The policy of not providing guarantees covers all types of guarantees, including bank guarantees, Letters of Credit, and parent company guarantees.",
        "expert_insight": "This clarifies the scope of Zebracorp's 'no guarantee' policy, ensuring it's broadly understood to cover various financial instruments.",
        "confidence": 1.0,
        "justification": "Clarifies the types of guarantees covered by the main rule.",
        "implication_company": "Ensures consistent application of the no-guarantee policy across all guarantee types.",
        "implication_supplier": "Suppliers should not request any form of guarantee from Zebracorp.",
        "source_insight": "Directly stated as an application of the main rule.",
        "text": "This applies to bank guarantees, Letters of Credit and other such external guarantees as well as parent company guarantees."
      },
      "source_agent": "AGENT_5",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout B",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_5_prompt.txt"
      }
    },
    {
      "id": "abf0c365-749b-4361-aeb2-060c042a4ba0",
      "content": {
        "id": "e5f6a7b8-c9d0-1234-5678-90abcdef0123",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "Any exceptions to this will need to be handled as per Zebracorp Group Guarantee SOP and must be agreed with Zebracorp Global Guarantee Center.",
        "plain_text": "Any exceptions to Zebracorp's no-guarantee policy must follow the Zebracorp Group Guarantee SOP and require approval from the Zebracorp Global Guarantee Center.",
        "expert_insight": "This establishes a strict control mechanism for any deviations from the core policy, centralizing approval and ensuring adherence to internal procedures. This is critical for risk management.",
        "confidence": 1.0,
        "conditions": "An exception to Zebracorp's no-guarantee policy is being considered.",
        "justification": "To maintain control over financial liabilities and ensure consistency.",
        "implication_company": "Requires a formal process and central approval for any guarantee issuance, mitigating unauthorized risk.",
        "implication_supplier": "Suppliers seeking a guarantee must understand that it's an exception requiring significant internal Zebracorp approval.",
        "source_insight": "Explicitly states how exceptions 'will need to be handled'.",
        "text": "Any exceptions to this will need to be handled as per Zebracorp Group Guarantee SOP and must be agreed with Zebracorp Global Guarantee Center."
      },
      "source_agent": "AGENT_5",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout B",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_5_prompt.txt"
      }
    },
    {
      "id": "4fcd0ba7-cb3e-4a81-acee-883e849a8456",
      "content": {
        "id": "f6a7b8c9-d0e1-2345-6789-0abcdef01234",
        "type": "GUIDELINE",
        "classification": "MEDIUM",
        "verbatim_text": "In the event Zebracorp makes any advance payment or other prepayments to the supplier, Zebracorp may require a so called advance payment guarantee as a security from the supplier.",
        "plain_text": "Zebracorp may require an advance payment guarantee from a supplier if Zebracorp makes advance payments or prepayments.",
        "expert_insight": "This is a standard risk mitigation strategy. When Zebracorp pays upfront, it's exposed to the risk of non-performance or default by the supplier. An advance payment guarantee protects Zebracorp's investment.",
        "confidence": 1.0,
        "conditions": "Zebracorp makes advance payments or prepayments to a supplier.",
        "justification": "To secure Zebracorp's advance payments and mitigate risk of supplier non-performance.",
        "implication_company": "Provides financial security for prepayments, reducing risk.",
        "implication_supplier": "Suppliers receiving advance payments may be required to provide an advance payment guarantee, incurring associated costs or administrative effort.",
        "source_insight": "States what Zebracorp 'may require'.",
        "text": "In the event Zebracorp makes any advance payment or other prepayments to the supplier, Zebracorp may require a so called advance payment guarantee as a security from the supplier."
      },
      "source_agent": "AGENT_5",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout B",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_5_prompt.txt"
      }
    },
    {
      "id": "89aa8799-8b91-44ef-b82e-fd949d97faeb",
      "content": {
        "id": "a7b8c9d0-e1f2-3456-7890-abcdef012345",
        "type": "OTHER",
        "subtype": "INFO",
        "verbatim_text": "The need for such advance payment guarantee depends on the value of the prepayment as well as other factors, and is ultimately decided by Procurement with F&C consultation.",
        "plain_text": "The decision to require an advance payment guarantee is made by Procurement, in consultation with F&C, based on prepayment value and other factors.",
        "expert_insight": "This outlines the internal decision-making process for requiring advance payment guarantees, emphasizing a collaborative approach between procurement and finance to assess risk.",
        "confidence": 1.0,
        "justification": "Explains the decision-making process for requiring advance payment guarantees.",
        "implication_company": "Ensures a structured and informed decision-making process for risk mitigation.",
        "implication_supplier": "N/A",
        "source_insight": "Directly states how the need 'is ultimately decided'.",
        "text": "The need for such advance payment guarantee depends on the value of the prepayment as well as other factors, and is ultimately decided by Procurement with F&C consultation."
      },
      "source_agent": "AGENT_5",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout B",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_5_prompt.txt"
      }
    },
    {
      "id": "f11ef0f9-6e0a-4f9c-9275-3aa6c7cd73ba",
      "content": {
        "id": "b8c9d0e1-f2a3-4567-8901-abcdef012346",
        "type": "GUIDELINE",
        "classification": "MEDIUM",
        "verbatim_text": "Zebracorp may also from time to time require performance bonds or guarantees from certain of its subcontractors in particular for key customer projects where the customer of Zebracorp is requesting such guarantees, or where such guarantee is otherwise found to be necessary in order to secure the performance of subcontractor’s obligations.",
        "plain_text": "Zebracorp may require performance bonds or guarantees from subcontractors, especially for key customer projects where the customer demands them, or when necessary to secure subcontractor performance.",
        "expert_insight": "This highlights Zebracorp's right to seek performance security from subcontractors, particularly when its own customers require it or when there's a significant risk to subcontractor performance. This is crucial for managing project risk and fulfilling contractual obligations to end-customers.",
        "confidence": 1.0,
        "conditions": "Key customer projects where the customer requests guarantees, or when necessary to secure subcontractor performance.",
        "justification": "To mitigate risks associated with subcontractor performance and meet customer requirements.",
        "implication_company": "Enables Zebracorp to manage project risks and meet customer demands more effectively.",
        "implication_supplier": "Subcontractors may be required to provide performance bonds or guarantees, adding to their project costs and administrative burden.",
        "source_insight": "States what Zebracorp 'may... require'.",
        "text": "Zebracorp may also from time to time require performance bonds or guarantees from certain of its subcontractors in particular for key customer projects where the customer of Zebracorp is requesting such guarantees, or where such guarantee is otherwise found to be necessary in order to secure the performance of subcontractor’s obligations."
      },
      "source_agent": "AGENT_5",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout B",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_5_prompt.txt"
      }
    },
    {
      "id": "86275e2e-44d7-45ae-993a-1515666a4d9c",
      "content": {
        "id": "c9d0e1f2-a3b4-5678-9012-abcdef012347",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "Any guarantee to be issued in favor of Zebracorp must be from an international bank acceptable to Zebracorp.",
        "plain_text": "Guarantees issued in favor of Zebracorp must come from an international bank approved by Zebracorp.",
        "expert_insight": "This ensures the reliability and enforceability of the guarantee by specifying the source. An 'international bank' suggests a preference for institutions with global reach and stability, while 'acceptable to Zebracorp' allows for specific due diligence.",
        "confidence": 1.0,
        "conditions": "A guarantee is issued in favor of Zebracorp.",
        "justification": "To ensure the reliability, enforceability, and creditworthiness of the issuing institution.",
        "implication_company": "Protects Zebracorp by ensuring guarantees are issued by reputable financial institutions.",
        "implication_supplier": "Suppliers must obtain guarantees from international banks that Zebracorp finds acceptable.",
        "source_insight": "Uses the imperative 'must be'.",
        "text": "Any guarantee to be issued in favor of Zebracorp must be from an international bank acceptable to Zebracorp."
      },
      "source_agent": "AGENT_5",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout B",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_5_prompt.txt"
      }
    },
    {
      "id": "74491ddd-3ec5-41f6-b0b6-5e8a27a0edd5",
      "content": {
        "id": "d0e1f2a3-b4c5-6789-0123-abcdef012348",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "Bank rating should be investment grade (BBB-) at minimum.",
        "plain_text": "The issuing bank for a guarantee must have a minimum investment grade rating of BBB-.",
        "expert_insight": "This sets a clear, objective standard for the financial strength of the issuing bank, directly linking the quality of the guarantee to the bank's creditworthiness. This is a critical risk control measure.",
        "confidence": 1.0,
        "conditions": "A guarantee is issued by a bank in favor of Zebracorp.",
        "justification": "To ensure the financial stability and credibility of the bank issuing the guarantee.",
        "implication_company": "Minimizes the risk of the guarantee issuer defaulting, enhancing the security of the guarantee.",
        "implication_supplier": "Suppliers must ensure their chosen bank meets Zebracorp's minimum credit rating requirements.",
        "source_insight": "Uses the imperative 'should be' in a context of strong recommendation/requirement.",
        "text": "Bank rating should be investment grade (BBB-) at minimum."
      },
      "source_agent": "AGENT_5",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout B",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_5_prompt.txt"
      }
    },
    {
      "id": "64ae9da4-a4e9-478e-b1ec-b61fd80fb448",
      "content": {
        "id": "e1f2a3b4-c5d6-7890-1234-abcdef012349",
        "type": "OTHER",
        "subtype": "TACTIC",
        "verbatim_text": "A parent company guarantee may be preferred over a bank issued guarantee or bond due to the fact that guarantees/bonds issued by financial institutions carry a charge.",
        "plain_text": "Parent company guarantees might be preferred over bank guarantees or bonds because financial institutions charge fees for their guarantees.",
        "expert_insight": "This outlines a strategic preference driven by cost considerations. Parent company guarantees can bypass the fees associated with bank instruments, potentially leading to cost savings for Zebracorp.",
        "confidence": 1.0,
        "justification": "Financial institutions charge fees for issuing guarantees, which can increase costs.",
        "implication_company": "Potential cost savings by opting for parent company guarantees.",
        "implication_supplier": "Suppliers might be encouraged to provide parent company guarantees if they have a suitable parent entity, potentially saving them bank fees.",
        "source_insight": "States a preference and provides a reason ('due to the fact that').",
        "text": "A parent company guarantee may be preferred over a bank issued guarantee or bond due to the fact that guarantees/bonds issued by financial institutions carry a charge."
      },
      "source_agent": "AGENT_5",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout B",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_5_prompt.txt"
      }
    },
    {
      "id": "268af23a-defb-4f2c-9033-3ece19d43e48",
      "content": {
        "id": "f2a3b4c5-d6e7-8901-2345-abcdef012350",
        "type": "OTHER",
        "subtype": "INFO",
        "verbatim_text": "This charge is often directly or indirectly passed on the prices paid by Zebracorp.",
        "plain_text": "The fees for bank-issued guarantees are often passed on to Zebracorp through higher prices.",
        "expert_insight": "This clarifies why Zebracorp prefers parent company guarantees – to avoid these passed-on costs, which ultimately impact Zebracorp's bottom line.",
        "confidence": 1.0,
        "justification": "Explains the financial impact of bank guarantee charges on Zebracorp.",
        "implication_company": "Directly impacts Zebracorp's procurement costs.",
        "implication_supplier": "N/A",
        "source_insight": "Directly stated as a consequence.",
        "text": "This charge is often directly or indirectly passed on the prices paid by Zebracorp."
      },
      "source_agent": "AGENT_5",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout B",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_5_prompt.txt"
      }
    },
    {
      "id": "76be9ca6-2139-4351-a573-e046c6dd283e",
      "content": {
        "id": "a3b4c5d6-e7f8-9012-3456-abcdef012351",
        "type": "GUIDELINE",
        "classification": "MEDIUM",
        "verbatim_text": "For this reason, the benefits of requesting supplier guarantees must be carefully assessed.",
        "plain_text": "Due to potential costs, the advantages of requiring supplier guarantees must be thoroughly evaluated.",
        "expert_insight": "This emphasizes a cost-benefit analysis approach. While guarantees offer security, their associated costs (passed on by suppliers) can erode the financial benefit. Zebracorp should only request them when the risk mitigation outweighs the cost.",
        "confidence": 1.0,
        "conditions": "Considering requesting a supplier guarantee.",
        "justification": "To ensure that the cost of the guarantee (often passed on by the supplier) does not outweigh its benefits.",
        "implication_company": "Requires a diligent assessment process to balance risk mitigation with cost efficiency.",
        "implication_supplier": "N/A",
        "source_insight": "Uses the imperative 'must be carefully assessed'.",
        "text": "For this reason, the benefits of requesting supplier guarantees must be carefully assessed."
      },
      "source_agent": "AGENT_5",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout B",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_5_prompt.txt"
      }
    },
    {
      "id": "2e3ef269-393a-4e20-9ba8-b69893512bc1",
      "content": {
        "id": "b4c5d6e7-f8a9-0123-4567-abcdef012352",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "When using a corporate/parent company guarantees, it should however be noted that these are acceptable only if the credit rating of the issuing parent entity is BBB- at minimum.",
        "plain_text": "Corporate or parent company guarantees are only acceptable if the issuing parent entity has a minimum credit rating of BBB-.",
        "expert_insight": "This sets a crucial condition for accepting parent company guarantees, mirroring the requirement for banks. It ensures that the parent company itself is financially sound enough to honor the guarantee, mitigating the risk of a worthless guarantee.",
        "confidence": 1.0,
        "conditions": "A corporate/parent company guarantee is being provided.",
        "justification": "To ensure the financial credibility and ability of the parent company to honor the guarantee.",
        "implication_company": "Ensures the financial strength of the guarantor, protecting Zebracorp.",
        "implication_supplier": "Suppliers offering parent company guarantees must ensure their parent entity meets the minimum credit rating.",
        "source_insight": "Uses 'acceptable only if'.",
        "text": "When using a corporate/parent company guarantees, it should however be noted that these are acceptable only if the credit rating of the issuing parent entity is BBB- at minimum."
      },
      "source_agent": "AGENT_5",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout B",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_5_prompt.txt"
      }
    },
    {
      "id": "dd148d3d-b3b4-4357-a722-45a730419a05",
      "content": {
        "id": "c5d6e7f8-a9b0-1234-5678-abcdef012353",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "Also, for corporate/parent company guarantees Zebracorp´s model guarantee wordings should be used.",
        "plain_text": "Zebracorp's standard model guarantee wordings must be used for corporate or parent company guarantees.",
        "expert_insight": "Using standardized wording is critical to ensure legal enforceability and consistency across all guarantees. It prevents ambiguities and ensures the guarantee aligns with Zebracorp's legal requirements.",
        "confidence": 1.0,
        "conditions": "A corporate/parent company guarantee is being provided.",
        "justification": "To ensure legal consistency, clarity, and enforceability of the guarantee terms.",
        "implication_company": "Standardizes legal terms, reducing risk and administrative effort.",
        "implication_supplier": "Suppliers providing parent company guarantees must use Zebracorp's specific wording.",
        "source_insight": "Uses 'should be used' in a prescriptive manner.",
        "text": "Also, for corporate/parent company guarantees Zebracorp´s model guarantee wordings should be used."
      },
      "source_agent": "AGENT_5",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout B",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_5_prompt.txt"
      }
    },
    {
      "id": "807940dc-5098-4276-b5e4-bc060daf1771",
      "content": {
        "id": "d6e7f8a9-b0c1-2345-6789-abcdef012354",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "The corporate/parent company guarantee should be under same applicable law as the supply agreement which is generally New York law.",
        "plain_text": "Corporate/parent company guarantees should be governed by the same law as the supply agreement, typically New York law.",
        "expert_insight": "This ensures legal consistency and avoids conflicts of law, simplifying dispute resolution. Aligning the governing law for both the main contract and the guarantee is a best practice.",
        "confidence": 1.0,
        "conditions": "A corporate/parent company guarantee is being provided.",
        "justification": "To ensure legal consistency and avoid conflicts of law between the guarantee and the underlying supply agreement.",
        "implication_company": "Simplifies legal interpretation and enforcement by ensuring consistent governing law.",
        "implication_supplier": "Suppliers must ensure their parent company guarantee specifies the same governing law as the supply agreement.",
        "source_insight": "Uses 'should be under' in a strong recommendation context.",
        "text": "The corporate/parent company guarantee should be under same applicable law as the supply agreement which is generally New York law."
      },
      "source_agent": "AGENT_5",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout B",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_5_prompt.txt"
      }
    },
    {
      "id": "9b83018c-2df6-4b23-b1f8-ab928e2cbbab",
      "content": {
        "id": "e7f8a9b0-c1d2-3456-7890-abcdef012355",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "Other governing law provisions should be cleared with Legal and Compliance or Finance.",
        "plain_text": "Any governing law provisions other than New York law for guarantees must be approved by Zebracorp's Legal and Compliance or Finance departments.",
        "expert_insight": "This acts as a control point for any deviations from the preferred governing law, ensuring that legal and financial experts assess the implications of different jurisdictions.",
        "confidence": 1.0,
        "conditions": "A governing law other than New York law is proposed for a guarantee.",
        "justification": "To ensure proper legal and financial assessment of alternative governing law provisions.",
        "implication_company": "Maintains control over legal risks associated with governing law variations.",
        "implication_supplier": "Suppliers proposing alternative governing laws will face an internal approval process within Zebracorp.",
        "source_insight": "Uses 'should be cleared with' as a mandatory step.",
        "text": "Other governing law provisions should be cleared with Legal and Compliance or Finance."
      },
      "source_agent": "AGENT_5",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout B",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_5_prompt.txt"
      }
    },
    {
      "id": "8780c02e-013d-4002-9407-8e7a63e29122",
      "content": {
        "id": "f8a9b0c1-d2e3-4567-8901-abcdef012356",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "As for bank guarantees/performance bonds, Zebracorp should only accept so called on-demand guarantees or stand-by Letters of Credit.",
        "plain_text": "Zebracorp will only accept on-demand guarantees or stand-by Letters of Credit for bank guarantees and performance bonds.",
        "expert_insight": "This is a critical requirement for the type of guarantee. 'On-demand' guarantees are highly desirable as they require the bank to pay out immediately upon presentation of a demand, without needing to prove the underlying breach, making them much easier and faster to enforce.",
        "confidence": 1.0,
        "conditions": "A bank guarantee or performance bond is being provided.",
        "justification": "To ensure swift and unconditional enforceability of the guarantee without requiring proof of default.",
        "implication_company": "Provides stronger and more readily accessible security for Zebracorp.",
        "implication_supplier": "Suppliers must ensure their bank guarantees or performance bonds are structured as on-demand guarantees or stand-by Letters of Credit.",
        "source_insight": "Uses 'should only accept' as a strict limitation.",
        "text": "As for bank guarantees/performance bonds, Zebracorp should only accept so called on-demand guarantees or stand-by Letters of Credit."
      },
      "source_agent": "AGENT_5",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout B",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_5_prompt.txt"
      }
    },
    {
      "id": "3c22d4b7-3c2c-4c49-b360-dad6b42389a8",
      "content": {
        "id": "a9b0c1d2-e3f4-5678-9012-abcdef012357",
        "type": "OTHER",
        "subtype": "INFO",
        "verbatim_text": "A template for an Advance Payment Guarantee can be found below. Other guarantee templates are available from Legal & Compliance.",
        "plain_text": "Templates for Advance Payment Guarantees and other guarantees are available from Legal & Compliance.",
        "expert_insight": "This provides practical guidance on where to obtain standardized documentation, reinforcing the requirement to use Zebracorp's preferred wording and formats.",
        "confidence": 1.0,
        "justification": "Provides information on the availability of standard templates.",
        "implication_company": "Streamlines the process of obtaining correct guarantee documentation.",
        "implication_supplier": "Suppliers providing guarantees should inquire about Zebracorp's templates.",
        "source_insight": "Directly states the availability of templates.",
        "text": "A template for an Advance Payment Guarantee can be found below. Other guarantee templates are available from Legal & Compliance."
      },
      "source_agent": "AGENT_5",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout B",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_5_prompt.txt"
      }
    },
    {
      "id": "6c17f61e-aa75-41fd-9bd5-3f0358cd79b8",
      "content": {
        "id": "b0c1d2e3-f4a5-6789-0123-abcdef012358",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "Any deviations to these templates would need to be approved by Zebracorp Global Guarantee Center and/or Zebracorp Finance Legal.",
        "plain_text": "Any modifications to Zebracorp's guarantee templates require approval from the Zebracorp Global Guarantee Center and/or Zebracorp Finance Legal.",
        "expert_insight": "This is a critical control measure to prevent unauthorized changes to legal documents. Deviations could introduce unforeseen risks or weaken the guarantee's enforceability. Centralized approval ensures legal and financial scrutiny.",
        "confidence": 1.0,
        "conditions": "A deviation from Zebracorp's guarantee templates is proposed.",
        "justification": "To maintain legal consistency, mitigate risks, and ensure proper review of any changes to standard guarantee terms.",
        "implication_company": "Ensures that any changes to guarantee templates are properly vetted and approved, protecting Zebracorp's interests.",
        "implication_supplier": "Suppliers proposing changes to guarantee templates must understand the rigorous internal approval process required by Zebracorp.",
        "source_insight": "Uses 'would need to be approved' as a mandatory step.",
        "text": "Any deviations to these templates would need to be approved by Zebracorp Global Guarantee Center and/or Zebracorp Finance Legal."
      },
      "source_agent": "AGENT_5",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout B",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_5_prompt.txt"
      }
    },
    {
      "id": "47883e81-b8f7-4980-ab18-a42629bb3920",
      "content": {
        "id": "c1d2e3f4-a5b6-7890-1234-abcdef012359",
        "type": "GUIDELINE",
        "classification": "HIGH",
        "verbatim_text": "Final guarantee documentation should be delivered to Zebracorp Global Guarantee Center which will keep track on existing guarantees and which will store the guarantees.",
        "plain_text": "The Zebracorp Global Guarantee Center is responsible for tracking and storing all final guarantee documentation.",
        "expert_insight": "This establishes a central repository and management function for all guarantees, which is essential for proper record-keeping, monitoring expiry dates, and ensuring accessibility for enforcement or audit purposes.",
        "confidence": 1.0,
        "conditions": "Final guarantee documentation is available.",
        "justification": "To ensure centralized tracking, storage, and management of all guarantees for audit and enforcement purposes.",
        "implication_company": "Ensures proper governance and management of guarantee portfolio, reducing administrative and compliance risks.",
        "implication_supplier": "N/A",
        "source_insight": "Uses 'should be delivered' and describes the function of the center.",
        "text": "Final guarantee documentation should be delivered to Zebracorp Global Guarantee Center which will keep track on existing guarantees and which will store the guarantees."
      },
      "source_agent": "AGENT_5",
      "confidence": 1.0,
      "config_snapshot": {
        "name": "General Scout B",
        "model": "gemini-2.5-flash",
        "temperature": 0.5,
        "top_p": 0.95,
        "max_output_tokens": 65536,
        "prompt_file": "prompts/agent_5_prompt.txt"
      }
    }
  ]
}